[{"bggId":"371785","name":"Memory Island","description":"You have to find and rescue endangered animals scattered here and there. Check where the animals are, add their numbers, and make 10 &mdash; then you can bring them to a safe place! The first to rescue ten animals wins!&#10;&#10;Memory Island is a memory/arithmetic game for 2-4 players. Make the sum of the numbers equal to 10, and be the first player to collect ten cards to win.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":5,"maxPlayTime":10,"minAge":6,"categoriesAndMechanics":["Educational","Math","Memory","Memory"],"rating":3.01,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/2NU8FG59rMdWaVz6tH_vHw__thumb/img/zBvHOS821pQmL1Wtzdz6RbF-H_c=/fit-in/200x150/filters:strip_icc()/pic7098925.png","urlImage":"https://cf.geekdo-images.com/2NU8FG59rMdWaVz6tH_vHw__original/img/7xMpZxFt87PzAj7Tz2pxiYti_nY=/0x0/filters:format(png)/pic7098925.png"},{"bggId":"371786","name":"Stormsein","description":"The wind howls, the sea beats against the dunes. The storm signal is on! The islanders rush to the beach to comb washed up wood.&#10;&#10;You leave with your pawn from your village to the beach where you will go beach combing. Whoever has first collected 10 pieces of wood, has moored his boat in the harbor and has driven the jeep back to his house, wins.&#10;&#10;Turn sequence: &#10;&#10;     If you have colluded enough wood for a truck or boat, place it&#10;     Draw a card and follow instructions on placing new wood and floating wood&#10;     Throw the dice&#10;     Move your pieces and collect wood in the fields where you end your move &#10;&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":60,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Racing","Roll / Spin and Move"],"rating":3.5,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/4eyz-yV1IPc1SIwK6u-qUQ__thumb/img/rWLAZyyAGddyLsgxEr12QQqhM_k=/fit-in/200x150/filters:strip_icc()/pic7101258.jpg","urlImage":"https://cf.geekdo-images.com/4eyz-yV1IPc1SIwK6u-qUQ__original/img/P2U5BfnPIjuMdn8c6F58FtXkolM=/0x0/filters:format(jpeg)/pic7101258.jpg"},{"bggId":"371788","name":"Xixx","description":"Xixx utilises six multi coloured and multi symbolled dice with which the players try to score a total of 100 points. Different combinations of the dice produce different scores. There are six shapes, circle, eye, triangle, square, pentagon and hexagon in four colours, red, blue, yellow and green. Harder combinations are worth more points.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":15,"maxPlayTime":30,"minAge":7,"categoriesAndMechanics":["Dice","Dice Rolling"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/TuTQIqq_tkEHN3zLXbtrFA__thumb/img/lBnpyv0JHqw-brIfzolzeBEctAs=/fit-in/200x150/filters:strip_icc()/pic7103460.jpg","urlImage":"https://cf.geekdo-images.com/TuTQIqq_tkEHN3zLXbtrFA__original/img/D6y3u3zCdm8wAE_ez1BaeNPL2Ok=/0x0/filters:format(jpeg)/pic7103460.jpg"},{"bggId":"371790","name":"Trigahex","description":"Summary:&#10;- Trigahex is a strategic abstract card game for 2-6 players.&#10;- Play individually or in a team.&#10;- Suitable for ages 8+.&#10;- Players can choose the length of play by deciding how many Hexagons win the game (1, 2 or 3). Approximately 10 minutes - 40 minutes.&#10;&#10;The Playing Cards:&#10;Trigahex includes three Triangle coloured decks of cards (54 x Red, 54 x Blue and 54 x Green).&#10;Each player or team chooses a colour to play with.&#10;&#10;The Object of the Game:&#10;The first person or team to create the winning number of Hexagons wins the game.&#10;&#10;Win a Hexagon by placing 6 of your cards together to create a Hexagon shape.  All the cards in the Hexagon MUST have your chosen playing card colour in the centre of the card.&#10;&#10;Before you play:&#10;Decide how many Hexagons to play to win the game (1, 2, or 3).&#10;&#10;The first player places a card in the game area,  Players then take turns to place a card adjacent to the card/s placed.  The colours on the edges of the cards MUST match the edges of the cards they are placed next to.&#10;&#10;Try to create your own Hexagon/s or stop your opponent from creating their Hexagon/s.&#10;&#10;If a player places a card that has a White Triangle in the middle, they also pick up an action card.&#10;&#10;The 'Trash' action card:&#10;A player trashes a card from the game area and it is returned to the bottom of the draw stack.&#10;&#10;The 'Replace' action card:&#10;A player replaces a card from the game area with a card in their hand.  The edges of the card must match any cards in the game area.  The replaced card is returned to the the bottom of the draw stack.&#10;&#10;The 'Stack' action card:&#10;A player stacks a card from their hand on top of a card in the game area.  The edges of the card must match the edges of any cards it is adjacent to.  The card underneath remains and is stuck in the game area.&#10;&#10;-description from designer&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":10,"maxPlayTime":40,"minAge":8,"categoriesAndMechanics":["Abstract Strategy","Hexagon Grid","Matching","Pattern Building","Team-Based Game"],"rating":3.857145,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/FgnhzaiilLLoarF0lAdEGw__thumb/img/PDevtiOpkwSNWVRn_esNLIt7u1w=/fit-in/200x150/filters:strip_icc()/pic7115683.png","urlImage":"https://cf.geekdo-images.com/FgnhzaiilLLoarF0lAdEGw__original/img/-hP1WABjCZdFjF13fHsKgFZmpkQ=/0x0/filters:format(png)/pic7115683.png"},{"bggId":"371795","name":"Grab & Play Game: The World","description":"Roll the die then draw a card and read the corresponding question/direction. Some require the use of the map (e.g. which country borders this country on the east). If you are correct, draw a token, which is worth the number of points shown. 1st P to collect 100 pts in tokens wins.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":10,"maxPlayTime":40,"minAge":8,"categoriesAndMechanics":["Children's Game","Educational","Trivia","Questions and Answers"],"rating":1.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/8VM3lRRvps-c3e7U3wzg9A__thumb/img/2g97Lu249b6mbAKRDq2LzPnbr2Q=/fit-in/200x150/filters:strip_icc()/pic7099467.jpg","urlImage":"https://cf.geekdo-images.com/8VM3lRRvps-c3e7U3wzg9A__original/img/VZKNMNNaKlSDUioC3KLCKMB8qE4=/0x0/filters:format(jpeg)/pic7099467.jpg"},{"bggId":"371796","name":"Strength & Honour: Wargames Rules for Epic Battles in the Ancient World","description":"The game allows you to recreate battles from the start of the Marian reforms in Rome around 105BC, when the professional Roman legionaries organised in cohorts replaced the older Republican Legion structure of maniples, through to about 200AD.&#10;&#10;Command armies of the Ancient World on a massive scale with these innovative and fun rules that put you in charge for the classic encounters of antiquity.&#10;&#10;Designed for large battles in smaller scales, Strength &amp; Honour allows you to take to the field at the head of massed ranks of thousands of warriors.&#10;&#10;With scenarios included for 10 battles you will take the role of leaders such as Julius Caesar, Boudicca and Pompey.&#10;&#10;In addition to the rules, Strength &amp; Honour includes twenty army lists covering the Ancient world from the island of Britannia in the west to the mystic East beyond the Mediterranean; Germania&rsquo;s forests in the north and the deserts and mountains of north Africa in the south.&#10;&#10;Battles focus on large units so for example a legion is the basic unit building block of a Roman army.&#10;&#10;While the rules were designed for 2mm figures they are playable with any sized figures, or indeed printable top down units which are also available.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":120,"maxPlayTime":480,"minAge":12,"categoriesAndMechanics":["Ancient","Book","Dice","Miniatures","Wargame","Dice Rolling","Grid Movement","Measurement Movement","Movement Points","Variable Phase Order","Zone of Control"],"rating":4.22222,"complexity":2.25,"urlThumb":"https://cf.geekdo-images.com/ycXTFyDJitGYoTMtJ7C8lg__thumb/img/Mln3qi8laftZSBYLRuCG9gi_DHE=/fit-in/200x150/filters:strip_icc()/pic7100393.jpg","urlImage":"https://cf.geekdo-images.com/ycXTFyDJitGYoTMtJ7C8lg__original/img/wrv-uFeDnxGDZIZ5phlhTdAKrx8=/0x0/filters:format(jpeg)/pic7100393.jpg"},{"bggId":"371798","name":"Dated","description":"Dated is a trivia game for people who suck at trivia. The rules are simple. Each round, one player picks a category and reads the title out loud. All other players take turns guessing the year it was released. The closest guess wins the card! The first player to ten cards wins the game.&#10;&#10;-description from publisher&#10;&#10;","minPlayers":3,"maxPlayers":20,"minPlayTime":15,"maxPlayTime":90,"minAge":13,"categoriesAndMechanics":["Card Game","Movies / TV / Radio theme","Party Game","Trivia","Questions and Answers"],"rating":3.21875,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/h3y2pn8qz0Lj_kgEaRvjIQ__thumb/img/46aUaGzGjvrG0ptNXjWEMgyhaj8=/fit-in/200x150/filters:strip_icc()/pic7100961.jpg","urlImage":"https://cf.geekdo-images.com/h3y2pn8qz0Lj_kgEaRvjIQ__original/img/a9OgatGMKRFkKLNGIVTOlQAuTVc=/0x0/filters:format(jpeg)/pic7100961.jpg"},{"bggId":"371801","name":"The Pyramid of Ayoyo Farm","description":"Cards are distributed unevenly with the following system: Players take turns revealing cards from the deck. If it matches a card already on the table, both are taken by the player who revealed them. If there is no match, the new card is left on the table. &#10;When all cards have been distributed, players shuffle their decks. Then they take turn revealing a random card from their decks and place it in a pyramid layout. When revealing a card that already is present, these cards are stacked up. When revealing a card of the same color of an existing one, take both. When one player runs out of cards, the game ends, and players count the points on their cards. Highest score wins.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":0,"minAge":6,"categoriesAndMechanics":["Card Game","Farming","Matching"],"rating":0,"complexity":0},{"bggId":"371802","name":"Sweet Deals","description":"In this sweet dessert-themed card bidding game players manage their hand of cards, bid on others' cards, and try to get multiples of the same type of dessert, as well as a high value of coins. On your turn you offer a dessert for others to bid on. The first person to get 6 of a kind, or Sweet Six, ends the game, but may not win, because of the way scoring works.&#10;&#10;-description from designer&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":15,"maxPlayTime":45,"minAge":5,"categoriesAndMechanics":["Card Game","Auction/Bidding"],"rating":3.539475,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/LXJ4PscuTHgbADtXqWfYXg__thumb/img/jn6MQcWhHKYSjdOUQHIN2e1RpJo=/fit-in/200x150/filters:strip_icc()/pic7202379.jpg","urlImage":"https://cf.geekdo-images.com/LXJ4PscuTHgbADtXqWfYXg__original/img/xR8IT87sOf0lx1P-Jfk7dJmjoeA=/0x0/filters:format(jpeg)/pic7202379.jpg"},{"bggId":"371803","name":"Throne of Hastinapur","description":"Historians estimate that the Kurukshetra (koo-rook-shay-trah) war occurred during the Iron Age of India, around 10th century BCE. The conflict arose from a succession dispute over the Throne of Hastinapur (has-tee-nah-poor). Duryodhana was the eldest from the senior branch of the family line, the Kauravas. But he was younger than Yudhishthira, the eldest Pandava. Who would become the next ruler of the vast Kuru kingdom?&#10;&#10;The epic struggle over the Throne of Hastinapur has begun! Use your influence over the ancient heroes of India to sway them to join your side, enlist the help of other Rajas, and surprise your opponents by making your own preparations for war before they are ready to fight!&#10;&#10;In Throne of Hastinapur, players act as local supporters who are supplying resources and political leverage to either the Pandavas or Kauravas. To show support, you must place tokens on shared Hero Cards or your personal Pati (Pah-tee) in order to win Victory Points (VP), shown as Lotus flowers. Players will &ldquo;snake draft&rdquo; dice from a pool in order to place tokens that match. After the Endgame is triggered, players play a final round. To win, score the most Victory Points!&#10;&#10;-description from designer&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":20,"maxPlayTime":40,"minAge":12,"categoriesAndMechanics":["Ancient","Dice","Mythology","Negotiation","Political","Dice Rolling","Force Commitment","King of the Hill","Negotiation","Open Drafting","Race","Random Production","Take That","Turn Order: Pass Order","Variable Set-up"],"rating":0,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/nE3rfpOlFHz4PZpg2GYMsg__thumb/img/KncRo1TpNJU31SXItEjs52uwATM=/fit-in/200x150/filters:strip_icc()/pic7108152.jpg","urlImage":"https://cf.geekdo-images.com/nE3rfpOlFHz4PZpg2GYMsg__original/img/v9WN0mEGsWwX324DWpy5UQurZck=/0x0/filters:format(jpeg)/pic7108152.jpg"},{"bggId":"371805","name":"Quantum Party","description":"The board has 4 rows w/10 spaces each representing a player&rsquo;s lab bench. Each player places their cat standee at the start of their bench then conducts one of 4 classic modern physics experiments by drawing a card for the experiment and resolving it. Most cards move your cat and cats move a different way for each experiment. If you reach the end of a bench, take a party hat. First to get 4 hats wins.&#10;&#10;Blackbody Radiation Experiment. Includes die with faces 0/black, 2 red/1, 2 green/2, and 1 blue/3. Roll the dice to see what color photon comes out of the blackbody oven. The rarer the photon, the more your cat advances.&#10;&#10;Rutherford Gold Foil Experiment. Includes spinner w/4 spaces: red/1 (takes up half of circumference), 2 gold/2 spaces (each takes up 1/6 of the circumference), and blue/3 (takes up 1/6 of the circumference). Spin the spinner to see in what direction your alpha particle scattered. The rarer the outcome, the farther you can advance.&#10;&#10;Double-Slit experiment. Includes 2 dice each w/3 white (0/1/2) and 3 black (0/1/2) faces. Roll both to see if your electron ends up in a region of constructive or destructive interference. If faces are same color (constructive interference), add them. If different, subtract the smaller from the larger.&#10;&#10;Photoelectric Effect. Includes 3 dice w/faces: red/1000 Kelvin (move 1 space), green/3000K (move 2 spaces), and blue/200k (move 3 spaces). Roll the dice to see what color lamp your can has chosen. Some colors of light will eject electrons from the metal at higher velocity, meaning your cat can advance further.&#10;&#10;Each deck consists of 10 &ldquo;Run the Experiment&rdquo; cards (if you draw one, run the experiment as above) plus a number of special cards. If you draw the Wolfgang Pauli card, Pauli shows up to observe and breaks your experiment. &ldquo;Save this Card&rdquo; allows you to place a note on the door to direct auli to another room. &ldquo;Ummm???&rdquo; &ndash; someone measure the momentum of your cat so precisely that its position is uncertain. Roll 1 double-slit die and move forward if you roll white and backward if you roll black. &ldquo;Rawr!&rdquo; &ndash; you encounter a potential energy barrier and have a 50% chance to quantum tunnel through it (by rolling double-slit die as above). &ldquo;Yikes!&rdquo;: your cat ruins the experiment so you don&rsquo;t move. &ldquo;Hooray&rdquo;: your cat did something to help you &ndash; move again.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Educational","Roll / Spin and Move"],"rating":3.25,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/jOBpVP9s8iFEdyVr6WE-rg__thumb/img/Q_2mWPe0v2jTqR0KtU1zflJybIw=/fit-in/200x150/filters:strip_icc()/pic7100102.jpg","urlImage":"https://cf.geekdo-images.com/jOBpVP9s8iFEdyVr6WE-rg__original/img/b3guu6MdTQAqGVONnwk5ajxXgwY=/0x0/filters:format(jpeg)/pic7100102.jpg"},{"bggId":"371808","name":"Impact Beyond","description":"When an asteroid crashes into Earth, the very foundations of society are left in ruins. With no remaining institutions, chaos erupts as governments crumble. Some blame inaction or even conspiracy for not deflecting the asteroid. Others see the possibility of creating a new and better world. Eight mega-organizations emerge, vying for the chance to take charge of rebuilding our post-apocalyptic planet. Each has a plan that relies on emerging technology and prevailing public opinion. The plans are wildly different: from building a green utopia to merging with machines in a matrix to fleeing Earth entirely and colonizing a nearby planet. But there are only enough resources left for one of these plans to succeed. And each step of the way, other players will try to compete for the same resources or even oppose you directly.&#10;&#10;You are the chosen leader in a mega-organization. You must convince the public that not only are your ideas the best of those presented by the mega-organizations&mdash;but also that you are the one who can save the world and lead it safely into the future. Your task is to assemble teams focused on technologies to influence humanity's future. It is up to you whether to turn Earth into an authoritarian regime, liberate people from their oppressors, change what it means to be human, return to living in harmony with nature, let the free market reign, or control human behavior with a supercomputer.&#10;&#10;You begin the game by choosing a mega-organization card, two technology cards, and four agent cards. Each turn, you draw one card and get two points you can spend to draw cards, move agents, execute special abilities, or research new technologies. You can also trade cards for points to execute more complex turns. The table is split into three lanes: development, commercial, and monopoly, representing stages of bringing a technology to market. Each gives you prestige, public opinion, or effect bonuses you can use during or at the end of the game. You can move a card to the next stage when the assigned team's skills fulfill the card's requirements. When resolving conflicts with other teams working on the same technology, your agents' skills determine who strikes first and how much damage an agent can cause and withstand.&#10;&#10;The game ends when all technologies in the game are developed, or if you win the tug-of-war of public opinion and successfully initiate a revolution. In this case, tally the prestige from your developed technologies and add bonus prestige from your technologies that align with the prevailing public opinion. The player with the most prestige wins the game and the chance to make an IMPACT BEYOND.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":90,"minAge":13,"categoriesAndMechanics":["Card Game","Science Fiction","Action Points","Alliances","Closed Drafting","Deck Construction","Delayed Purchase","End Game Bonuses","Hand Management","Interrupts","Open Drafting","Pattern Building","Rock-Paper-Scissors","Tech Trees / Tech Tracks","Variable Player Powers","Worker Placement"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/_RM4Bf_5stJnRAp9GbIQnw__thumb/img/YJIO3QrwCN4F5JzMTm--649IQpc=/fit-in/200x150/filters:strip_icc()/pic7130110.jpg","urlImage":"https://cf.geekdo-images.com/_RM4Bf_5stJnRAp9GbIQnw__original/img/xSbPVMkrlgxluzIpRheJObbP0Fo=/0x0/filters:format(jpeg)/pic7130110.jpg"},{"bggId":"371817","name":"LOOP: The Elevated Card Game – Renovated Edition","description":"The hit transit card game LOOP now has a standalone expansion! The new LOOP: Renovated Edition contains all new event cards, plus some new wild cards and a full set of station cards. It can be played on its own, or combined with the original edition of LOOP to double the fast-paced, chaotic fun!&#10;&#10;Ride the rails of the elevated trains in Chicago&rsquo;s famous Loop! Match the line colors and stations to make your way around town, but beware the everyday perils of signal delays, broken escalators, and unexplainable smells as you get where you&rsquo;re going!&#10;&#10;Like the original, LOOP: Renovated Edition is a 10-20 minute game suitable for ages 9 and up. One deck can support a game of 2-7 players, but when combined with the original edition of LOOP you can play with up to 14 people!&#10;&#10;-description from publisher's website&#10;&#10;","minPlayers":2,"maxPlayers":7,"minPlayTime":10,"maxPlayTime":20,"minAge":9,"categoriesAndMechanics":["Transportation","Hand Management","Network and Route Building","Take That"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/F3f_ErMAqvQrKJWB6z6xqQ__thumb/img/KdfKKVUZAlNtakBz0aekV40CfZg=/fit-in/200x150/filters:strip_icc()/pic7670930.jpg","urlImage":"https://cf.geekdo-images.com/F3f_ErMAqvQrKJWB6z6xqQ__original/img/Z5HgOkxjBLc5OCLjEyK4vVsKhaw=/0x0/filters:format(jpeg)/pic7670930.jpg"},{"bggId":"371838","name":"BANANINE","description":"In Bananine, you will compete to collect banana cards with quantities ranging from 1 to 9.&#10;&#10;On your turn, take one stack of banana cards from the banana market and add them to your storeroom. Then choose banana cards from your hand with a total quantity equal to that of the cards you took and place them in the banana market.&#10;&#10;Before ending your turn, stack the cards in the banana market by quantity. If a stack&rsquo;s total quantity is 10 or more, discard that stack.&#10;&#10;At the end of the game, score each quantity of banana card separately. The player who has the most banana cards of a given quantity in their storeroom will score points for it.&#10;&#10;-description from designer&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":10,"maxPlayTime":10,"minAge":6,"categoriesAndMechanics":["Card Game","Hand Management"],"rating":3.20652,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/jitMPyvs69ckiCw9pLB25Q__thumb/img/EZM2F_OvG5T7hhaZLkUxxhkWISo=/fit-in/200x150/filters:strip_icc()/pic7102408.jpg","urlImage":"https://cf.geekdo-images.com/jitMPyvs69ckiCw9pLB25Q__original/img/dkJJtKFUqJRVpynKr0_e6qFkSH0=/0x0/filters:format(jpeg)/pic7102408.jpg"},{"bggId":"371839","name":"Tierrennen","description":"Ein lustiges W&uuml;rfelspiel f&uuml;r und mit dem Nachwuchs.&#10;Wer erw&uuml;rfelt sich zuerst seinen Seehund und baut ihn zusammen? Simples Kinderspiel f&uuml;r zwischendurch.&#10;&#10;Reihum wird gew&uuml;rfelt, jeder K&ouml;rperteil des Seel&ouml;wen hat eine Zahl (1-6). Die W&uuml;rfelziffer bestimmt, welcher Teil des Seel&ouml;wen zusammengesteckt wird, wobei eine bestimmte Reihenfolge zu beachten ist. Schritt f&uuml;r Schritt wird der Seel&ouml;we fertiggestellt. Wer zuerst alle Teile zusammengesetzt hat, gewinnt das Spiel.&#10;&#10;English:&#10;&#10;A fun dice game for and with the offspring.&#10;Who gets his seal first and builds it together? Simple children's game for in between.&#10;&#10;The dice are rolled in turn, each part of the sea lion's body has a number (1-6). The number of the dice determines which part of the sea lion is put together, following a certain order. Step by step the sea lion is completed. The first to assemble all the parts wins the game.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":3,"maxPlayTime":10,"minAge":4,"categoriesAndMechanics":["Dice"],"rating":4,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/Qn7cnCWC3iX7twoa_Sz_tQ__thumb/img/gWYWy2aou4RViDjliWMFguo71Io=/fit-in/200x150/filters:strip_icc()/pic7102035.jpg","urlImage":"https://cf.geekdo-images.com/Qn7cnCWC3iX7twoa_Sz_tQ__original/img/pxKZPFI-CtNRU5wZaiV2QqdypgA=/0x0/filters:format(jpeg)/pic7102035.jpg"},{"bggId":"371840","name":"Únikovka: Útěk na západ","description":"Escape to the West is an original Czech escape game, which follows the story of Pavel from the 70th year of the last century. Help Paul escape from severe totalitarianism through the Iron Curtain. The story will be accompanied by cards with puzzles, from which you will compile a map that will help you come up with the best way to get to West Germany. Will you be able to escape across a closely watched border?&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":120,"maxPlayTime":120,"minAge":10,"categoriesAndMechanics":["Card Game","Puzzle","Cooperative Game","Solo / Solitaire Game"],"rating":3.625,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/BslH35114i2MsD2swTdEYA__thumb/img/BBjkoa3HW2gjQjlhkziB5-aUxMU=/fit-in/200x150/filters:strip_icc()/pic7101505.jpg","urlImage":"https://cf.geekdo-images.com/BslH35114i2MsD2swTdEYA__original/img/IvkXQw0u9PcT2p1nLcLmmyitAkA=/0x0/filters:format(jpeg)/pic7101505.jpg"},{"bggId":"371841","name":"Anahata: El juego de la vida natural","description":"A nature-themed board game with mechanics similar to Game of Goose, with additional features such as nature-related trivia questions, or request to perform theatric actions.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":30,"maxPlayTime":180,"minAge":3,"categoriesAndMechanics":["Dice","Environmental","Trivia","Dice Rolling","Events","Lose a Turn","Questions and Answers","Role Playing","Roll / Spin and Move"],"rating":0,"complexity":0},{"bggId":"371844","name":"Rainbow Journeys","description":"This game uses the Rainbow Deck to provide a path placement storytelling experience, with critical decisions being taken narratively and relying on the player's discretion with just a few fixed mechanics.&#10;&#10;During gameplay, the player will create a path from a starting card to an ending card. Every new path carries with it a situation where the player must intervene in some way, by either spelling words with the cards in their hand or otherwise using the pictures in the center of the cards for a narratively acceptable conclusion; the details and outcome are decided entirely at the player's discretion.&#10;&#10;A reimplementation of Quest for the MacGlyphin, which originally used the Glyph deck. A companion piece to Travels in the Land of Glyph, and an attempt to use similar storytelling mechanics in a more game-y fashion, goal-oriented.&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":0,"maxPlayTime":0,"minAge":8,"categoriesAndMechanics":["Adventure","Card Game","Print & Play","Hand Management","Solo / Solitaire Game","Storytelling"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/j6RkKi59iJohT5QWTkDxKQ__thumb/img/dPZDGwXeaNuBt7mVLBOinqiDGeI=/fit-in/200x150/filters:strip_icc()/pic7101371.png","urlImage":"https://cf.geekdo-images.com/j6RkKi59iJohT5QWTkDxKQ__original/img/xmkAttYjizT1dAQMOEZptaEw5bE=/0x0/filters:format(png)/pic7101371.png"},{"bggId":"371846","name":"The Devil's Dozen","description":"In the year 1587 an act was passed for &quot;the quieting and keeping in obedience of the disordeit and subjectis inhabitants of the Borders, Highlands, and Isles.&quot;&#10;&#10;Along with this, a list of Clans, 13 Clans. 13 of the most notorious of the Border Reivers. In the game, you will play as one of these Clans. Collect Livestock, Crops, Followers, and Soldiers and use them to build your Clan's influence. With them, you will purchase &quot;Holdings,&quot; land, Armies, and Strongholds, gaining you victory points. Gain the most victory points and become the most prominant Clan on the border.&#10;&#10;As a Clan Chief, you will perform 1 of 2 actions on your turn: Gather Tokens or purchase Holdings. When purchasing Holdings you will also gain sheep for your pasture but beware, a Reiver is at first a theif. You or your neighboring Clans may conduct raids, stealing sheep from one another. Sheep are a valued resource and are worth victory points; a large flock could tilt the victory in your favor. Lastly: Each individual Clan has a unique ability drawn from the annals of history. The Devil's Dozen brings the history, hardships, fueds, and forays of the 16th Century Border life to the game table...&#10;&#10;-description from publisher&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":30,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Card Game","Medieval","Card Play Conflict Resolution","End Game Bonuses"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/FWHEVwzaVHtDE8v09qkz3w__thumb/img/BJMvAcu3BGP1IPkI0hV3N6hesgk=/fit-in/200x150/filters:strip_icc()/pic7102159.jpg","urlImage":"https://cf.geekdo-images.com/FWHEVwzaVHtDE8v09qkz3w__original/img/qZ0uR-IuInQqGzZPIKt3teKftMw=/0x0/filters:format(jpeg)/pic7102159.jpg"},{"bggId":"371847","name":"MAD Motion Attack Defense","description":"MAD Motion Attack Defense is a two-player game.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":9,"categoriesAndMechanics":[],"rating":3.25,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/5PM--wPyixQRaU-WQKw7bg__thumb/img/gvox9mq-B2QxfkRTQnYXMsCEUKU=/fit-in/200x150/filters:strip_icc()/pic7101395.jpg","urlImage":"https://cf.geekdo-images.com/5PM--wPyixQRaU-WQKw7bg__original/img/BCzZFkQ6QGtkC4tJvlbkEGp5OX8=/0x0/filters:format(jpeg)/pic7101395.jpg"},{"bggId":"371850","name":"WatchMojo: A Super Fan Top 10 Party Game","description":"In WatchMojo: A Super Fan Top 10 Party Game, you submit entries to Top 10 Lists about pop culture subjects to be judged and ranked by the game round's ranker.&#10;&#10;","minPlayers":3,"maxPlayers":10,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Movies / TV / Radio theme"],"rating":3.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/1tlrr0Hu9hZMukq6x3PYdg__thumb/img/neu-N7dp4B1pWc6JLytMnbtUJWQ=/fit-in/200x150/filters:strip_icc()/pic7101425.png","urlImage":"https://cf.geekdo-images.com/1tlrr0Hu9hZMukq6x3PYdg__original/img/cSYO_tH54Ek0vcIaujfWuLpN_Do=/0x0/filters:format(png)/pic7101425.png"},{"bggId":"371851","name":"Moustache Gracias","description":"Welcome to the Loteria Mexicano: a real tradition in Mexico! Choose your character and bet on the number of tricks you plan to win. Try to aim right because if you lose, you remove as many clothes as the gap between your bet and the folds won! Bluff and audacity are your key words. The first one who ends up naked... lost!&#10;&#10;-description from publisher's website&#10;&#10;The game lasts for 6 rounds. In each round, players bid for the number of tricks they can win.  The sum of bidding cannot equal to the number of cards dealt that round.  The first round has 5 cards, then 4, 3, 2, 1, 1.  In a trick, players must play a card higher than the previous one or fold.  At the end of a round, if players cannot match their bid, they have to close cloth cards (7 at the start of game).  At the end, the player with most clothes wins the game.&#10;&#10;-user summary&#10;&#10;","minPlayers":3,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":20,"minAge":10,"categoriesAndMechanics":["Card Game","Humor","Auction/Bidding","Trick-taking"],"rating":3.0375,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/AwQhQYH2qgVYCMRHkC-OcQ__thumb/img/UY3KLaJXMvLYGRpoAMehq0-NG60=/fit-in/200x150/filters:strip_icc()/pic7104775.jpg","urlImage":"https://cf.geekdo-images.com/AwQhQYH2qgVYCMRHkC-OcQ__original/img/8JN4Qkl3sZzgBFZmxyUO-JtkCmM=/0x0/filters:format(jpeg)/pic7104775.jpg"},{"bggId":"371852","name":"Love Is Dead","description":"These days, dating can be downright scary. Seriously, who wants to get ghosted?&#10;&#10;In the light strategy party card game Love Is Dead, players compete to match with Boos in the dating pool by playing trait cards that correspond to the Boo's traits. Will you match with AJ who's only looking for a date to their cousin's funeral? Or Niah, who'll ghost you just for being an Aries? Opponents can play negative cards, like deal-breakers, to sabotage one another.&#10;&#10;Once a player matches with three Boos, the game ends, and whoever scores the most points from their matches wins!&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":0,"maxPlayTime":0,"minAge":13,"categoriesAndMechanics":["Card Game"],"rating":3.214285,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/rvk_uAZ1ZRGPTaElcoulsQ__thumb/img/XoeSelUxtpdFwI9_kEPm5AHwwPM=/fit-in/200x150/filters:strip_icc()/pic7101470.png","urlImage":"https://cf.geekdo-images.com/rvk_uAZ1ZRGPTaElcoulsQ__original/img/UrYAdLzGxX6wGKOFNF-kQuIdpf0=/0x0/filters:format(png)/pic7101470.png"},{"bggId":"371853","name":"Hippity Hop to the Carrot Shop","description":"This is a roll-and-move race game for children in which players are bunnies trying to beat each other to the carrot shop.&#10;&#10;As players move around the board, they may land on carrot spaces, which allow them to collect carrot cards. Other spaces force them to give the carrots back.&#10;&#10;At the end of the game, there is an automatic point bonus for the players in first, second, and third place. To these scores are added the number of carrot cards each player has, and the player with the highest score - not the first to reach the shop - wins the game.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":4,"categoriesAndMechanics":["Children's Game","End Game Bonuses","Race"],"rating":0,"complexity":0},{"bggId":"371854","name":"The Tree Trimming Game","description":"Get together with your friends and family around the Tree Trimming Game board. Help place ornament tiles on the tree to create a balanced design. Laugh and sing with Holiday Spirit cards! Everyone will be answering fun questions about the holidays or singing seasonal songs!&#10;&#10;The Tree Trimming Game is a cooperative puzzle game for family and friends for 2 to 24 players. Take turns placing ornament tiles on the tree so that the same tiles are never next to each other! When an ornament tile is placed in a starred space the player draws a Holiday Spirit card. These cards have questions, song prompts, and other fun seasonal surprises!&#10;&#10;The players win when they fill every spot on the tree with ornaments. The player with the fewest tiles puts the star on the tree! Happy Holidays!&#10;&#10;","minPlayers":2,"maxPlayers":24,"minPlayTime":45,"maxPlayTime":60,"minAge":7,"categoriesAndMechanics":["Abstract Strategy","Party Game","Cooperative Game","Questions and Answers","Singing","Tile Placement"],"rating":2.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/MQ67ZXS9TTsKQ_magPYk_A__thumb/img/kmHGXOHnPwsm-4yNd-QnO7NPTM8=/fit-in/200x150/filters:strip_icc()/pic7102147.png","urlImage":"https://cf.geekdo-images.com/MQ67ZXS9TTsKQ_magPYk_A__original/img/UIuxt315qr5iAnFqY_xxa3vd-_8=/0x0/filters:format(png)/pic7102147.png"},{"bggId":"371857","name":"History of the Ancient Seas","description":"A special Kickstarter Master of the Seas version only be available during the Kickstarter Campaign.&#10;&#10;All three games of the Series in one huge box.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":120,"maxPlayTime":360,"minAge":14,"categoriesAndMechanics":["Civilization","Action Points"],"rating":4,"complexity":0},{"bggId":"371860","name":"Flippo","description":"This is an action/dexterity game for kids, probably first sold in the 1930s. Players place colored marbles in a tiny cup at the end of a flexible metal strip and flip them on to the board, where they land in holes labeled 6, 12, 18, 24, 30, 36, 60, or 90 (higher numbers being harder to achieve).&#10;&#10;Highest score wins.&#10;&#10;","minPlayers":0,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Action / Dexterity","Children's Game"],"rating":0,"complexity":0},{"bggId":"371862","name":"Chick in the Coop","description":"This is advertised as a &quot;kindergarten game.&quot; Players each take one of four coops and colored sticks of the same color. There is also a pile of chick cards.&#10;&#10;If the spinner lands on a chick icon, the player places a chick in their own coop. If it lands on a color, whomever has the matching sticks use one to start or continue building a fence around their coop. Once a single coop is fenced in, all players count their chicks and the one with the most wins.&#10;&#10;Released early 1940s.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Animals","Children's Game"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/11UwwGJ_yF7NeQ4rfVcLUA__thumb/img/CqCpU2DkdxQfa_pgB-9AAuNYzJc=/fit-in/200x150/filters:strip_icc()/pic7153668.jpg","urlImage":"https://cf.geekdo-images.com/11UwwGJ_yF7NeQ4rfVcLUA__original/img/Rp6SMzOmkLY9an3O6FW5UwZCDVA=/0x0/filters:format(jpeg)/pic7153668.jpg"},{"bggId":"371863","name":"Space Race: Rally for Resources","description":"A space conglomerate-corporation is building a new Dyson Sphere in an uncharted galaxy. They're looking for a &quot;go-to&quot; crew of mercenaries and pioneers, so they've issued a galaxy-wide challenge... Bring them what they need in a timely manner and you'll be rewarded with a full-time contract(handsome salaries and benefits included).&#10;&#10;Build a crew, mod your ship, and race against the other competing crews, to mine resources and battle your way to victory! This is an uncharted galaxy, so anything goes.&#10;&#10;The game board is customizable and modular, so gameplay is different every time you play. Before you start the game, players will take turns placing game pieces for the session. You can play however you'd like!&#10;&#10;A single mission card, showing which resources and how much of each are required, is drawn for the game session (all players will be racing to complete this). The first player to gather the requested resources and travels back to the space station wins the game. All players (given three random crew members) start at the space station at the beginning of the game, and roll dice to determine how far they can navigate that turn(crew skills can increase this roll).&#10;&#10;Once a player has reached a planet or asteroid(each have their own unique resources) they can mine. You can mine a planet once per turn, for a max of two turns. Mining does not end your turn however, so its best to start it by mining every time.&#10;&#10;You can also battle other players to steal their resources, eliminate crew members, or destroy any tech mods they may have. This requires you to be on the same spot as the opposing player however. Another way to use your turn is to spend any unneeded resources to upgrade your ship with tech mods or new crew members (max of 4).&#10;&#10;Once a player has acquired the necessary resources to complete the mission card, they must navigate back to where they started the game. Once they have arrived, they win the game. Watch out for other players trying to steal your loot though!&#10;&#10;-description from designer&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":45,"minAge":12,"categoriesAndMechanics":["Racing","Science Fiction","Space Exploration","Area Movement","Dice Rolling","Modular Board","Pick-up and Deliver","Race","Worker Placement, Different Worker Types"],"rating":4.333335,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/bHBwqNd_GYEzA7vGjO2w_w__thumb/img/i6R33suiuD2gezuIZSK1Jga8QvU=/fit-in/200x150/filters:strip_icc()/pic7140644.jpg","urlImage":"https://cf.geekdo-images.com/bHBwqNd_GYEzA7vGjO2w_w__original/img/W65lU8J4vus2lWEItsOMUifmls8=/0x0/filters:format(jpeg)/pic7140644.jpg"},{"bggId":"371865","name":"Dubble Up","description":"In this game, chits with different symbols on them - wheels, anchors, bells, crowns, and stars - are distributed amongst the players, who keep their pile face down. On each turn, a player tries to match a symbol with the preceding one to create a pair or chain for ever-increasing bonuses.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Children's Game","Matching"],"rating":3.75,"complexity":0},{"bggId":"371875","name":"Welcome Words","description":"Welcome Words is a coop-picture-word-association cardgame for 2-5 players.&#10;&#10;Each round one player has to guess a term (an adjective) that was chosen randomly out of 5 terms from a laying out word card. All other players try to help them by playing a picture card that fits the chosen term best. After that they play a second picture card that fits the opposite of the chosen term best. Then the guessing player has to make their guess.&#10;&#10;The game ends when each player was the guessing player twice. The goal for the group is to describe and guess as many terms correctly as possible.&#10;&#10;-description from designer&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":30,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Card Game","Deduction","Humor","Party Game","Word Game","Communication Limits","Cooperative Game","Deduction","Induction"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/77cKINz0y2yBPbUNJPf53Q__thumb/img/U3e6iww7G4cNP91HcKe47r5r8Yc=/fit-in/200x150/filters:strip_icc()/pic7316635.jpg","urlImage":"https://cf.geekdo-images.com/77cKINz0y2yBPbUNJPf53Q__original/img/CllMM_ieMaQWAPmRhu83UDIWDHU=/0x0/filters:format(jpeg)/pic7316635.jpg"},{"bggId":"371876","name":"Bende op de boerderij","description":"The farm is in chaos! The animals have wandered everywhere.&#10;Now it&rsquo;s up to you to bring them all back to their own paddocks.&#10;&#10;You can play this game in two ways:&#10;COOPERATIVE &ndash; make sure the animals get back to their own paddocks. But watch out! All animals must be back before dark or everyone loses!&#10;&#10;COMPETITIVE &ndash; cross your fellow player(s) by blocking the paddock. Will you be the first to drive your livestock into their own paddocks?&#10;&#10;-description from publisher&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":15,"minAge":3,"categoriesAndMechanics":["Animals","Children's Game","Farming","Action Timer","Cooperative Game","Map Deformation"],"rating":2.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/FXhb9tYMGnQ2ksuau4ElDQ__thumb/img/ajLGW2tHKbNG_EWxoTO0u8IP3Z0=/fit-in/200x150/filters:strip_icc()/pic7124027.png","urlImage":"https://cf.geekdo-images.com/FXhb9tYMGnQ2ksuau4ElDQ__original/img/2ov9LDSta4qwE3U2g362Z5vey2A=/0x0/filters:format(png)/pic7124027.png"},{"bggId":"371877","name":"Jungle Party","description":"There&rsquo;s a party in the jungle!&#10;&#10;Swing along with the monkey and see who&rsquo;s come to visit the jungle. Throw a party with the lion, rhino, zebra and many other animals. But wait, not all animals are complete!&#10;&#10;Collect the correct animal game pieces by walking around with the monkey. If you play smart, the monkey can run and swing faster, or slower. What&rsquo;s the best move? Complete the animals and celebrate your own jungle party. Are you the first to do so? Then you&rsquo;ve won this adventurous game!&#10;&#10;During a turn players choose one of the three actions: draw card, play a card or take 3 steps. Taking 3 steps is your main action and causes the monkey to stop on a certain animal. Take that animal and add it to your collection. By drawing a card or playing a card you already drew, you can move specific steps. Try to collect as many animal-parts and create animals until your animal party is complete.&#10;&#10;-description from publisher&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":20,"minAge":4,"categoriesAndMechanics":["Animals","Children's Game","Humor","Party Game","Puzzle","Matching","Movement Template","Tile Placement"],"rating":3.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/_QW0ubhC45BvLAmH6SrMYg__thumb/img/QJDnDhzOQi-ejREK5LzAu6nRjfg=/fit-in/200x150/filters:strip_icc()/pic7122194.png","urlImage":"https://cf.geekdo-images.com/_QW0ubhC45BvLAmH6SrMYg__original/img/wEx_EmCEBa3IcZVX5wix3FXG2rA=/0x0/filters:format(png)/pic7122194.png"},{"bggId":"371889","name":"Sirvam a Rainha","description":"Now it's time to enter a magical world of fabulous and terrifying desserts!&#10;You are the cooks hired for a great feast in honor of the hungry Queens with somewhat peculiar tastes. Everything is valid to win the favors of the Queens and stand out in the competition! And as for the others&hellip; We can't guarantee they'll manage to keep their heads...&#10;&#10;Sirvam a Rainha is the newest trick-taking game in the Sirvam collection!&#10;Each player starts the game with six recipe cards and each round they must vote on which Queen's order to serve, establishing the trick rules of this round. Cards are sweets of different types, qualities and flavors. After the cards are selected, it's time to serve the feast. SERVE THE QUEEN!&#10;&#10;The game comes with 5 different queens, each with their own tastes and scoring method. Whether it's the Twin Queens who disagree with their preferred type or the Mathematical Queen that wants the cards in numerical sequence, it's up to players to adapt at the demands and offer the best dishes at the feast.&#10;&#10;-description from publisher&#10;&#10;","minPlayers":3,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Card Game","Fantasy","Medieval","Party Game","Hand Management","Trick-taking","Voting"],"rating":3.815,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/E3pqe0mtPjzEBW83p6NoAA__thumb/img/H9NhzXvCAxRwxRGDcFsqRIRUQ_U=/fit-in/200x150/filters:strip_icc()/pic7141097.jpg","urlImage":"https://cf.geekdo-images.com/E3pqe0mtPjzEBW83p6NoAA__original/img/GVhg1RsarKn2FK2MSa-UzonF-Po=/0x0/filters:format(jpeg)/pic7141097.jpg"},{"bggId":"371901","name":"PINGU Südpol-Rennen","description":"&quot;Hui, schlitter, plautz! Here am I, the Penguin Pingu from south pole. I have invited all my friends. We will make a race, do you want to join us? Then go for it! That will be fun. And for not beeing hungry, we will take a huge amount of fish with us. The fastest player which reaches the goal wins!&quot;&#10;&#10;The penguins are on the way. They are jumping from floe to floe. But be careful, there are floes which are not stable anymore. In some cases also the water is a good idea, but only if there is no Orca in the way.&#10;&#10;The penguin family which reaches first the south pole wins the game!&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":6,"categoriesAndMechanics":["Racing"],"rating":1.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/jbS1QxOXk7iOagXyooHhBw__thumb/img/A8bphJWy5Z5FFVTjOAuawJ80qjU=/fit-in/200x150/filters:strip_icc()/pic7128840.jpg","urlImage":"https://cf.geekdo-images.com/jbS1QxOXk7iOagXyooHhBw__original/img/8VYbJ70DgX6bLXHkf-1w1_-IjTw=/0x0/filters:format(jpeg)/pic7128840.jpg"},{"bggId":"371902","name":"Escape Room: In der Hand des Entführers","description":"The original Escape Crime Game in the practical card box&#10;&#10;The daughter of a very rich industrialist was kidnapped - ransom demand: one and a half million euros! The criminal police put YOU on it, their special officer for tricky cases. You set about investigating, but are knocked out from behind at the point where the ransom is handed over. When you wake up, you find yourself chained in the basement of an abandoned office building with no food or the slightest clue as to what is in store for you. Can you break free, track down the missing girl and escape the kidnappers' hideout alive?&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":[],"rating":3.285715,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/0G_r99I2HiOulDxS5FfEHA__thumb/img/6asMofxbAV8bPCLVub9_DIvee4Y=/fit-in/200x150/filters:strip_icc()/pic7123980.jpg","urlImage":"https://cf.geekdo-images.com/0G_r99I2HiOulDxS5FfEHA__original/img/lDgGAbxP_Z1SCv7s-a1CVFn7f4M=/0x0/filters:format(jpeg)/pic7123980.jpg"},{"bggId":"371906","name":"Dragon Bleed","description":"Vampire Knights fight against Human Sorcerers for supremacy. And the currency within the game? Dragon Blood! Extract just a few drops and unleash powers and purchases from the Dark Armory. Line up your warrior, weapon and dragon, then attack. This game is for 2-4 players and takes about 10 minutes to learn. The goal is to remove 500 blood points from all opponents before they do the same to you!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":40,"minAge":14,"categoriesAndMechanics":["Fantasy","Action/Event","Deck Construction"],"rating":3.75,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/Gp6TYwIqOCxjnFCxO3wlpg__thumb/img/VYoyX241yGtW8NoHHGmFQiUGyMk=/fit-in/200x150/filters:strip_icc()/pic7103787.jpg","urlImage":"https://cf.geekdo-images.com/Gp6TYwIqOCxjnFCxO3wlpg__original/img/7EMfVjPbYrnP7RuIy-m8JAdNIq8=/0x0/filters:format(jpeg)/pic7103787.jpg"},{"bggId":"371916","name":"Star Wars: Stay on Target","description":"The Death Star exhaust port is only two metres wide but the Rebel Fleet must make a direct hit in order to destroy the Death Star! As leader of your fleet, organize your crews, and make your attack runs.&#10;&#10;The aim of the game is to successfully complete Attack Runs to earn Target Points. Each player has a defense value they use to deflect Imperial attacks on their path to the Exhaust Port. They can even call on Obi-Wan Kenobi for help. Players who have earned four or more Target Points from previous Attack Runs can finally take aim and try to destroy the Death Star. The first player to do this is the winner!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":25,"maxPlayTime":25,"minAge":8,"categoriesAndMechanics":["Movies / TV / Radio theme","Science Fiction","Hand Management"],"rating":2.15,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/GlZYlQ1VVEcq0JFqS1GxRA__thumb/img/T_teu7XDbx93s5MWPy1ebJG5mdU=/fit-in/200x150/filters:strip_icc()/pic7673625.jpg","urlImage":"https://cf.geekdo-images.com/GlZYlQ1VVEcq0JFqS1GxRA__original/img/mMLFiFk8uXofNJa3oMSG3K0vytI=/0x0/filters:format(jpeg)/pic7673625.jpg"},{"bggId":"371921","name":"Twin Stars: Moonset – Scenario #1: Destroy the Artifact","description":"A new episodic game that reimplements Twin Stars.&#10;&#10;Each episode includes a Scenary postcard and 2 cards.&#10;&#10;A few big updates from Twin Stars. A lot mostly in the visual side. It uses cubes, and it uses them on the card instead of using the edges of the card for tracking. Characters have skills, store items and other things on their cards. You can also gain Hide or Hunt. With Hide, you can re-roll an alert die (which is an extra die, not a die on an alert symbol), and Hunt allows you to try for an extra star.&#10;&#10;&#10;Scenario: Destroy the Artifact&#10;&#10;The venomous Snake Warriors have destroyed Wynx Keep in their quest to tplle anything in sight. At this point only treacherous rubble remains. Your old mentor named Redeshia reaches out and begs your party to rush to recover the evil artifact that resides there. She warns that if it gets into the hand of the Snake Warriors, the war will never end.&#10;&#10;You need to find the artifact in the rubble and destroy it before the war advances to the point of no return.&#10;&#10;Characters:&#10;&#10;&#10;     Korma Ranogh&#10;     Saria Balgalor&#10;&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":15,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Card Game","Dice","Science Fiction","Dice Rolling","Push Your Luck","Set Collection","Solo / Solitaire Game","Variable Player Powers"],"rating":3,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/YKhzLbiLTY2vs6pe0PNpDQ__thumb/img/ElEqVwtES3H_rIzZn3qDtTSHJlw=/fit-in/200x150/filters:strip_icc()/pic7107029.png","urlImage":"https://cf.geekdo-images.com/YKhzLbiLTY2vs6pe0PNpDQ__original/img/bEDW112KKLjp-KqBhiyC-eBodU0=/0x0/filters:format(png)/pic7107029.png"},{"bggId":"371923","name":"Mexica Museum","description":"In this game, 1 to 4 players take on the role of human characters, who must survive a night trapped inside the Museum, working together, engaging in combat, solving riddles, and collecting various items such as weapons, keys, or ancient artifacts from the exhibition, to fulfill different missions that will allow them to escape alive, before their time runs out.&#10;&#10;A single player will take on the role of the ghost priest. His sole purpose is eliminate all humans who wander around the museum, so that they serve as ritual sacrifice to the ancient gods. To do this, he will have the help of subortinated entities and various EVENTS that will occur every in-game &ldquo;hour&rdquo;.&#10;&#10;HOW TO PLAY (overview):&#10;&#10;Each round, HUMAN characters play following their specific character order. HUMAN players get two actions each turn, which can use to a) move, b) use Healing or defensive ITEMS (on themselves or on another player, adjacent to them) or c) share ITEMS with another adjacent player. Players can also skip one or both of their actions, and throw away unwanted ITEMS to clear storage space (each player can carry up to 4 ITEMS)&#10;&#10;Last is the GHOST PRIEST's turn: each turn, this character plays one card from his/ her GHOST DECK: these cards show different Chess movements, that the GHOST can perform during his/ her turn.&#10;&#10;After the GHOST&rsquo;s turn, the game&rsquo;s clock is moved 10 &ldquo;minutes&rdquo; and a new round begins.&#10;&#10;When an in-game &ldquo;hour&rdquo; is completed, the GHOST resets his/ her deck, and takes an EVENT card: its instructions are followed by all players.&#10;&#10;If a HUMAN looses all HP, get&rsquo;s WOUNDED: its unable to move, use ITEMS and has to let go of all ITEMS. If another player doesn&rsquo;t heal the WOUNDED player during 3 turns, the wounded character DIES, and transforms into another GHOST, hunting down his/ her former allies onwards.&#10;&#10;Each game is set around a different story or &ldquo;game mode&rdquo;, that sets different player counts and goals. There are currently 3 different modes:&#10;&ldquo;THIEVES IN THE SHADOWS&rdquo; is a quik heist mission, with one side acting as thieves, and another defending the museum&rsquo;s artifacts (no EVENTS).&#10;&ldquo;NIGHT OF THE RITUAL&rdquo; is a 4-5 player story, involving secret objectives for each player.&#10;THE SKULL SHRINE&rdquo; is a story campaign for 2-3 players.&#10;&#10;All campaigns have a time limit. If time runs out and players can&rsquo;t achieve their specific goals, HUMANS automatically lose.&#10;&#10;-description from designer&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":30,"maxPlayTime":90,"minAge":13,"categoriesAndMechanics":["Adventure","Horror","Mythology","Campaign / Battle Card Driven","Dice Rolling","Events","Grid Movement","Semi-Cooperative Game","Storytelling"],"rating":4.375,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/HuoCB7yScg4Xb-LNMTqYlA__thumb/img/qQheOppaJxIzQ1XH97OoyXsAarY=/fit-in/200x150/filters:strip_icc()/pic7115734.png","urlImage":"https://cf.geekdo-images.com/HuoCB7yScg4Xb-LNMTqYlA__original/img/r6ihFyS7gn088HEIP5WbeFwvac8=/0x0/filters:format(png)/pic7115734.png"},{"bggId":"371925","name":"Passaggio di Marpo","description":"A two player tile/card placement game where the players aim to connect other islands to their island, and will earn more points the further away the other islands are.&#10;&#10;On their turn, a player places a card. The game is played on a 5x5 grid with the deck placed in the center.  All card plays must be played adjacent to either the deck or a previously placed card. In addition to island cards, the deck includes special cards which can affect previously placed cards.&#10;&#10;Play continues until the board is full and the player with the most points win.&#10;&#10;The game came in a ziplock bag which included a plastic case for the game's cards, an unassembled paper box to store the game in, and a playmat to play on.  This solution was used as while the publisher's intention was to fit the components in the paper box, the playmat required too many folds to reach a size which would fit in the box and would then not lay flat enough to play; they note that the playmat is ultimately not required and the cards can be stored in the paper box.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":10,"maxPlayTime":15,"minAge":6,"categoriesAndMechanics":["Exploration","Nautical","Tile Placement"],"rating":0,"complexity":0},{"bggId":"371926","name":"El Oso","description":"EL Oso is a one-player board game. You need 24 checkers (12 in each of two colors), five 6-sided dice, and a simple 5x5 game board.&#10;&#10;The challenge of El Oso is to move your stacks of pieces across the board, without encountering the pieces of your opponent (&ldquo;The Bear&rdquo;). Your moves are completely under your control, but the Bear&rsquo;s moves are random. Plan carefully and don&rsquo;t expose yourself to too much risk, and you&rsquo;ll get your team across the board.&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Abstract Strategy","Dice","Solo / Solitaire Game"],"rating":3.333335,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/DWnN-60RipIiJm5-2GGpgg__thumb/img/qTxGP7BW-4Ez7RMcOw0fiiRYFGM=/fit-in/200x150/filters:strip_icc()/pic7140931.jpg","urlImage":"https://cf.geekdo-images.com/DWnN-60RipIiJm5-2GGpgg__original/img/O737F3YNHERuEvxnNxyfqyzcxbk=/0x0/filters:format(jpeg)/pic7140931.jpg"},{"bggId":"371927","name":"Flying Saucers","description":"Flying Saucers is a strategy game in which 2-4 players have spaceships of different power and speed. Your task is to neutralize either all enemy ships or the enemy &quot;generator&quot; (which supplies all ships with energy). The battle is fought with the formation of energetic majorities; thus: a 2-FS neutralizes an enemy 1-FS, two 2-FS neutralize an enemy 3, etc. Neutralized FS remain as (impassable) space trash, but can be reactivated. Another scenario is collecting ore.&#10;&#10;Flying Saucers has an expansion. This contains more scenarios such as the production of panels and the expansion of base stations, the abduction of the robot pilots and some exciting new spaceships.&#10;&#10;&mdash;description from the publisher (translated)&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":150,"minAge":10,"categoriesAndMechanics":["Aviation / Flight","Fighting","Science Fiction","Dice Rolling","Grid Movement"],"rating":4,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/Et1lcS0TbF1hCMEcK-xYqA__thumb/img/RGGHyTQDDpcJSFQiFdaULrfMAng=/fit-in/200x150/filters:strip_icc()/pic7711372.jpg","urlImage":"https://cf.geekdo-images.com/Et1lcS0TbF1hCMEcK-xYqA__original/img/gXZ5ASX6TbaMdLV09Lvk1_2E5t0=/0x0/filters:format(jpeg)/pic7711372.jpg"},{"bggId":"371928","name":"White Rabbit Dice Solitaire","description":"This version of dice solitaire gets its name from the game&rsquo;s white die constantly &ldquo;hopping&rdquo; back and forth between your hand and row. Additionally, the player must &ldquo;hold&rdquo; the white die in their hand as part of the win condition.&#10;&#10;You have six turns to win the game by making trades between dice in your hand and dice in the row so that all dice in the row are the same value and the white die ends in your hand.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":5,"maxPlayTime":10,"minAge":7,"categoriesAndMechanics":["Dice","Dice Rolling","Solo / Solitaire Game"],"rating":3.5,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/Lg-XnVbmmRw27uKNDWee5Q__thumb/img/Q6kJAE4kLYRYyXZDR6-xy1eVITs=/fit-in/200x150/filters:strip_icc()/pic7129215.png","urlImage":"https://cf.geekdo-images.com/Lg-XnVbmmRw27uKNDWee5Q__original/img/Ey1E7l0MlQQVgoynOB9e1vLqC18=/0x0/filters:format(png)/pic7129215.png"},{"bggId":"371929","name":"Just the Tip, dice game","description":"Tipping dice challenges for 2 to 6 players. Tip just 6 sided dice, How many dice can you tip onto a small card before one falls off, Tipping dice and adding the numbers to get closest to 50 and many other challenges. A dexterity game of tipping dice from a coffee cup. Get a point for each challenge you win and get 6 points to win!&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":40,"minAge":8,"categoriesAndMechanics":["Dice","Push Your Luck"],"rating":3,"complexity":0},{"bggId":"371930","name":"Take the Path the Number Dares","description":"A roll and write castle investigation game of building your corridors then traveling through them to find treasure and get out out. Start your turn by arranging your cards to make some new paths, roll the dice in dice, add the 2 numbers in the dice together and add the numbers on top of the dice together. Use 1 number to move and use the other to write where you stop.&#10;Group numbers so you can skip tiles. Once all the treasure and keys have been found the game is over. The player with the highest score wins.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":40,"minAge":8,"categoriesAndMechanics":["Dice","Maze","Different Dice Movement"],"rating":0,"complexity":0},{"bggId":"371931","name":"Bags of Fruit","description":"A push your luck fruit bag builder of picking the fruit and then trying to sell as much as you can, but you can only sell what you can remember. Pick your fruit from the bag, stop at anytime, but don't pick out rotten fruit or your turn is over. Once 5 rotten fruit have been picked, the selling phase begins. Roll the dice and try and remember what fruit are in your bag. Once a player earns $10 they win!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":45,"minAge":8,"categoriesAndMechanics":["Memory","Closed Drafting"],"rating":0,"complexity":0},{"bggId":"371933","name":"Six Links","description":"SIX LINKS is a word guessing game. Be the first team to score 30 points by correctly guessing mystery words based on 6 clues! But&hellip; more clues mean less points!&#10;&#10;Players form two even teams and play the game in rounds. In a given round, one player on each team will be the hinter, and the remaining players will be guessers. Each round, a new clue card (that contains 6 clues and a mystery word) is drawn by the designated hinter. The hinter has the power to choose if their team will play first or pass the clue card to the other team.&#10;&#10;The hinter of the starting team randomly pulls tokens from the bag, dictating which clues can be given. Their team has ONE guess at the mystery word &mdash; if they guess wrong, the clue card is passed to the other team who can then pull more tokens from the bag and try to guess the word. The card is passed back and forth between teams until the mystery word is found!&#10;&#10;Be strategic, and ready to show your acting, drawing, and singing skills!&#10;&#10;","minPlayers":3,"maxPlayers":8,"minPlayTime":25,"maxPlayTime":35,"minAge":12,"categoriesAndMechanics":["Card Game","Deduction","Party Game","Word Game","Team-Based Game"],"rating":5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/NxkrezQjP6wb6WJATJcBeA__thumb/img/PZ4ty7CfZ0r8_ydtylpQWUQLzxc=/fit-in/200x150/filters:strip_icc()/pic7325982.png","urlImage":"https://cf.geekdo-images.com/NxkrezQjP6wb6WJATJcBeA__original/img/1aAdKjFqBmSRFl8fbv7SL-V-sUU=/0x0/filters:format(png)/pic7325982.png"},{"bggId":"371935","name":"Serena","description":"In Serena, you will be playing a young fox of good breeding in Venezia trying to win Serena&rsquo;s heart.&#10;&#10;However the task is not an easy one. Other contenders have come tonight with the same goal as you.&#10;&#10;You will need to use deduction and logic to discover the identity of your competitors. At the bar or on the dance floor, don&rsquo;t stop at anything to unsettle other suitors and win Serena&rsquo;s eternal favours. Your love will be sealed with a waltz under the full moon&rsquo;s intense glow.&#10;&#10;each player carries out 1 and only 1&#10;action before moving on to the player on his left, who then becomes the active player, and so on until&#10;one player wins the game.&#10;&#10;When it&rsquo;s his turn to play, a player may carry out:&#10;- An action at the bar (3 types of action possible) which consists mainly of exchanging cards&#10;- An action on the dance floor (3 types of action possible) which consists mainly in accusing other players&#10;- An action on a gondola: winning the game.&#10;&#10;The first player who discover Serena by deduction win the game.&#10;&#10;-description from publisher&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":15,"maxPlayTime":40,"minAge":13,"categoriesAndMechanics":["Murder/Mystery","Hidden Roles"],"rating":4.75,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/aQjQcvSxFT6RpQRAujXLhg__thumb/img/61Vq5NhqLUpnwlLOv1GrCvlNSCw=/fit-in/200x150/filters:strip_icc()/pic7124399.png","urlImage":"https://cf.geekdo-images.com/aQjQcvSxFT6RpQRAujXLhg__original/img/nZu5ix3ZEweznqylOad7X7QNYO0=/0x0/filters:format(png)/pic7124399.png"},{"bggId":"371941","name":"No Peace for Thirty Years! The German Wars of Religion 1618-1648","description":"In 1618, three men were tossed out of a window in Prague Castle in an act of rebellion against the catholic king of Bohemia, a defenestration beginning the Thirty Years&rsquo; War. Encompassing all of Germany and featuring soldiers and generals from all over Europe, the Thirty Years&rsquo; War was the last and greatest of the European Wars of Religion.&#10;&#10;No Peace for Thirty Years is a two player stand alone wargame using the No Peace Without Spain system. It contains two scenarios, the Winter King scenario (from 1618 to 1629) and the Lion of the North scenario (from 1630 to 1648), as well as the full No Peace for Thirty Years scenario (from 1618 to 1648).&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":180,"maxPlayTime":300,"minAge":0,"categoriesAndMechanics":["Pike and Shot","Wargame","Campaign / Battle Card Driven","Point to Point Movement","Scenario / Mission / Campaign Game"],"rating":4.283335,"complexity":3.5,"urlThumb":"https://cf.geekdo-images.com/rCUU9vYO5XcKHASmrG2n0Q__thumb/img/L-FBX6GXmgXoOiPGyAcmSGjNdfg=/fit-in/200x150/filters:strip_icc()/pic7295121.jpg","urlImage":"https://cf.geekdo-images.com/rCUU9vYO5XcKHASmrG2n0Q__original/img/QjNsHKTU3xYjdqmY2U0L-WQZiUQ=/0x0/filters:format(jpeg)/pic7295121.jpg"},{"bggId":"371946","name":"Cupcake Draft","description":"Chocolate, vanilla or berry frosting? Which one is the most delicious? And most importantly, which one will earn you victory?&#10;&#10;Cupcake Draft is a fast-playing card drafting game, in which your goal is to bake different cupcakes for the picky customers.&#10;&#10;Each game is divided into two phases - drafting and bidding.&#10; In the drafting phase players will draft different Cupcakes. Each of the cupcakes has different flavor levels which will help with certain customers.&#10;&#10;In the bidding phase players use the Cupcakes which they drafted to bid for the customers which give victory points.&#10;&#10;The player with the most victory points is the winner.&#10;&#10;-description from publisher&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":15,"minAge":7,"categoriesAndMechanics":["Card Game","Auction/Bidding","Hand Management","Open Drafting"],"rating":3,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/ZEvE3v1W8SSp77vnjTIVUg__thumb/img/Bg36wzpZVmc8nid9eLoLLpksSgM=/fit-in/200x150/filters:strip_icc()/pic7106908.jpg","urlImage":"https://cf.geekdo-images.com/ZEvE3v1W8SSp77vnjTIVUg__original/img/LQjk9YkEXlQydJmBIDPGE51NMlw=/0x0/filters:format(jpeg)/pic7106908.jpg"},{"bggId":"371953","name":"More or Less Original Edition Card Game: How Good Is Your Judgement?","description":"More or Less is a trivia quiz card game, with an outlandish collection of random, surprising and amusing questions where you apply your judgement and answer with More or Less. Jam-packed with obscure trivia questions where you&rsquo;ll likely answer based on your best judgement rather than knowledge. Unlike some other quiz and board games, More or Less a super-inclusive quiz game for all and means the brain of the group isn&rsquo;t always going to win.&#10;&#10;","minPlayers":2,"maxPlayers":99,"minPlayTime":15,"maxPlayTime":60,"minAge":14,"categoriesAndMechanics":["Educational","Questions and Answers"],"rating":2.857145,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/j5kWxfQkXxQpF002Cw-uOw__thumb/img/95IQinrChY2qmZ1i36BmAU6k_kA=/fit-in/200x150/filters:strip_icc()/pic7966805.png","urlImage":"https://cf.geekdo-images.com/j5kWxfQkXxQpF002Cw-uOw__original/img/X3eT-R6JIEyWFGCQ4pR10KMWIkk=/0x0/filters:format(png)/pic7966805.png"},{"bggId":"371955","name":"Wandering the Whimdark","description":"Welcome to the Wandering the Whimdark, a solo journaling RPG engine that utilizes a Character Sheet, a deck of 25 cards (five different suits, with values from 6 to 10), three 6-Sided Dice, and this adventure source book. In playing this game you are taking on the role of a character who for their own reasons has chosen to embark on a journey through this wonderful and whimsical, wild and perilous world. You&rsquo;ll have to use your skills not only to make your way through the Whimdark, but to survive the encounters it throws at you.&#10;&#10;This is a game about telling stories. The Whimdark wants you to wander its overgrown trails, seek out new and interesting inhabitants, find lost things, confront your beasts. Know that as you wander, dangers lurk near, fight when you can, and run when you must. Not everyone makes it through the Whimdark&hellip;&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":30,"maxPlayTime":30,"minAge":12,"categoriesAndMechanics":["Adventure","Book","Fantasy","Campaign / Battle Card Driven","Re-rolling and Locking","Role Playing","Solo / Solitaire Game"],"rating":4,"complexity":0},{"bggId":"371956","name":"Fall of the Mountain King (Kickstarter Edition)","description":"Fall of the Mountain King (Kickstarter Edition) is an EXCLUSIVE edition and will not be available at retail. It includes the following additional content and deluxe components:&#10;&#10;- River of Fire Mini-Expansion&#10;- Notorious Gnomes Mini-Expansion&#10;- Copper-foiled box cover&#10;- 125 Troll miniatures in 5 different player colours&#10;- 25 Champion miniatures in 5 different player colours&#10;- 30 Gnome miniatures&#10;- 1 Swarm miniature&#10;- Custom moulded GameTrayz inserts with individual player trays&#10;- Warhammer miniature First Player marker&#10;- 65 wooden Influence markers shaped like hands&#10;- 5 wooden Supply barrels&#10;- Shiny gold-foiled Elder cards&#10;- Shiny silver-foiled Great Halls tokens&#10;- Dual-layered Clan boards&#10;- Custom wooden Gnome Wheel pawn with screen-printed &quot;Evil eyes&quot;&#10;- Custom-printed wooden Troll Skull score markers&#10;- 150 wooden custom-shaped Ancestry cubes&#10;&#10;About the mini-expansions:&#10;&#10;The River of Fire expansion is another Kickstarter exclusive.&#10;&quot;Desperate for a weapon to drive off the Gnomes, the Trolls have breached the volcanic crater at the mountain's heart, allowing burning lava to flow out.  As the game goes on, you'll try to divert the river of fire to overwhelm the Gnomes, confound your rivals, and draw strength from its intense power.  But be careful!  Too much heat can burn even the toughest Troll, and devastate unlucky Domains!&quot;&#10;- 22 Fireworker tokens&#10;- 10 Volcano cards&#10;- 25 Lava gems (acrylic)&#10;- Rules booklet&#10;&#10;Notorious Gnomes is another mini-expansion that comes with this edition.&#10;&quot;Each notorious gnome causes new headaches for you and offers big rewards for defeating them as well.&quot;&#10;- 12 Notorious Gnome cards&#10;- 8 Problem cards&#10;- 12 Notorious Gnome tokens&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":60,"maxPlayTime":90,"minAge":8,"categoriesAndMechanics":["Puzzle","Action Points","Area Majority / Influence","Closed Drafting","Constrained Bidding","Rondel"],"rating":3.787495,"complexity":3.5,"urlThumb":"https://cf.geekdo-images.com/68EcsFil9HwdPUUdZX0B-w__thumb/img/Jc4wSIjEJ2R07bjQ8guJKiOIFvc=/fit-in/200x150/filters:strip_icc()/pic7116507.jpg","urlImage":"https://cf.geekdo-images.com/68EcsFil9HwdPUUdZX0B-w__original/img/506C_gvKxhwsMb84wzql92_SzTo=/0x0/filters:format(jpeg)/pic7116507.jpg"},{"bggId":"371974","name":"Shiranui","description":"Shiranui is a trick-taking game where you hand out 8 cards from 5 types of cards with numbers from 0 to 7.&#10;&#10;The person who puts out the card with the lowest number will be the winner and earn points.&#10;&#10;But then, the person who is given a card with a low number will be an advantageous luck game.&#10;&#10;In Shiranui, you can increase the number of the opponent's card by using the tokens distributed.&#10;&#10;Are you going to use the given tokens to get in the way of the other party...&#10;&#10;Do you use it to increase your points...&#10;&#10;It is a troublesome game where the timing and usage of using tokens affect the victory or defeat.&#10;&#10;","minPlayers":3,"maxPlayers":5,"minPlayTime":40,"maxPlayTime":40,"minAge":10,"categoriesAndMechanics":["Card Game","Trick-taking"],"rating":3.416665,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/n6m_9szC5fBoe6_DEhSp4Q__thumb/img/ca-Ry_YwVRiHwVIlA7HO4CZ43WA=/fit-in/200x150/filters:strip_icc()/pic7112042.jpg","urlImage":"https://cf.geekdo-images.com/n6m_9szC5fBoe6_DEhSp4Q__original/img/kqFqCns81o8roWxHlE1lBpnAfcU=/0x0/filters:format(jpeg)/pic7112042.jpg"},{"bggId":"371980","name":"Asteroid Dice","description":"The first of its kind - a squishy dice throwing and rolling strategy party game!&#10;&#10;&#10;Asteroid Dice came about from a love of dice and dodgeball! A dicey combination? We don&rsquo;t think so. Simply throw and collide your squishy foam dice to roll the highest score each round and win all the cards in the asteroid field. You must choose a dice from the middle of the table, but if you pick the same as someone else, then battle it out to see who gets that dice and who loses their card!&#10;&#10;&#10;How to play: Place all the giant squishy dice in the center of the table and take your deck of cards. Secretly choose which dice card you want to play, and on the count of 3 reveal it to the other players. Grab the dice you chose and prepare to roll them! If anyone matches their cards, you brawl with the chosen dice.The last player hit will gain their opponent&rsquo;s cards and the losers have to choose from the leftover dice. Now everyone rolls their dice in turn - starting with the D20 and down to the D6 with the highest number winning. But watch out for the special cards! Losteroid cards are blackholes that will suck all the cards away in the round and reduce your score if you end up with one in your score pile. Play your &quot;I Can&rsquo;t Diecide&quot; card if you&rsquo;re not sure which dice to choose or as part of your dice game strategy.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":35,"minAge":8,"categoriesAndMechanics":["Action / Dexterity","Card Game","Dice","Party Game","Science Fiction","Dice Rolling","Matching","Take That"],"rating":3.133335,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/CZI63qlhXWKru9hGXmNxiw__thumb/img/nqAu-OJeMy9qj8ucZB_Db3wOJIQ=/fit-in/200x150/filters:strip_icc()/pic7521363.png","urlImage":"https://cf.geekdo-images.com/CZI63qlhXWKru9hGXmNxiw__original/img/LMvRFYzU25T2sdV-t8XZIk9KNBQ=/0x0/filters:format(png)/pic7521363.png"},{"bggId":"371987","name":"Robots Vs Dinosaurs","description":"Robots vs. Dinosaurs is a turn-based action card game where players must battle for their survival before a massive asteroid impacts the planet.&#10;&#10;The Story: Millions of years ago...&#10;A dinosaur shaman has discovered an incoming Asteroid that will create havoc when it impacts in 5-7 days. There is a sacred cave in the great valley that can protect them. If they can get there before the impact, they&rsquo;ll survive. Meanwhile, having escaped their imploding home planet, a group of robots have landed on the planet to make a new home. The robots have built shield generators to protect themselves, but their site is right in front of the sacred cave.&#10;&#10;In this game, robots are trying to keep their shield generators operational to win the game and dinosaurs are trying to destroy the shield generators to get to the sacred cave to win.  There is a deck of 7 day cards which act as a countdown clock for the game.  Each day is a round where all players get a turn.  The Asteroid day is the last day of the game and is shuffled in a way where you don&rsquo;t know if the game will end on day 5, 6 or 7.&#10;&#10;Players Divide into two teams: Robots and Dinosaurs.  Each team has a deck of fighters, bonus and robot equipment cards.  The speed of your fighters will determine the turn order of each day where players will battle each other's fighters and try to break or fix the shield generators.&#10;&#10;-description from publisher&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":20,"maxPlayTime":80,"minAge":11,"categoriesAndMechanics":["Card Game","Fighting","Team-Based Game"],"rating":0,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/xRo1JzWToocJLPboA0n4Bg__thumb/img/c1WV8JSh28mdUYhRTMSiyL5SI3k=/fit-in/200x150/filters:strip_icc()/pic7107277.png","urlImage":"https://cf.geekdo-images.com/xRo1JzWToocJLPboA0n4Bg__original/img/-piUW5dRtL90UYZCUNpx4BsQcrI=/0x0/filters:format(png)/pic7107277.png"},{"bggId":"371989","name":"Carrera de Compras","description":"Grandma has returned from her rock tour and wants to show her grandchildren her delicious recipes. The grandchildren, four wonderful young people, endowed with unique abilities, have let the family ties that unite them vanish.&#10;&#10;The Grandmother will try by all means that they return to share the old time love You must assume the role of one of the grandchildren and collaborate with the others to achieve a common goal.&#10;&#10;Will they be able to fulfill Grandmother's legacy? Players start with a sum of money that must circulate around the supermarket to buy the products of Grandma's recipe. They must collaborate with each other to give the products to Grandma and thus win the game.&#10;&#10;If any player cannot pay what is indicated on the board, the others will help him pay. In the event that a player runs out of money, they continue to play and their expenses are assumed by the other players.&#10;&#10;If among all the players they cannot pay what is indicated on the board, they will lose the game.&#10;&#10;&#10;La Abuela ha regresado de su gira rockera y quiere ense&ntilde;ar a sus nietos sus riqu&iacute;simas recetas. Los nietos, cuatro j&oacute;venes maravillosos, dotados de habilidades &uacute;nicas, han dejado desvanecer los lazos familiares que los unen. La Abuela tratar&aacute; por todos los medios que vuelvan a compartir el cari&ntilde;o de anta&ntilde;o.&#10;&#10;Deber&aacute;s asumir el rol de uno de los nietos y colaborar con los dem&aacute;s para lograr un objetivo com&uacute;n, &iquest;podr&aacute;n cumplir con el legado de la Abuela?&#10;&#10;Los jugadores comienzan con una suma de dinero debiendo circular por el supermercado para comprar los productos de la receta de la Abuela. Deben colaborar entre s&iacute; para darle los productos a la Abuela y de este modo ganar la partida.&#10;&#10;Si alg&uacute;n jugador no puede pagar lo indicado en el tablero, los dem&aacute;s le ayudar&aacute;n a pagar. En el supuesto de que alg&uacute;n jugador se quedara sin dinero, siguen jugando y sus gastos son asumidos por los dem&aacute;s jugadores.&#10;&#10;Si entre todos los jugadores no pueden pagar lo indicado en el tablero, perder&aacute;n la partida.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Children's Game","Humor","Racing","Cooperative Game","Dice Rolling","Variable Player Powers"],"rating":4,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/RqeuEhK8yxSBtvJPyJJc9g__thumb/img/9kfgEexMiSlJ7FxAG_WRLay26QY=/fit-in/200x150/filters:strip_icc()/pic7117281.jpg","urlImage":"https://cf.geekdo-images.com/RqeuEhK8yxSBtvJPyJJc9g__original/img/cNjefcBaTxzLNxy4a973U44xFOg=/0x0/filters:format(jpeg)/pic7117281.jpg"},{"bggId":"371999","name":"Budget Fighter","description":"The base game is a book and set of punch-out tokens that combine with ANY miniatures or grid maps you have from ANY game.&#10;&#10;The modular system is designed for cooperative play with a large group of friends while being both budget friendly and allowing one to use some favorite game pieces that were either in storage or just never meant for gaming.&#10;&#10;For instance you can play with Warhammer 40k, Dungeons &amp; Dragons, and Star Wars mini figs all in the same game on a Heroclix map. The combinations are endless and easily supported by an easy to use system.&#10;&#10;The game even supports basic play without any miniatures or maps in your collection.&#10;&#10;Players choose teams from various classes and play games in either a cooperative or head-to-head fashion. Players can choose; Deathmatch, Capture the Flag, Crusade, or Survival Mode.&#10;&#10;In &quot;Crusade&quot; mode players occupy bases around a map over the course of several rounds. In Survival Mode players cooperatively fight against waves of AI generated and operated themed opponents such as zombies, or aliens, or the dreaded escaped zoo animals.&#10;&#10;Bottom Line is this is a fun board game with endless replicability and options.&#10;&#10;","minPlayers":1,"maxPlayers":99,"minPlayTime":20,"maxPlayTime":120,"minAge":8,"categoriesAndMechanics":["Miniatures","Print & Play","Wargame","Action Points","Dice Rolling","Grid Movement","Line of Sight","Multiple Maps","Turn Order: Stat-Based"],"rating":4,"complexity":0},{"bggId":"372023","name":"Audubon Bird Spotting Opoly","description":"Play on a beautiful nature themed game board featuring vibrant watercolor work of famous lover and observer of birds John James Audubon. Learn fun facts about key species the National Audubon Society works tirelessly to protect. Collect the most bird sightings to win!&#10;&#10;Includes: Game Board, 6 Collectible Metal Tokens, 22 Audubon Bird Property Cards, 4 Seasons Cards, 2 Gear Cards, 16 Field Guide Cards, 16 Birder's Journal Cards, 1 Pack of Custom Money, 32 Plastic Egg markers, 12 Plastic Nest markers, 2 Dice, and Rules.&#10;&#10;Property cards have trivia about birds on the back; Six metal playing pieces include Bins (Binoculars), Duck, Hummingbird, Heron, Owl, Eagle.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":8,"categoriesAndMechanics":["Animals"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/TJigzqTW6n3kkoLW201N9g__thumb/img/ZhgsLrpN9hP7J3qGYFgiIi0gocc=/fit-in/200x150/filters:strip_icc()/pic7265188.png","urlImage":"https://cf.geekdo-images.com/TJigzqTW6n3kkoLW201N9g__original/img/seS8Wele1JEzKwIbPHfiYLJ34bY=/0x0/filters:format(png)/pic7265188.png"},{"bggId":"372028","name":"Check Out","description":"This game came with a TI-400 5-function calculator.&#10;&#10;Setup: give each player a checkout counter (board) and $23. Each board has spaces for 4 servings each of Fruit &amp; Vegetables, Bread &amp; Cereal, and Dairy, and 2 spaces each for Meat and Bonus items. On turn, spin the spinner then draw a card from the food group matching the color spun and decide if you want to buy it. If you don&rsquo;t buy it, return it to the bottom of the deck. If you buy it, draw a Pot Luck card and pay the price for the item as det by the item card and Pot Luck card then discard the Pot Luck card and place the item on its matching space on your checkout counter. If all such spaces are filled, you may place the card on a Bonus Item space or hold it to trade or sell. In lieu of drawing a card, you may use your turn to sell or trade a food card to another player for food or money. If a player makes an incorrect challenge, any other player may challenge them. The person who was wrong (the player or the challenger) must pay the bank the correct amount without receiving a card. Game ends when a player fills their checkout counter entirely. That player gets a 100-point bonus. Players then score 25 points for each item on their counter and 1 point for each penny not spent. High score wins. As a variant, deal each P a People card at the start of the game. Each card shows a calorie target. During scoring, subtract one point for each calorie above or below the target.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":60,"minAge":11,"categoriesAndMechanics":["Math","Set Collection"],"rating":2,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/ZMKCuXLIrqqm6ZBfBgVJlw__thumb/img/HLrT0Bs2gJNYuguiOdkDsQDSfEk=/fit-in/200x150/filters:strip_icc()/pic7107546.jpg","urlImage":"https://cf.geekdo-images.com/ZMKCuXLIrqqm6ZBfBgVJlw__original/img/mTNHAp3Tn727P11HXE0KH6qiGkg=/0x0/filters:format(jpeg)/pic7107546.jpg"},{"bggId":"372029","name":"Bucket Race","description":"Bucket Race is a brand-new strategy and tabletop game where players race to see who can complete their bucket lists first!  The first edition is a map of the United States.&#10;&#10;We welcome fellow explorers, dreamers, trailblazers, curiosity-seekers and casual bucket-listers of every kind to the Bucket Race!&#10;&#10;The game consists of the following phases:&#10;&#10;1. Setting up the game:&#10; - Game setup&#10; - Player setup&#10; - Choose a Home Destination&#10;&#10;2. Game flow:&#10; - First Turn, Every Turn&#10; - Additional Actions&#10; - Ending the Game&#10;&#10;The board has the following components:  &#10; - Game board (map of US with 5 distinct region with 1 reward lounge each, 45 destinations with a # between 2-12, spaces for 2 supplies that are randomized at the game's onset)&#10; - Game pieces: 2 dice, 5 player pieces, 52 deck of Surprise! Cards, 52 deck of Upgrade Cards, 5 wet erase markers, 90 supplies, 5 reward lounge tokens, Money&#10; - Rules booklet&#10; - 18 Persona Cards/Bucket Lists - the heart of the game is selecting a Persona Card/Bucket List which is the character you will take on and have to complete their bucket list the fastest in order to win.&#10;&#10;Game flow: &#10;Each turn players first collect $100, then roll the dice to see if they can collect additional money (many ways through dice rolls, Surprise! Cards, also if roll doubles get an additional $100!).  Then they use money to pay to move their game piece, collect and manage supplies, check-off bucket list items, visit rewards lounges for additional upgrade cards, redeem upgrade cards if in possession, or trade and sell supplies to other players.&#10;&#10;The first player to check-off all Bucket List items on their Persona Card and travel back to their &ldquo;Home&rdquo; destination, wins the Bucket Race!&#10;&#10;This is a game where it is best to collaborate early on (trade supplies, help each other out), but then the last stretch it is truly a race to see who can win first!&#10;&#10;Additionally, the bucket list items are based on real-life bucket lists, so we like to think this is a learning and travel game as well!  It is perfect for those that love competitive, strategy board games with travel and culture.&#10;&#10;3-5 players or can play in teams.  There are 3 versions (Easy Tenderfoot, Medium Trailblazer, Advanced Globetrotter).  We recommend starting with Easy first to get the hang of the game.  Usually takes between 50-75 minutes to play, although for experienced gamers you could complete in 30-45 minutes if do a speed round.&#10;&#10;-description from publisher&#10;&#10;","minPlayers":3,"maxPlayers":5,"minPlayTime":45,"maxPlayTime":90,"minAge":10,"categoriesAndMechanics":["Adventure","Travel"],"rating":5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/GTOz3vVxjeOHUEFsFiN_gw__thumb/img/cqGgbo1-neuVw4g8kUvJlXCWqcw=/fit-in/200x150/filters:strip_icc()/pic7145565.jpg","urlImage":"https://cf.geekdo-images.com/GTOz3vVxjeOHUEFsFiN_gw__original/img/TZnu6OfNWesnlGQTdOnVmMYjhSY=/0x0/filters:format(jpeg)/pic7145565.jpg"},{"bggId":"372030","name":"Furrow Fields","description":"In Furrow Fields, 2-4 players take on the role of farmers competing to earn the most points and win the Harvest Festival&rsquo;s Grand Champion title. Points are earned by successfully growing and harvesting crops from your field and completing as many villager commissions as you can before the festival begins at the end of the 14th round. Each round consists of a day phase and a night phase.&#10;&#10;Each round a different player begins the day by choosing two seeds from a dwindling selection (and thereby limiting the options for others), harvesting grown crops from their field, and deciding whether to spend points on or use farm tools. Once done tending to their field, they then either turn in a completed commission, take on a new one (before another player takes it), or spend the rest of the day exploring the village. The next player then starts their day phase, until everyone has completed their day and night falls. At night, as crops grow closer to harvest, a variety of events may take place ranging from a visit by the hungry local wildlife to a useful item finding its way into a field.&#10;&#10;-description from publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":60,"minAge":14,"categoriesAndMechanics":["Farming","Contracts","End Game Bonuses","Events","Open Drafting","Turn Order: Progressive"],"rating":2.75,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/Qo94H4hpnAKh5B0LSmLElA__thumb/img/3KTrxkB3YTODULTJ-Y_vqzldPdI=/fit-in/200x150/filters:strip_icc()/pic7122045.jpg","urlImage":"https://cf.geekdo-images.com/Qo94H4hpnAKh5B0LSmLElA__original/img/pv6RknCtfEUqdpqWes9gImEGuNI=/0x0/filters:format(jpeg)/pic7122045.jpg"},{"bggId":"372034","name":"Ciechanów: Przasnysz 1939","description":"The game simulates the military engagements that took place in September, 1939, between Polish and German forces in the area near the towns of Ciechan&oacute;w and Przasnysz (north of Warsaw, near the border with what was then German East Prussia).&#10;&#10;The game was included in Taktyka i Strategia magazine no. 44. It consists of 1 map and 3 scenarios. It uses the WB&ndash;95 wargaming system developed by Taktyka i Strategia.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Wargame","World War II","Dice Rolling","Grid Movement","Hexagon Grid","Zone of Control"],"rating":3.7,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/dBeOXWufGTvZnpYz2cfP7A__thumb/img/89-DT1m7bx3nMNO7vn3CddNvDhI=/fit-in/200x150/filters:strip_icc()/pic7124409.jpg","urlImage":"https://cf.geekdo-images.com/dBeOXWufGTvZnpYz2cfP7A__original/img/xo4Bcfw8iWtoTgtbHxoyHgJDVqI=/0x0/filters:format(jpeg)/pic7124409.jpg"},{"bggId":"372035","name":"Turbo Town","description":"Prove that you are the most skilled mechanic in Turbo Town and repair broken vehicles before your opponents do!&#10;Will you be the fastest mechanic?&#10;&#10;In a hectic city with illegal racing and impatient drivers who want their vehicles fixed now, if you want to be the most famous mechanic in town, you must repair vehicles before your rivals, but choose your customers wisely!&#10;&#10;In this fast-paced game, 2 to 6 players compete in quick, 30-minute games that can only be won by one player!&#10;&#10;You will assign the dice you obtain to vehicles to repair them, taking into account the unique ability of your mechanic and that you can re-roll them up to 3 times.&#10;&#10;When you complete your victory objective card, you will trigger the end of the game.&#10;&#10;Each car gives you a number of points, but if you get sets by colour, you will also score points!&#10;&#10;-description from designer&#10;&#10;(Espa&ntilde;ol)&#10;Demuestra que eres el mec&aacute;nico m&aacute;s habilidoso de todo Turbo Town y repara los veh&iacute;culos averiados &iexcl;antes que tus oponentes!&#10;&#10;En una ciudad fren&eacute;tica con carreras ilegales y conductores impacientes que quieren su veh&iacute;culo arreglado &iexcl;ya!, si quieres ser el mec&aacute;nico m&aacute;s famoso de la ciudad, deber&aacute;s reparar los veh&iacute;culos antes que tus rivales, pero, &iexcl;elige bien los clientes!&#10;&#10;En este trepidante juego compiten de 2 a 6 jugadores, en partidas r&aacute;pidas, de unos 30 minutos de duraci&oacute;n, que &iexcl;s&oacute;lo puede ganar uno!&#10;&#10;Tendr&aacute;s que asignar los dados que obtengas a veh&iacute;culos para repararlos, teniendo en cuenta la habilidad &uacute;nica de tu mec&aacute;nico y que puedes relanzarlos hasta 3 veces.&#10;&#10;Cuando completes tu carta de objetivos de victoria, desencadenar&aacute;s el final de la partida.&#10;&#10;Cada coche te da un n&uacute;mero de puntos, pero, si logras conjuntos por colores, &iexcl;tambi&eacute;n puntuar&aacute;s!&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":45,"minAge":8,"categoriesAndMechanics":["Dice","Dice Rolling","Passed Action Token","Re-rolling and Locking"],"rating":3.770835,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/M8nGC_nZMBZ5qMxHimfISg__thumb/img/yRh2dYVKW-H3kN4D_V28-NrlHGw=/fit-in/200x150/filters:strip_icc()/pic7130689.png","urlImage":"https://cf.geekdo-images.com/M8nGC_nZMBZ5qMxHimfISg__original/img/QpRkhTm_leobOnlCueuhVQ_jhR8=/0x0/filters:format(png)/pic7130689.png"},{"bggId":"372043","name":"Arkanolodzy","description":"&quot;Arkanolodzy&quot; is a cooperative card game for 2-4 players.&#10;&#10;This game uses 22 major arcana tarot cards.&#10;&#10;Players take turns playing cards one at a time, aiming to play all the cards.&#10;&#10;Each card has unique abilities which may sometimes help or interfere the players.&#10;&#10;If all players successfully play all cards, all players win.&#10;&#10;However, if any player is unable to play a card on their turn, all players immediately lose.&#10;&#10;-description from designer&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":10,"maxPlayTime":30,"minAge":0,"categoriesAndMechanics":["Abstract Strategy","Cooperative Game","Tile Placement"],"rating":3.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/50XFXQweel2poarL4Uj54Q__thumb/img/r8_dMetqqJCUVnsacGIaSpVcQK4=/fit-in/200x150/filters:strip_icc()/pic7108862.png","urlImage":"https://cf.geekdo-images.com/50XFXQweel2poarL4Uj54Q__original/img/X0qd7VDolGAjlCLp424MfOPEDyc=/0x0/filters:format(png)/pic7108862.png"}]