[{"bggId":"87893","name":"Take It or Leave It","description":"Take It or Leave It is a game title asking to be mocked by those who don't like the design, so here's hoping it goes over well with audiences.&#10;&#10;What is the game, you ask? Each player has a hand of four task cards showing dice combinations and other tasks that the player is trying to achieve during a game round, such as a sum of pips less than 13, or two white dice and one black die; each card has a point value on it, with the tougher cards obviously being worth more points. Someone rolls a bunch of white, black and red dice, then players take turns choosing a die from the pool. Each player also holds one action card that lets them manipulate the dice to better achieve their tasks.&#10;&#10;On a turn, a player either takes a die or passes from the round. Once everyone has passed, players assign dice to their task cards, with red dice counting as either black or white. Complete your tasks, and you'll cheer (and score points); have dice unused, and you'll wish that you'd never been born &ndash; or you'll just lose a couple of points. Depends on how much of a drama queen you are.&#10;&#10;After each round, a player refills his hand of cards in the appropriate proportions, and after each player has started a round 1-3 times (depending on the number of players), the game ends and players tally their points.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Card Game","Dice","Dice Rolling"],"rating":3.055775,"complexity":1.3667,"urlThumb":"https://cf.geekdo-images.com/p8N3243q5Vord54ijYgfEQ__thumb/img/4kE7JtLPuCT1PSuYUP75gUZPc-U=/fit-in/200x150/filters:strip_icc()/pic1392348.jpg","urlImage":"https://cf.geekdo-images.com/p8N3243q5Vord54ijYgfEQ__original/img/ttYAU5EQ-9c2Zf58Req_9NRqE-c=/0x0/filters:format(jpeg)/pic1392348.jpg"},{"bggId":"357873","name":"The Old King's Crown","description":"The Old King&rsquo;s Crown is a game of card-driven conquest, where you play as heirs to a vacant throne, vying for control of an ancient, overgrown kingdom. Wield unique abilities and leverage your followers&rsquo; traits to best outwit your opponents across a map that stretches from the teetering heights of the castle to the dappled light of the necropolis.&#10;&#10;As leader of your faction you will be staking claims with Heralds openly as well as positioning your forces in secret, hoping to claim the locations that fit your designs. However, keep an eye on your rivals, as they too have agents and agendas, poised to undo your best laid plans.&#10;&#10;Royalty, rebels or ruses. What crown will you wear?&#10;&#10;In The Old King's Crown, players move their Herald to locations, hoping to claim them. Then simultaneously players play cards from their hand, facedown to regions of the board. These are then revealed and resolved. Winning these clashes will result in different rewards that further their position and grant them the game's primary goal, influence. When a player is able to reach a set number of influence, dependent on player count, and is able to retain it until the end of a round, they win the game.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":90,"minAge":12,"categoriesAndMechanics":["Card Game","Fantasy","Medieval","Betting and Bluffing","Card Play Conflict Resolution","Hand Management","Variable Player Powers"],"rating":3.919655,"complexity":3.1579,"urlThumb":"https://cf.geekdo-images.com/hQG2-XQoEhXCITIORvx24A__thumb/img/VQ9sUX2ihA0imZBfy-Ozaidq9Qc=/fit-in/200x150/filters:strip_icc()/pic7508098.jpg","urlImage":"https://cf.geekdo-images.com/hQG2-XQoEhXCITIORvx24A__original/img/3wBRN0PJEqd-p9IT3cSk4YYNHpk=/0x0/filters:format(jpeg)/pic7508098.jpg"},{"bggId":"206591","name":"Green Box of Games","description":"The Green Box of Games is not a single game, it is a game system that comes with a collection of 16 games you can play. Designed to be like a deck of cards for board games the box is filled with versatile components, tiles, cards, cubes and dice, that you can use to play lots of different games, or even create your own. The games included in the rulebook spans from quick family games to more complex strategy games, plus a few traditional classics, and includes solo games as well as games for up to 8 or 10 people. On the associated wiki there are around 100 game variants available.&#10;&#10;The Components provided are as follows:&#10;- 36 Square Tiles with 6 different symbols&#10;- 80 10 mm cubes in 4 different colors&#10;- 54 cards in 9 different colors&#10;- 2 standard dice&#10;&#10;The games in the box&#10;Traditional games:  Backgammon, Halma, Speed, Reversi, Liar&rsquo;s dice&#10;Adapted from modern classics:  Gold Mine, Tunnel Run, Son of Kark&#10;Original games: Flower Garden, Jump gate, War 2.0, Grenade Salad, The Gauntlet, Fawlty Towers, All Your Base, Temple of Doom&#10;&#10;","minPlayers":1,"maxPlayers":10,"minPlayTime":5,"maxPlayTime":120,"minAge":5,"categoriesAndMechanics":["Card Game","Game System"],"rating":3.71145,"complexity":1.6667,"urlThumb":"https://cf.geekdo-images.com/1yR9MANP2wxGf62b7zW53Q__thumb/img/Zs6W5Yf__sTSq0VydgRNkdHnvFM=/fit-in/200x150/filters:strip_icc()/pic3687604.png","urlImage":"https://cf.geekdo-images.com/1yR9MANP2wxGf62b7zW53Q__original/img/OF3nfbuYzqsFVeNsN0CfvpV6Vr8=/0x0/filters:format(png)/pic3687604.png"},{"bggId":"55756","name":"Anno Domini: Europa","description":"Anno Domini is a trivia game that focuses on estimation/guessing and bluffing more than on outright knowledge.&#10;&#10;Players get a number of cards with historical events (most often very obscure ones) and have to arrange them chronologically on the table by playing one card per turn.&#10;&#10;If a player thinks there is an error in the sequence of events, he or she can express this doubt instead of playing a card of his own. Depending on the outcome of the subsequent check, either the doubter or the player who put down the previous card is &quot;punished&quot; with additional hand cards.&#10;The goal of the game is to get rid of your hand cards as soon as possible.&#10;&#10;There are quite a few games in the Anno Domini series, each dealing with a different topic ranging from &quot;Inventions&quot; over &quot;Art&quot; or &quot;Coins&quot; to different geographic regions (e.g. Germany, America or now Europe). Even a SdJ edition exists!&#10;&#10;Each game consists of 340 cards and can be played stand-alone or mixed together with some or all of the other editions.&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":30,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Card Game","Educational","Party Game","Trivia"],"rating":3.368295,"complexity":1.2222,"urlThumb":"https://cf.geekdo-images.com/mqLhMai70UZMcPxIvxi2yg__thumb/img/23t8prr1THfIVOZRS-KQEa2XkO8=/fit-in/200x150/filters:strip_icc()/pic757280.jpg","urlImage":"https://cf.geekdo-images.com/mqLhMai70UZMcPxIvxi2yg__original/img/gh-F500zN0Fx9om2td44acOqzj4=/0x0/filters:format(jpeg)/pic757280.jpg"},{"bggId":"3562","name":"Theophrastus","description":"From the Mayfair website:&#10;&#10;At the end of the Renaissance, one alchemist rose above the rest: Theophrastus von Bombast der Hohenheim.&#10;&#10;His skill and knowledge of alchemy and science were legendary. Each year Theophrastus would accept only one new apprentice. This fortunate youth, upon completion of his training, would depart for the luxuries of life in the court of some noble or king.&#10;&#10;But Theophrastus had many applicants. To select his new apprentice, Theophrastus would challenge them with a clever test of their skill and alchemical talent. Only the most promising of these applicants would be chosen as the great alchemist's apprentice.&#10;&#10;Do you have the talent and knowledge to become an apprentice of the great Theophrastus?&#10;&#10;Will you be able to duplicate his experiments with greater skill than your competitors?&#10;&#10;Are you clever enough to overcome the fierce competition?&#10;&#10;Theophrastus provides clues to the nature of his experiments, but he will not share all the knowledge with everyone. Will you combine your limited selection of metals, elements and essentials to create the wondrous concoctions that the wealthiest of princes will envy and desire? Or will these secret combinations elude your every attempt?&#10;&#10;Perhaps, luck, ingenuity, and determination, will make you the alchemist's apprentice!&#10;&#10;Contains&#10;27 Experiment Forms,&#10;3 Blank Experiment Forms&#10;5 Player Experiment Forms&#10;120 Cards&#10;1 Pewter Marker&#10;Rulebook&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Card Game","Renaissance","Action Points","Set Collection"],"rating":2.95893,"complexity":2.125,"urlThumb":"https://cf.geekdo-images.com/Fw-FVJCoBNOlDIsdDjbb_w__thumb/img/F-YqDQ9MbV5dDlDVIIq2YJoycPg=/fit-in/200x150/filters:strip_icc()/pic1333243.jpg","urlImage":"https://cf.geekdo-images.com/Fw-FVJCoBNOlDIsdDjbb_w__original/img/XuSMcO7x1I0TfYnZWfSJCvuM6WA=/0x0/filters:format(jpeg)/pic1333243.jpg"},{"bggId":"169436","name":"Speedy Words","description":"An addictive card game that takes the famous Categories game to the next level. No need for a pen or paper.&#10;&#10;In each turn, a player flips a card, thus having one category, and three letters. Only one letters has a color that matches the color of the category.&#10;&#10;The first player that calls out loud a relevant word that starts with the correct letter wins the card.&#10;&#10;When only one card is left the game is over. The player who collected the highest number of cards wins the game.&#10;&#10;","minPlayers":1,"maxPlayers":10,"minPlayTime":10,"maxPlayTime":15,"minAge":6,"categoriesAndMechanics":["Card Game","Party Game","Real-time","Word Game"],"rating":3.05976,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/KhUTiAzRNgpjWh4Mf2nj2g__thumb/img/1OZVsIjL-ZA_lg4XtfqCceCrAv8=/fit-in/200x150/filters:strip_icc()/pic4807960.jpg","urlImage":"https://cf.geekdo-images.com/KhUTiAzRNgpjWh4Mf2nj2g__original/img/obpW_aguUxOeYns4JP6Ybm1OrAE=/0x0/filters:format(jpeg)/pic4807960.jpg"},{"bggId":"5831","name":"Britain Stands Alone","description":"Britain Stands Alone allows players to fight one of the most intriguing &quot;what if's?&quot; of WWII.&#10;&#10;The game explores the hypothetical possibilities of Operation Sea Lion, assuming that the Luftwaffe had succeeded in winning air superiority, and then gone on to the inflict serious losses upon the Royal Navy.&#10;&#10;Given their circumstances, could the Third Reich have won WWII in the fall of 1940?&#10;&#10;The game features:&#10;&#10;    Integrated air-sea movement and interception capabilities&#10;    Combined arms combats&#10;    Rules for Brandenburgers, Churchill, the Royal Family, etc&#10;    Additional Campaign starting with the Battle of Britain, adjusting the invasion possibilities based on the outcome of the air battle.&#10;&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":360,"maxPlayTime":360,"minAge":12,"categoriesAndMechanics":["Wargame","World War II","Dice Rolling","Hexagon Grid"],"rating":3.313335,"complexity":3.2,"urlThumb":"https://cf.geekdo-images.com/jGjw8O4QKrrRbwEPYu_zFA__thumb/img/c2TVBrHV1YGxMePfjZfHIfZFs90=/fit-in/200x150/filters:strip_icc()/pic28452.jpg","urlImage":"https://cf.geekdo-images.com/jGjw8O4QKrrRbwEPYu_zFA__original/img/7zayjgv70Ye8Lzh95mp1u93dnEg=/0x0/filters:format(jpeg)/pic28452.jpg"},{"bggId":"339599","name":"Magnolia","description":"Players lead a wide variety of creatures to build a kingdom. By placing the cards in your hand in the [3X3] field given to you, various abilities will be generated. The player who places them most effectively will win. Gain fortune, improve your skills and faith, and develop your country while competing with neighboring countries.&#10;&#10;Players can play up to 2 cards a turn and place them in a 3x3 grid on the table in front of them. if you play 2 cards, you get no money, if you play 1 you get 1 coin, if you play no cards, you get 2 coins.&#10;&#10;It is important to consider the card and its position with the aim of acquiring strength and bonuses. This is because there are position rules such as &quot;If you line up in a row with the same race / occupation, you can receive a placement bonus&quot; and &quot;Only units in the front line of each row can participate in the war&quot;.&#10;&#10;The game ends when someone plays 9 cards or reached 40 points. The player with the most points wins.&#10;&#10;&mdash;description from publisher&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":10,"maxPlayTime":20,"minAge":10,"categoriesAndMechanics":["Abstract Strategy","Card Game","Fantasy","Action/Event","Open Drafting"],"rating":3.63312,"complexity":1.8571,"urlThumb":"https://cf.geekdo-images.com/gv0gDjsQ2A9LH8taLSkTww__thumb/img/u1zlmg2wGRo6dRQ4hdPbcKdkWv4=/fit-in/200x150/filters:strip_icc()/pic6199783.jpg","urlImage":"https://cf.geekdo-images.com/gv0gDjsQ2A9LH8taLSkTww__original/img/mtrJQ20dE7rPrUF63MayAIBTXsE=/0x0/filters:format(jpeg)/pic6199783.jpg"},{"bggId":"146451","name":"Wrath of Kings","description":"A new miniature tabletop game.&#10;&#10;The website explains &quot;Wrath of Kings is a miniatures war game, where players take command of the armies of on of the five kingdoms of Arikania!  Scalable from 10 to 50 models per side, now you can vie for the throne of the Ancient King!&#10;&#10;&quot;With a unique one roll resolution system and an active chain of command, you'll feel like you're actually in charge of an army without being bogged down in tedious tracking.  Combat is fast, fluid, furious and tactical - your decisions will matter on the battlefield!&quot;&#10;&#10;There are five initial factions:&#10;&#10;House Teknes&#10;&#10;The armies of Teknes are some of the most well rounded troops. They are able to move from a defensive posture to attack in the blink of an eye. Both the Union Workers and Defender Linemen punish their enemies for attacking them. Their specialists and characters often employ lightning and magical wards to bolster their own defensive lines. No army attacks Teknes battle lines without expecting heavy casualties.&#10;&#10;House Shael Han&#10;&#10;The Shael Han fighting style is a mystery to all of their enemies and for good reason. The Legionaries are some of the weakest troops on the field by themselves, however whenever they are close by a specialist they become a force to reckon with. The Wrath led by their Big Sister are experts in engaging more than one enemy at a time. The true strength of any Shael Han army are their specialists, vulnerable by themselves but extremely powerful when working together they can cause a symphony of destruction on any battlefield.&#10;&#10;House Nasier&#10;&#10;Nasier love nothing more than to see their enemies wither in their path. The Nasier Ashmen charge is legendary and few enemies have ever lived to tell the tale. They&rsquo;re often supported by the Pelagarth who revel in combat and despite their lack of armor, cause more casualties then they take. The specialists of Nasier prefer to use flames to punish their enemies. One of the most aggressive armies, their zeal for reinstating the Efrenti presence leads them to wrought destruction throughout the continent.&#10;&#10;House Hadross&#10;&#10;As the most defensive army in the game, Hadross units become stronger both offensively and defensively as the game progresses. With each Deepmen lost, enemy models receive Resonate markers, which makes them easier to kill. Meanwhile the slower yet deadlier Sevridan keep enemy units from fleeing the battlefield. The Hadross specialists enhance the battlefield adding water elements to increase movement.&#10;&#10;House Goritsi&#10;&#10;Combining the fastest movement in the game with some of the strongest attacks Goritsi prefer hit and run tactics to conventional warfare. Players can employ the blazing speed of the Skorza to flank their enemies while their lethal Zeti hold the line. The terrible Blood Engine consumes the flesh of his enemies to heal his wounds. If you prefer high mobility armies and attacking first, Goritsi is the army for you.&#10;&#10;The models are in plastic, with weapons in polystyrene so that they keep nice straight edges on spear shafts, handles, and large sword blades etc.&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":60,"maxPlayTime":120,"minAge":0,"categoriesAndMechanics":["Fantasy","Miniatures","Wargame","Dice Rolling","Variable Player Powers"],"rating":3.938565,"complexity":2.9,"urlThumb":"https://cf.geekdo-images.com/tl-luJYGePznGv1wIqadBw__thumb/img/a78PwrbWb9O0NHhXlGhQuPCMAww=/fit-in/200x150/filters:strip_icc()/pic2452737.jpg","urlImage":"https://cf.geekdo-images.com/tl-luJYGePznGv1wIqadBw__original/img/5UnfrS0sQUqolUm5gyPn0yvrw78=/0x0/filters:format(jpeg)/pic2452737.jpg"},{"bggId":"102881","name":"Trench","description":"Trench is an abstract strategy game for two players based on the trench wars of World War I. Unlike most games, in Trench the 8x8 grid board is diamond-shaped; each player sets up his army on opposing sides of the &quot;trench&quot;, which divides the board into two. As hostilities between the armies commanded by the players grow, each attempts to seize control over the trench in order to take full advantage of its strategic potential, hoping thus to breach the opponent's defenses and capture the most valuable and important pieces.&#10;&#10;From the Soldiers to the General, each piece being subject to specific maneuvers, all will have to cooperate in order to be able to occupy the trench, invade the enemy's territory, and vanquish the foe. The army that manages to survive after two battles wins the game!&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":45,"maxPlayTime":45,"minAge":10,"categoriesAndMechanics":["Abstract Strategy","Grid Movement","Square Grid"],"rating":3.85595,"complexity":3.4762,"urlThumb":"https://cf.geekdo-images.com/Qb6Ogu4lPzTpA1rzimTvAw__thumb/img/4TL3n25538rXvKJp_S4BfSRLB40=/fit-in/200x150/filters:strip_icc()/pic7720484.jpg","urlImage":"https://cf.geekdo-images.com/Qb6Ogu4lPzTpA1rzimTvAw__original/img/zuox0qAq9RRmKlvjk9IO65PEP58=/0x0/filters:format(jpeg)/pic7720484.jpg"},{"bggId":"9360","name":"The Royal Navy","description":"Follow-up to Iron Bottom Sound.  The Royal Navy in action against Germany &amp; Italy in WWI &amp; II.  Also has US, French &amp; Soviet ships.   Surface ship only.   Hex and counter, but lots of tables and status sheets so it has a miniatures feel.&#10;&#10;Each hex represents 600 yards for night actions and 1500 yards for daylight actions. Each turn represents 3 minutes of real time for night actions and 7.5 minutes for day battles. The game scale is not a straight doubling of the scale because, on the average, friendly ships tend to sail closer to each other at night and further apart during daylight.&#10;&#10;","minPlayers":2,"maxPlayers":3,"minPlayTime":120,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Nautical","Wargame","World War I","World War II","Hexagon Grid"],"rating":3.684755,"complexity":2.5,"urlThumb":"https://cf.geekdo-images.com/WlPlNWbcsWP-v161cPYnFw__thumb/img/f3143x06z7ejfCs4_EGOxYEosoU=/fit-in/200x150/filters:strip_icc()/pic216379.jpg","urlImage":"https://cf.geekdo-images.com/WlPlNWbcsWP-v161cPYnFw__original/img/hfCJhDxlFkc8tXNL5xduvcYtF2c=/0x0/filters:format(jpeg)/pic216379.jpg"},{"bggId":"7922","name":"The 6 Days of Glory","description":"On to Paris!&#10;&#10;Napoleon in retreat, full. Napoleon was defeated in the battle of Leipzig the previous year. He was determined to make one last stand on the road to Paris. Facing a coalition between Prussia under Blucher and Russia under Sacken, Napoleon caught them and was about to crush them in decisive battles before Paris in 6 days of February, 1814.&#10;&#10;Designed by Hall of Fame Napoleonic game designer Kevin Zucker, developed by Paul Dangel, the game comes with a standard 22&quot; x 34&quot; map by Rick Barber showing mud and snowy ground at 1,700 yards per hex, 280 counters, mostly division size units. One 24-pages rulebook with 6-pages of historical commentary by the designer and 1-page of Terrain Effects Chart included (hence the rules actually occupy only 17 pages).&#10;&#10;The Six Days of Glory is an operational Napoleonic game. 3 short scenarios are included, covering the campaigns in three separate battles at three cities along the road to Paris: Champaubert (9~10 Feb); Montmirail (11~12 Feb) and Vauchamps (13~14 Feb), each playable in less than 1 &frac12; hours. A campaign scenario linking all three (9~14 Feb) battles from the beginning to the end can be completed in less than 3 hours.&#10;&#10;The French moves first in all scenarios. The game has a standard command check &ndash; move &ndash; combat sequence with an additional night turn on each turn during which armies can force march to out maneuver the enemy. Features include Chain-of-Command and Leadership Initiative, Artillery Bombardment, Supply and demoralization, Repulse at odds greater than 5-to-1, Movement across Pontoon Trains and Bridges (Allied only), and an interesting weather effect of forced mud on wheeled unit during the afternoon (PM) turn. Team play is also possible where Allied command is divided between Prussian and Russian and thus communication between the two is not allowed unless written messages are exchanged.&#10;&#10;GAME SYSTEM: DAYS System = 1,600m/hex, 800-1,000 men/SP, 6 hours/turn.&#10;&#10;","minPlayers":1,"maxPlayers":3,"minPlayTime":180,"maxPlayTime":180,"minAge":12,"categoriesAndMechanics":["Napoleonic","Wargame","Dice Rolling","Hexagon Grid"],"rating":3.35476,"complexity":2.9545,"urlThumb":"https://cf.geekdo-images.com/KUNxefFk64o_mcj1gTEd9w__thumb/img/0B1GbJD4mKkliDnNgw02jtgKsI4=/fit-in/200x150/filters:strip_icc()/pic32268.jpg","urlImage":"https://cf.geekdo-images.com/KUNxefFk64o_mcj1gTEd9w__original/img/1HAdqaIWsN3UP4o_AtVTerm7_Fk=/0x0/filters:format(jpeg)/pic32268.jpg"},{"bggId":"11111","name":"Red Star/White Eagle: The Russo-Polish War, 1920","description":"Red Star/White Eagle: The Russo-Polish War, 1920 is a game simulation of the Russo-Polish War of 1920.  Three scenarios and a campaign game chart the course of the Bolshevik invasion of Poland and the great Polish victory on the banks of the Vistula.  This regiment-brigade-division level game is scaled at one week turns and 14 mile hexes.  Intended for ages 12 to adult.&#10;&#10;Contents:  22&quot; x 27.75&quot; color map, 360 counters, complete rules and extensive charts.&#10;&#10;A nice game where both sides to get to attack and defend.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":180,"maxPlayTime":480,"minAge":12,"categoriesAndMechanics":["Wargame","Dice Rolling","Hexagon Grid","Simulation"],"rating":3.829165,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/GvZj1s9g7xVa6DwDW_UwPw__thumb/img/EPfZX8uiSVO-fA1anHdywv-8a8Y=/fit-in/200x150/filters:strip_icc()/pic45407.jpg","urlImage":"https://cf.geekdo-images.com/GvZj1s9g7xVa6DwDW_UwPw__original/img/6VCD3aiX8OGZw_h3BQ-McaaEXaQ=/0x0/filters:format(jpeg)/pic45407.jpg"},{"bggId":"283795","name":"Würfel-WG","description":"You roll the dice to get new flat-members. These bring along more dice and help you launch point-darting activities. &#10;The dice result does not only benefit the active player, but all of you! &#10;The winner is the first to keep the hammock for 1 round (which you get with 16 points)!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":35,"maxPlayTime":0,"minAge":10,"categoriesAndMechanics":["Dice","Humor","Contracts","Dice Rolling","Re-rolling and Locking","Take That"],"rating":3.144945,"complexity":1.4,"urlThumb":"https://cf.geekdo-images.com/Juwj02wv1iQJNKDWnLyjxA__thumb/img/KIPH4Ncv9VRZUq-ZorOeSHSvQJE=/fit-in/200x150/filters:strip_icc()/pic4979717.jpg","urlImage":"https://cf.geekdo-images.com/Juwj02wv1iQJNKDWnLyjxA__original/img/yp-1Pef9ORFLHpFdVAVjVDK10-0=/0x0/filters:format(jpeg)/pic4979717.jpg"},{"bggId":"301011","name":"Starlink","description":"Starlink is a drawing party game that takes its inspiration from the constellations in the night sky. On your turn, you must try to represent a secret word by drawing straight lines between the stars on the board, and then hope that the other players can guess what you are illustrating.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":3,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Party Game","Line Drawing"],"rating":3.171745,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/SIoVvs--11AsnGIX7MdVBQ__thumb/img/7zBxEF-neWrNGzdGYlzw9oyfl8c=/fit-in/200x150/filters:strip_icc()/pic5323062.png","urlImage":"https://cf.geekdo-images.com/SIoVvs--11AsnGIX7MdVBQ__original/img/v-308b15kJUbsEljkcX4bwtNPo0=/0x0/filters:format(png)/pic5323062.png"},{"bggId":"178515","name":"Little Circuses","description":"Step right up, step right up! The little circuses are open for business!&#10;&#10;In Little Circuses, you'll build your big top with attractions that'll wow the crowd. Recruit sword swallowers, daredevils, and mesmerizing mystics in an effort to turn your little road show into a fixture of fun!&#10;&#10;","minPlayers":1,"maxPlayers":7,"minPlayTime":30,"maxPlayTime":45,"minAge":10,"categoriesAndMechanics":["Tile Placement","Worker Placement"],"rating":3.18968,"complexity":2.4,"urlThumb":"https://cf.geekdo-images.com/5FHK4Zngg9wUWboaU0Xg4g__thumb/img/uLcJgX725rB3_7oJFE2CJG89J14=/fit-in/200x150/filters:strip_icc()/pic3507675.jpg","urlImage":"https://cf.geekdo-images.com/5FHK4Zngg9wUWboaU0Xg4g__original/img/weNt-Tew8nCN-fTEe9PSNTjfZbM=/0x0/filters:format(jpeg)/pic3507675.jpg"},{"bggId":"27574","name":"Island Fortress","description":"In Island Fortress, you play a master builder chosen by Governor Cortland Hansen to help construct the mighty Fort Aldenford using the penal colony on Alcott Island. Your goal is to become the most distinguished architect with the help of your Taskmaster, Workers, and the Governor himself!&#10;&#10;In the game, all players use identical decks of five Role Cards to plot their actions such as purchasing workers, building the wall, collecting money from the treasury, and more. In addition to scoring points for having built the majority of blocks on each row of the fortress wall, players can also gain various bonuses for completing favors for the Governor by building the walls in specific ways, following the Governor's preferred patterns.&#10;&#10;Island Fortress, formerly known as Huang Di and sporting a Great Wall of China theme, won the first ever ProtoSlam competition held by Cambridge Games Factory in August 2006 and is the first published game by designer Bryan Johnson.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":90,"maxPlayTime":90,"minAge":13,"categoriesAndMechanics":["Card Game","Auction: Sealed Bid","Pattern Building"],"rating":3.16268,"complexity":2.8889,"urlThumb":"https://cf.geekdo-images.com/9tXd7PNPPygnohWI5KP8yw__thumb/img/VPGp7E3_4uvnf3OffZY7CIHzQN8=/fit-in/200x150/filters:strip_icc()/pic1342730.jpg","urlImage":"https://cf.geekdo-images.com/9tXd7PNPPygnohWI5KP8yw__original/img/ZGL2A-jgFmsU1VNACNRua1T4w0g=/0x0/filters:format(jpeg)/pic1342730.jpg"},{"bggId":"17274","name":"Attacktix Battle Figure Game: Star Wars","description":"One of the most innovative additions to the boys action aisle is ATTACKTIX.  Launching with Star Wars: Episode III toys, ATTACKTIX is a battle figure game that combines great action figures with kinetic battling features.&#10;&#10;Each figure comes on a base that contains all of the information that a trading card might include, such as speed, defense, point value and special powers unique to that character.&#10;&#10;The goal of the game is simple: be the last one standing; but beyond that there are nearly unlimited strategies.  To begin, kids select how many points each squad should start out with, pick their squads and put them into formation.  On each turn, kids will move their figures across the table (counting distance using a patented clicking wheel in the base), and then attack with features like slashing light sabers, firing projectiles and others.  When the figures are knocked over, their special powers come into play and influence the game.  For example, granting another one of your figures an attack or bringing back a figure who may have been previously defeated.&#10;&#10;This version is based on characters in the Star Wars Universe.&#10;&#10;There are multiple themes in the Attacktix series of games.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":10,"maxPlayTime":10,"minAge":8,"categoriesAndMechanics":["Action / Dexterity","Children's Game","Collectible Components","Movies / TV / Radio theme","Science Fiction"],"rating":3.08093,"complexity":1.2564,"urlThumb":"https://cf.geekdo-images.com/XuSbga7BNBhILz87EMvJVg__thumb/img/rzke7pVbfu-0zMmeX9tbwHWNZeE=/fit-in/200x150/filters:strip_icc()/pic74086.jpg","urlImage":"https://cf.geekdo-images.com/XuSbga7BNBhILz87EMvJVg__original/img/G4XriAKi2EC00gw9SImPC-P4JHY=/0x0/filters:format(jpeg)/pic74086.jpg"},{"bggId":"309315","name":"Camping Life","description":"In Camping Life you are building a Camping spot for everyone to enjoy.&#10;This auction game is different from others, each round you are trying to get the best cards to make the most beautiful camping. But be careful, not every card is a gift, try to score extra points with different missions in each game.&#10;&#10;You start with 6 bidding coins every round, but you can only use 3 of them, the 3 other coins will be set aside to win extra cards.&#10;&#10;The player with the highest score at the end of the game is the winner !!!&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":15,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Bluffing","Card Game","City Building","Print & Play","Puzzle","Auction/Bidding","Tile Placement"],"rating":3.57674,"complexity":1.8571,"urlThumb":"https://cf.geekdo-images.com/My-L5Mx-AIOJc4ZTugofOw__thumb/img/prfJF0omieymJaM2mtBmhqqM2Ks=/fit-in/200x150/filters:strip_icc()/pic6870838.png","urlImage":"https://cf.geekdo-images.com/My-L5Mx-AIOJc4ZTugofOw__original/img/1Un7p9DX_pOGh7jRMWolB0sq2fo=/0x0/filters:format(png)/pic6870838.png"},{"bggId":"38062","name":"Privacy 2","description":"Privacy 2 is the sequel of Privacy. 90 new Questions will bring new incredible truths about your friends. And you won't believe your ears again!&#10;&#10;","minPlayers":5,"maxPlayers":12,"minPlayTime":45,"maxPlayTime":45,"minAge":16,"categoriesAndMechanics":["Mature / Adult","Party Game"],"rating":3.153035,"complexity":1.25,"urlThumb":"https://cf.geekdo-images.com/Xf-zsYcHP2C8yiPlpTyZJA__thumb/img/BoqlwYTGezkXGiCB73o_ECPzxRg=/fit-in/200x150/filters:strip_icc()/pic1331904.jpg","urlImage":"https://cf.geekdo-images.com/Xf-zsYcHP2C8yiPlpTyZJA__original/img/P_nejQgcexrab7O-LpiX-Y3sJ5s=/0x0/filters:format(jpeg)/pic1331904.jpg"},{"bggId":"5607","name":"Battle of the Bulge","description":"The Avalon Hill Game Co Battle of the Bulge board war-game. This is the third version of this famous game published by The Avalon Hill Game Co in 1991 (others were produced in 1965 and 1981). It is authorised by the Smithsonian Institution.&#10; Contents:&#10;&#10;    Battle Manual&#10;    Two-sided sheet covering the &quot;Basic Game Rules&quot;&#10;    2 separate sheets outlining the German and Allied &quot;Order of Appearance&quot; details for each side's forces &#10;    Full-colour gameboard&#10;    2 decimal dice&#10;    194 die-cut counters (202 if you count the 8 blank counters).&#10;&#10;&#10;This game is rated &quot;Low&quot; complexity by AH, and is an excellent introduction to hex-based wargaming for beginners. It also rates a &quot;High&quot; solitaire suitability rating.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":120,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Wargame","World War II","Hexagon Grid"],"rating":3.111945,"complexity":2.2895,"urlThumb":"https://cf.geekdo-images.com/a8vewbI-Lj5I0w06YlYLxw__thumb/img/hCwkGen6nEABgrHpAV84Bw6BYOA=/fit-in/200x150/filters:strip_icc()/pic456367.jpg","urlImage":"https://cf.geekdo-images.com/a8vewbI-Lj5I0w06YlYLxw__original/img/pbWWN-250YN5U8eMuGi6VZvGnjg=/0x0/filters:format(jpeg)/pic456367.jpg"},{"bggId":"293112","name":"White Eagle Defiant: Poland 1939","description":"White Eagle Defiant, the follow-up game to the bestselling Brave Little Belgium, recreates the German, Slovak and Soviet invasion of Poland in September and October 1939 that marked the beginning of the Second World War.  Germany and its Slovakian ally began the invasion on September 1, 1939; the Soviet Union followed suit on the 17th.  Known in Poland as the September Campaign and in Germany by the codename Fall Weiss (Case White), the campaign ended on October 6, 1939 with Germany and the Soviet Union splitting the country in two.&#10;  &#10;In White Eagle Defiant, one player controls the Germans, Slovaks and Soviets (simplified as the Germans in the game) while the other player commands the Poles.  The German objective is to gain control of Warsaw and other designated Victory cities while preventing Polish forces from destroying their forts in East Prussia and recapturing Victory cities.  If the German player does so in less time than the historical campaign, they win the game.  Anything less is a draw or a win for the Polish player.&#10;&#10;This quick-playing wargame employs very similar mechanics as Brave Little Belgium, but with a modest increase in complexity. The game uses a point-to-point map and a chit pull mechanism to simulate the campaign, with each turn representing four days. Random event chits are included to add variety and excitement to the game, reflecting the weapons (such as armored trains and aerial bombardment) used at the beginning of World War II.  The combat system, while still simple, is enhanced to better simulate mechanized warfare, as well as the use of combined forces (players can bring forces from adjacent spaces into an attack, creating primary and secondary combat groups).&#10;&#10;Other new features in White Eagle Defiant include Panzers for the Germans (which can roll two dice instead of one) and cavalry for the Poles (which can roll a &ldquo;first shot&rdquo; at the beginning of a combat round). A Victory Point track allows for variable entry of Soviet forces (depending on the success of the German player in capturing Victory cities), as well as the possibility of the Allies launching an attack in the West (if the German player fails to do well in capturing Victory cities). Finally, a &ldquo;blitzkrieg breakdown&rdquo; track is used by the German player; if the turn ends before both German army group chits are pulled, the German player may elect to activate a group, but possibly suffer a &ldquo;breakdown&rdquo; while doing so &ndash; and if five such breakdowns occur, the German player automatically loses the game.&#10;&#10;Players who enjoyed Brave Little Belgium will find that White Eagle Defiant offers the same tense play for both sides, while presenting new challenges that reflect the dawn of the blitzkrieg era.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":90,"minAge":0,"categoriesAndMechanics":["Wargame","World War II","Chit-Pull System","Dice Rolling","Point to Point Movement","Simulation"],"rating":3.785825,"complexity":1.9,"urlThumb":"https://cf.geekdo-images.com/YNmIqL0KsV0svt-bfmsIag__thumb/img/mmxlTW0cx9RS9j73Y1Ol4nY8MZ4=/fit-in/200x150/filters:strip_icc()/pic5034882.jpg","urlImage":"https://cf.geekdo-images.com/YNmIqL0KsV0svt-bfmsIag__original/img/P5Hm3eZdxbJmaN1Ia17NokD1JGI=/0x0/filters:format(jpeg)/pic5034882.jpg"},{"bggId":"324957","name":"The Snallygaster Situation: Kids on Bikes Board Game","description":"Something is very wrong in Lakeview. You know it, but nobody believes you, especially not the &quot;adults&quot; who dismiss you for being a kid. You've lived here your whole life, but it was only a little while ago that you started to notice the strange sounds at night, and now the new kid at school has vanished. You're sure that a hideous creature has been unleashed on your town &mdash; and it's up to you to defeat it!&#10;&#10;In the co-operative game The Snallygaster Situation, which is based on the Kids on Bikes RPG, you and your best friends must face off against one of four diabolical monsters set on destroying Lakeview &mdash; and possibly the entire world! Get on your bikes to search for clues about the monster's weakness, find the missing kid it has abducted, and end the threat to your hometown. Oh, and watch out for the Federal agents because they can put a real damper on your epic adventure.&#10;&#10;In more detail, one player takes the role of the Lost Kid, selecting a card to play each turn that provides clues about their location such as street names, buildings, or landmarks &mdash; but the card also dictates how the monsters and the Feds move and attack on the board. You might have the perfect clue to give, but then the monster will attack one of your friends, sending them back to the treehouse and advancing the &quot;doom marker&quot;, i.e., the game's timer.&#10;&#10;The other players are trying to defeat the monster and save their friend. On their turns, they use their rides &mdash; skateboard, dirt bike, inline skates, etc. &mdash; to search the town, look for clues, use special item cards, and avoid the monster, which might be the Jersey Devil, a Dover Demon, Bloody Mary, or (of course) the Snallygaster. Each monster has a different level of difficulty with unique gameplay elements.&#10;&#10;Once the Lost Kid is found, they join their friends to try to defeat the monster.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":45,"maxPlayTime":60,"minAge":8,"categoriesAndMechanics":["Deduction","Horror","Murder/Mystery","Cooperative Game","Deduction","Hidden Movement","Team-Based Game"],"rating":3.410025,"complexity":2.5,"urlThumb":"https://cf.geekdo-images.com/mWkDVQkAShMdybRiUfJnrQ__thumb/img/DmpH0Bf7tGb6_vDo8vPEeq2Am60=/fit-in/200x150/filters:strip_icc()/pic5808266.jpg","urlImage":"https://cf.geekdo-images.com/mWkDVQkAShMdybRiUfJnrQ__original/img/GtmCEDKUWQV5hpG45r6xbUlZc-s=/0x0/filters:format(jpeg)/pic5808266.jpg"},{"bggId":"2920","name":"Highway to the Kremlin: Napoleon's March on Moscow","description":"Napoleon's march on Moscow, 1812.  Covers June 24 - December 13, 1812.  Many scenarios plus full campaign game.  Two 22 x 34&quot; map sheets, 280 double sided counters, rules book and excellent study folder come in a book case sized box.&#10;&#10;GAME SYSTEM: CAMPAIGNS System (Series 5 X) = 16,000 m/hex (16 km/hex), 5,000 men/SP, 5 days/turn.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":180,"maxPlayTime":180,"minAge":12,"categoriesAndMechanics":["Napoleonic","Wargame","Action Points","Hexagon Grid"],"rating":3.821385,"complexity":3.375,"urlThumb":"https://cf.geekdo-images.com/bKivGnCPn6n3rTGaMh9-Mw__thumb/img/fGHMAzyF3yLJfKeEimDGvhkJzuc=/fit-in/200x150/filters:strip_icc()/pic7692.jpg","urlImage":"https://cf.geekdo-images.com/bKivGnCPn6n3rTGaMh9-Mw__original/img/7VcJYndQUEyZbZdOJsWkOBgQRlA=/0x0/filters:format(jpeg)/pic7692.jpg"},{"bggId":"344401","name":"Warhammer 40,000: Fireteam","description":"Responding to an urgent distress call, Squad Gideon has made planetfall in the distant Bakhar Sector. The worst fears of these five Assault Intercessors of the legendary Ultramarines Chapter are rapidly confirmed: the planet, Zanzamon, is an ancient tomb world belonging to Necrons of the infamous Szarkhan Dynasty &ndash; and its malevolent denizens are rapidly beginning to stir.&#10;&#10;Now, behind enemy lines and without backup, Sergeant Gideon and his men must fight their way through the hordes of awakening Necron Warriors who stand in their way, and put a stop to the Szarkhans' nefarious plans.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":45,"maxPlayTime":45,"minAge":12,"categoriesAndMechanics":["Fighting","Science Fiction","Dice Rolling","Grid Movement","Hexagon Grid"],"rating":3.97794,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/PdzHAfHlK_-AqqnUj3yBIw__thumb/img/ZtSXLAE8NFCHbNI3Sv5ZtgIo5mk=/fit-in/200x150/filters:strip_icc()/pic6330902.jpg","urlImage":"https://cf.geekdo-images.com/PdzHAfHlK_-AqqnUj3yBIw__original/img/peU6rAtVj5vY3FThX6qOAEPs7m0=/0x0/filters:format(jpeg)/pic6330902.jpg"},{"bggId":"274563","name":"Ghostbusters: Blackout","description":"After a major power outage struck New York, the Ghostbusters must set out to capture all the ghost escaping from their containment unit. With the whole city suffering from a blackout and an onslaught of ghost rampaging around, it&rsquo;s up to the Ghostbusters to quell the chaos and get those ghosts busted! Ghostbusters: Blackout is a fully co-operative board game for 2-4 players. In it, players roll dice and allocate them to move around the city, capture ghosts, and buy upgrades for their ghost-busting tech, all while trying to keep the city from collapsing from the ensuing chaos!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":45,"minAge":12,"categoriesAndMechanics":["Dice","Movies / TV / Radio theme","Cooperative Game"],"rating":3.64657,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/UzUd_p2n-d7SN1y1WXNv0A__thumb/img/GgCpJ6tKfc1Qa_LKUHP7CziPNiU=/fit-in/200x150/filters:strip_icc()/pic4655084.jpg","urlImage":"https://cf.geekdo-images.com/UzUd_p2n-d7SN1y1WXNv0A__original/img/w71AKOokxHPPxDLq2ZOXepm6gbo=/0x0/filters:format(jpeg)/pic4655084.jpg"},{"bggId":"2881","name":"Panzer Grenadier","description":"Panzer Grenadier: The East Front is the first volume in a game series devoted to simulating combined arms platoon level combat in World War II.  Set on the Eastern Front and starting with June 22nd, 1941, this game covers platoon actions during the first few months of the German invasion of Soviet Russia.&#10;&#10;The game is of moderate complexity with good solitaire suitability. Rules emphasize Opportunity and Combined Fire (plus friendly fire), Mobile Assault, Leadership, Morale, and Spotting. Special rules for Digging In, Entrenchments, Hidden Units, Minefields, and Bunkers. Special unit types include Headquarters, Aircraft, Armored Trains, Cavalry, and River Vessels. There are optional rules for Consolidation, Excess Initiative, Random Events, and Strategic Movement.&#10;&#10;Units represent the various mechanized (3-5 tracked vehicles), motorized &amp; towed (3-5 trucks,16-28 men, and 2-4 weapons), foot platoons (15-40 men), and individual field commanders (Corporal to Lt. Colonel) that were on the Eastern Front. A wide variety of MG, Heavy weapons, AT, AA, and other combat units are represented.&#10;&#10;Game scale:&#10;hex scale = 200 meters per hex side to side &#10;time = 15 minutes per game turn &#10;strength = platoon sized units&#10;&#10;Two six-sided dice are needed to play.&#10;&#10;It's an exciting, fast-paced, WWII tactical game with many different type of units, and it requires a solid strategy to win. Easy to understand realistic game mechanics make it a pleasure to play.&#10;&#10;The counters and mounted geomorphic boards are splendid.&#10;&#10;Re-implemented by:&#10;&#10;    Eastern Front: A Panzer Grenadier Game&#10;&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Wargame","World War II","Dice Rolling","Hexagon Grid","Line of Sight","Secret Unit Deployment","Simulation"],"rating":3.113745,"complexity":2.9744,"urlThumb":"https://cf.geekdo-images.com/rDzC23SHCM6XSW3aW2EIgw__thumb/img/jx3RA-7h93iwlloK-PcfKBT23KU=/fit-in/200x150/filters:strip_icc()/pic437107.jpg","urlImage":"https://cf.geekdo-images.com/rDzC23SHCM6XSW3aW2EIgw__original/img/XlxbS6eu9eNRjRoy8THfttYkNx8=/0x0/filters:format(jpeg)/pic437107.jpg"},{"bggId":"367584","name":"7th Sea: City of Five Sails","description":"7th Sea: City of Five Sails&nbsp;is an expandable card game set in the swashbuckling world of the&nbsp;7th Sea&nbsp;roleplaying game by John and Jennifer Wick. Players control one of five factions as they fight to influence, control, and explore the independent and unruly city of Five Sails. It is typically played with two players, but multiplayer variants will&nbsp;allow more players to get into the game.&nbsp;&#10;&#10;During the game, each player represents a leader who, along with their allies, explore locations and fight both with swords and with wits for overall influence over the city. Along with each player&rsquo;s individual deck,&nbsp;7th Sea: City of Five Sails&nbsp;also includes an element of randomness in the form of a separate, shared deck that represents the city itself with unusual characters, items, and events that change the &nbsp;focus of the game. Combat is resolved in a unique &ldquo;back and forth&rdquo; style reminiscent of challenging&nbsp;swordplay.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":80,"minAge":12,"categoriesAndMechanics":["Card Game","Fantasy","Pirates","Action/Event","Area Majority / Influence","Deck Construction","Hand Management","Push Your Luck","Stat Check Resolution","Variable Player Powers","Victory Points as a Resource"],"rating":4.39643,"complexity":3.4,"urlThumb":"https://cf.geekdo-images.com/fBJ8H7NlxmvO8NR7tvUATw__thumb/img/j4tqgAJOC3eTLDMWSMahzGpvGgU=/fit-in/200x150/filters:strip_icc()/pic6977133.jpg","urlImage":"https://cf.geekdo-images.com/fBJ8H7NlxmvO8NR7tvUATw__original/img/tUVWD7fNJMs9UpAKXssramaZ-mc=/0x0/filters:format(jpeg)/pic6977133.jpg"},{"bggId":"1373","name":"Midway","description":"Very Similar to Guadalcanal.&#10;&#10;The basic idea is each player has their own map of the area (in this case the Midway Island) behind a screen.  Each player &quot;searches&quot; for the enemy fleet by flying search planes to the hex and calling the hex number.  Once found, bombers can be sent in to sink the enemy fleet.  The actual attack is fought on a separate battle board where the ships are first placed on hexes and the attacking planes are placed in hexes to indicate which ship it is attacking.&#10;&#10;The basic game is very simple.  But there are many additional rules which add realism (and complexity):  CAP fighters, surface actions, bases, inaccurate search reports, etc.&#10;&#10;The game is superior with a neutral referee for true double blind play.&#10;&#10;204 counters (5 of them are blanks)&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":90,"maxPlayTime":240,"minAge":12,"categoriesAndMechanics":["Nautical","Wargame","World War II","Hexagon Grid","Secret Unit Deployment"],"rating":3.220355,"complexity":2.3333,"urlThumb":"https://cf.geekdo-images.com/cDX4-8F3F74RuDFrqvqYdg__thumb/img/VXiBJ0XElTx03t4f8xS-izPTM1Y=/fit-in/200x150/filters:strip_icc()/pic580069.jpg","urlImage":"https://cf.geekdo-images.com/cDX4-8F3F74RuDFrqvqYdg__original/img/8U3Qatypc4JSdYd0SS1_XNFCJ4Y=/0x0/filters:format(jpeg)/pic580069.jpg"},{"bggId":"338896","name":"Quest Calendar: The Gates of Terralon","description":"An rpg built into a desktop calendar. Choose one of 6 heroes. Go on a campaign that lasts throughout the year with a single event happening each day. Chose how you want to take on the daily challenge. Roll classic rpg dice (7 polyhedral dice) and add your hero's abilities to fight the monster, open the chest, get past guards, etc.&#10;&#10;&mdash;description from the designer&#10;&#10;Years of war and turmoil caused the Gods to separate their worlds from one another, but this did not stop the fighting. The demon's were dealt a devastating blow when their gate was destroyed. The consequences were unexpected. Now, demons pour forth and spill into other worlds, wrecking havoc across existence.&#10;&#10;Elsewhere in Terralon, the King's Festival approaches. Many come from afar to compete in the yearly tournament. The title of Lord, and the riches and land which accompany said title, can be won in this competition. Even the poorest commoners has a chance at glory.&#10;&#10;Will you compete in the tournament at the King's Festival and earn the title of Lord? Can you stop the demon invasion and prevent the collapse of all worlds? Enjoy as the story unfolds in this adventure-a-day desktop calendar.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":1,"maxPlayTime":3,"minAge":8,"categoriesAndMechanics":["Book","Dice","Fantasy","Print & Play","Dice Rolling","Narrative Choice / Paragraph","Role Playing","Solo / Solitaire Game","Storytelling"],"rating":3.706555,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/mW7Eb_pBIHPYQ_CfLajydA__thumb/img/5yQeKQwmy93TPxTq5eWnth2EdSM=/fit-in/200x150/filters:strip_icc()/pic6177926.jpg","urlImage":"https://cf.geekdo-images.com/mW7Eb_pBIHPYQ_CfLajydA__original/img/9bdbRKbdX5algPTVZxDLKTfv_uM=/0x0/filters:format(jpeg)/pic6177926.jpg"},{"bggId":"1558","name":"Rogue Trooper","description":"You are the Rogue Trooper, a Genetic Infantryman - one of the last survivors of the infamous Quartz Zone Massacre. Now, you and your friends search the face of Nu-Earth, a battle ravaged Hell-World, for the Traitor who destroyed the GIs. Ahead of you are hostile Nort forces and many other dangers, but also companions, equipment and much-needed information on the identity and whereabouts of the Traitor. But hurry, as once he is unmasked, there will be a deadly chase through Nu-Earth and Milli-Com until he is killed.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":120,"maxPlayTime":180,"minAge":12,"categoriesAndMechanics":["Adventure","Comic Book / Strip","Fighting","Science Fiction","Dice Rolling","Hexagon Grid","Scenario / Mission / Campaign Game"],"rating":3.04763,"complexity":2.2188,"urlThumb":"https://cf.geekdo-images.com/P6crqiy0w6uMPW3Tv13flA__thumb/img/5Y5riIJP4fT82QSTjMJN0B1Jjw0=/fit-in/200x150/filters:strip_icc()/pic429183.jpg","urlImage":"https://cf.geekdo-images.com/P6crqiy0w6uMPW3Tv13flA__original/img/rkeshPBA7YjRBRXhm7o-y5vCBCw=/0x0/filters:format(jpeg)/pic429183.jpg"},{"bggId":"194986","name":"Deep Future","description":"Humanity has inherited the stars, but humanity being what it is, the stars forever slip from its grasp. Even the First Sovereignty, which scattered humanity to a million worlds, has collapsed, consigned to oblivion. No one remembers what brought it about, whether a withering apathy, rebellions across its repressed worlds, or the impenetrable whims of the enigmatic, inhuman Xeno. Yet humanity is tenacious. There are always more fledgling civilizations ready to rise to the heights of power and culture, invent new technologies, and usher in a new millennium.&#10;&#10;Deep Future is a card-driven board game for 1-3 players of empire and innovation spanning the rise and fall of the countless worlds of the galaxy. You will settle on planets, expand your influence across sectors, invent new technologies and rediscover old ones, and face challenges that threaten to tear your civilization apart as you try to achieve one of several paths to victory.&#10;&#10;Deep Future is a &ldquo;Make-as-You-Play&rdquo; game, which means that the game starts with a few materials (a map, paper, index cards, and colored cubes) and the remaining components will be generated as needed during play. Each game will see the addition of new cards, which represent the worlds in the galaxy, the techs invented, and the lasting impact of previous civilizations.&#10;&#10;The rules include tables and guidelines for creating new cards as needed, and this makes every copy of Deep Future an evolving galaxy. In addition, it means that each game inherits all components added or changed in the previous games. The galaxy&rsquo;s content &mdash; its worlds, techs, and history &mdash; can grow endlessly over a connected campaign as players return to see what each new era holds for the future of humanity.&#10;&#10;","minPlayers":1,"maxPlayers":3,"minPlayTime":30,"maxPlayTime":90,"minAge":0,"categoriesAndMechanics":["Civilization","Print & Play","Science Fiction","Hand Management","Hexagon Grid","Legacy Game","Paper-and-Pencil","Solo / Solitaire Game"],"rating":3.934755,"complexity":3.1818,"urlThumb":"https://cf.geekdo-images.com/C3MD3W6YroQL8ZthhxdAfQ__thumb/img/oH2yjSlJJUOID5Bk5H8eoBFTld8=/fit-in/200x150/filters:strip_icc()/pic2988005.png","urlImage":"https://cf.geekdo-images.com/C3MD3W6YroQL8ZthhxdAfQ__original/img/wbaBkuKTS2HHv1toOAqgjwbzm60=/0x0/filters:format(png)/pic2988005.png"},{"bggId":"160950","name":"The Badger Deck","description":"The Badger Deck is an expanded deck of playing cards suitable for prototyping new games or for playing a whole range of already available (but possibly out of print) games. With the four standard suits it is an 88-card deck; with 10 suits it is 220 cards.&#10;&#10;The basic deck consists of the standard set of suits (hearts, clubs, diamonds and spades) with an additional six suits: pyramids, moons, stars, flowers, coins, bats. All suits have the ranks Ace (A), numbers 0-10, the traditional ranks Jack (J), Queen (Q), King (K) as well as additional ranks Fool (F), Wizard (W), Sorceress (S), Hero (H), Princess (P), Castle (C), Mythical creature/Monster (M).&#10;&#10;","minPlayers":0,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Card Game","Game System"],"rating":4.25769,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/wJuA5jm2MBII4x8cLAGDuQ__thumb/img/DP0vkJKAWmOh-93C2eJYH8ei90U=/fit-in/200x150/filters:strip_icc()/pic2051483.jpg","urlImage":"https://cf.geekdo-images.com/wJuA5jm2MBII4x8cLAGDuQ__original/img/FOv6FbYc9ffYxGeeyZlrpRD_OZ8=/0x0/filters:format(jpeg)/pic2051483.jpg"},{"bggId":"5516","name":"Symbioz","description":"On a far distant planet three life-forms vie for dominance: the carnivorous Kroguls; the herbivorous Grabits and the vegetable Zherbes. Players try to expand their populations of these, at the expense of their rivals naturally .&#10;&#10;The ultimate goal is to to achieve an exclusively plant population in any three of the 24 concentrically symmetrical areas into which the board is divided.  The system is entirely luck-free.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":180,"maxPlayTime":180,"minAge":14,"categoriesAndMechanics":["Animals","Science Fiction","Action Points","Area Movement"],"rating":3.46738,"complexity":2.8333,"urlThumb":"https://cf.geekdo-images.com/5a4YM7GSSjooabXz3lVqMw__thumb/img/xt1RmmKFVfgXfPvmVcA93EnCACc=/fit-in/200x150/filters:strip_icc()/pic117613.jpg","urlImage":"https://cf.geekdo-images.com/5a4YM7GSSjooabXz3lVqMw__original/img/AgG3DSPES6YiK7HH7BNuR3eFk4I=/0x0/filters:format(jpeg)/pic117613.jpg"},{"bggId":"104736","name":"Et Toque!","description":"Time to see what kind of chef you could be, so don your toque and get to the kitchen!&#10;&#10;Each round in Et Toque!, players receive an erasable magnetic board, a marker and a dozen magnetic tiles, each showing a random ingredient. Then they secretly receive a menu theme card showing the dinner for which they must prepare: a feast for vampires, dinner in the savannah, a meal for hippies...&#10;&#10;They must use at least four of their tiles to create a meal plan, which can consist of any number of dishes. With the marker they can add connecting words to embellish their dishes, but they cannot write nouns or adjectives. Use the ingredients given to you!&#10;&#10;Once all players have composed their menus, the theme cards are collected, shuffled, then laid out on the table. All players reveal their menus, then everyone votes on which menu corresponds with which theme. Bon app&eacute;tit!&#10;&#10;","minPlayers":3,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Party Game","Voting"],"rating":3.47358,"complexity":1.5,"urlThumb":"https://cf.geekdo-images.com/bQR6aSDBoR_6HMc5XGw60Q__thumb/img/YcuUjuOOcnSzkYmIzfO0r06L6dg=/fit-in/200x150/filters:strip_icc()/pic1064630.jpg","urlImage":"https://cf.geekdo-images.com/bQR6aSDBoR_6HMc5XGw60Q__original/img/JBrMD9Uzqor-2pPz03rhUl-c2ik=/0x0/filters:format(jpeg)/pic1064630.jpg"},{"bggId":"16197","name":"Rivoli 1797","description":"The Battle of Rivoli on January 14th, 1797 between the French Arm&eacute;e d&acute;Italie under the young Napoleon Bonaparte and the Austrian &quot;Armee in Italien&quot; under Feldzeugmeister Baron Alvinczy.&#10;The game is one part of SimTac&acute;s series Battles of the Revolution and the Empire on battalion/ regimental level and contains 648 die cut counter, 1 38&quot; x 27&quot; game map, 3 rulebooks, Aid Charts and Tables, 2 ten sided dice&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":240,"maxPlayTime":240,"minAge":13,"categoriesAndMechanics":["Napoleonic","Wargame","Hexagon Grid","Simulation"],"rating":4.067425,"complexity":3.4,"urlThumb":"https://cf.geekdo-images.com/yi7-kClgrIlYY1zDrkeg-g__thumb/img/37_EH03wlJrU2N3tgysEB0z46aE=/fit-in/200x150/filters:strip_icc()/pic67750.jpg","urlImage":"https://cf.geekdo-images.com/yi7-kClgrIlYY1zDrkeg-g__original/img/G22XNSzvgWbNMntfWgIpAbTH9Rw=/0x0/filters:format(jpeg)/pic67750.jpg"},{"bggId":"4363","name":"Seven Pines","description":"Seven Pines - The Battles of Seven Pines, May 31-June 1, 1862, and Savage Station, June 26-29, 1862. This is the twelfth game in the Civil War Brigade (CWB) Series from The Gamers.  It covers the the battles of Seven Pines (May 31st - June 1st, 1862) and Savage Station (June 29th, 1862).&#10;&#10;The Seven Pines scenarios recreate the two days&rsquo; battle of Seven Pines, (or Fair Oaks) on May 31st and June 1st, 1862. This battle was the prelude to the full Seven Days&rsquo; battles a month later. These rules address the battle of Seven Pines. As such, this is complete unto itself, Gaines Mill is not needed to play these scenarios as it is to play the companion game Savage Station. Seven Day's campaign: part one is Gaines Mill: The Battles of the Seven Days, June 1962, Volume 1, part two Seven Pines and part three Malvern Hill: The Battles of the Seven Days, Volume III. All three games can be connected to recreate the entire campaign.&#10;&#10;Game Scale:&#10;Game Turn: 30 minutes&#10;Hex: 200 yards&#10;Units: Brigades&#10;&#10;Solitaire Playability: High&#10;Complexity Level: Medium&#10;Players: 2 or more&#10;Playing Time: 2-30 hours&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":240,"maxPlayTime":240,"minAge":12,"categoriesAndMechanics":["American Civil War","Wargame","Hexagon Grid"],"rating":3.7625,"complexity":3.2857,"urlThumb":"https://cf.geekdo-images.com/r_PAD4ioa0W7gynXuWCVwg__thumb/img/H8HJ0UdrswqDINqW35ml5jCMKuc=/fit-in/200x150/filters:strip_icc()/pic434686.jpg","urlImage":"https://cf.geekdo-images.com/r_PAD4ioa0W7gynXuWCVwg__original/img/8PqoBjSrWw4T5FmIJz5V5Hy5p8c=/0x0/filters:format(jpeg)/pic434686.jpg"},{"bggId":"373284","name":"Crack List","description":"Town-country-river game meets Uno.&#10;&#10;Players race to empty their hands. In turns, players attempt to play a card by giving a word starting with the letter on one of their hand cards matching the Crack List category.&#10;&#10;The most difficult letters include some &quot;take that&quot; cards, and multiple Crack List cards are used during a single game, changing the categories of words to guess.&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":20,"maxPlayTime":40,"minAge":14,"categoriesAndMechanics":["Card Game","Party Game","Trivia","Word Game","Hand Management","Lose a Turn","Take That"],"rating":3.31121,"complexity":1.3333,"urlThumb":"https://cf.geekdo-images.com/4WwApFepitDhGqSNi0tdDA__thumb/img/8PEZ-y7nK1EjeTQ1uHYP9se1yI4=/fit-in/200x150/filters:strip_icc()/pic7139377.jpg","urlImage":"https://cf.geekdo-images.com/4WwApFepitDhGqSNi0tdDA__original/img/KsVpN-qXgl2B2nDNImJGVaijt9o=/0x0/filters:format(jpeg)/pic7139377.jpg"},{"bggId":"9803","name":"Operation Michael","description":"Sub-titled: 'Ludendorff's Last Chance' &amp; Part of the Standard Combat Series #9, this game covers the March 21, 1918 offensive by the Germans in order to regain the initiative on the Western Front before the might of the U.S. forces will be felt.&#10;&#10;The components consist of the following: a Full COLOR paper Mapsheet; 420-Full COLOR cardboard counters in 2 sheets; 10- Scenarios; a 'Series' RULES Book; a Scenario Book; and 2-DICE. The game scale is given as: 1.2 miles across per HEX; Units are Regiments up to Divisions. Complexity is rated 'Low' while Solitaire suitability is rated 'High'.&#10;&#10;This is a game on the Ludendorff 'Peace Offensive' in an attempt to work the German forces between the British and French Armies. If the Germans can pull it off, then they'll force the French to fall back to defend Paris while entrapping the British against the coast, thereby forcing them to surrender. Using the tactics of the successful 'Russian' Front forces, developed by General Oskar von Hutier, the 'Stosstruppen' head off to engage the enemy while the Allies amass their 'Tank' forces for a counter-attack.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":180,"maxPlayTime":180,"minAge":12,"categoriesAndMechanics":["Wargame","World War I","Dice Rolling","Hexagon Grid","Movement Points","Ratio / Combat Results Table"],"rating":3.45374,"complexity":2.6667,"urlThumb":"https://cf.geekdo-images.com/ZyV0K-4h07mk8HMyWK-Tgg__thumb/img/PstODuDl3chiXc0B9aXBes8zH3Y=/fit-in/200x150/filters:strip_icc()/pic76895.jpg","urlImage":"https://cf.geekdo-images.com/ZyV0K-4h07mk8HMyWK-Tgg__original/img/GuoqcsLqWPlopNVvmk4x6iY0wCk=/0x0/filters:format(jpeg)/pic76895.jpg"},{"bggId":"5940","name":"Bug Hunter Sniper!","description":"&quot;Bug Hunter Sniper!&quot; is a Sniper! series wargame about hypothetical clashes between spacefaring human adventurers and hostile alien monsters.&#10;&#10;As in all games in the Sniper! series, this wargame focuses on combat as experienced by the individual soldier.  This game examines the problems and situations peculiar to close combat in strange environments and against unknown foes.&#10;&#10;Multiple geomorphic 2-sided maps are included in the game to play out numerous scenarios (for 1 to 3 players), each with their own set of victory conditions.  The game also includes rules to Sniper!, exclusive &quot;Bug Hunter Sniper!&quot; rules, scenario booklet, random event cards, cut out vehicles, and 400 personnel counters and markers.  It is a stand-alone game that does not require the original Sniper!.&#10;&#10;","minPlayers":2,"maxPlayers":3,"minPlayTime":90,"maxPlayTime":90,"minAge":12,"categoriesAndMechanics":["Science Fiction","Wargame","Dice Rolling","Events","Grid Movement","Hexagon Grid","Line of Sight","Modular Board","Movement Points","Ratio / Combat Results Table","Scenario / Mission / Campaign Game"],"rating":3.49307,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/LXZo1MvFauAOKcFqPoWzHg__thumb/img/5XuKYmaKG7ok_hB6ut-vPR2B2UY=/fit-in/200x150/filters:strip_icc()/pic691439.jpg","urlImage":"https://cf.geekdo-images.com/LXZo1MvFauAOKcFqPoWzHg__original/img/FnyJ2Qsu3kzORLm7neyku2hIWFc=/0x0/filters:format(jpeg)/pic691439.jpg"},{"bggId":"196698","name":"Gruff: Clash of the Battle Goats","description":"Clash is a tactical card game of brutal goat combat. The game can be learned in just a few minutes but has a tremendous amount of depth. The box contains enough content for 2 players to immediately play out of the same box, or you can combine Clash with our previous game Gruff to unlock nearly limitless deck-building options and multiplayer modes.&#10;&#10;In Clash you take the role of a shepherd with a custom team of Battle Goats (called gruffs). In gameplay terms you will choose a Shepherd card (Which represents your health and other stats) and 3 Goat cards. In Shuffle-building style each of the goat cards also comes with a goat deck. Pick 8 cards per goat to create your deck of 24.&#10;&#10;Players take turns activating goats, playing cards then launching attacks at your opponent. However, when a gruff attacks it does not deal damage until the beginning of your next turn allowing your opponent a turn to dodge, deflect, or counterattack!&#10;&#10;A Player wins when they can break through the enemy line of defenses and kill the enemy shepherd, or if you successfully kill all 3 enemy gruffs.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":45,"minAge":11,"categoriesAndMechanics":["Card Game","Fantasy","Fighting","Campaign / Battle Card Driven","Variable Player Powers"],"rating":3.64865,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/NXEilFtVJyz-ncybe3ai5Q__thumb/img/_r_U7NiW32M_RIJkfs11VU7Kv34=/fit-in/200x150/filters:strip_icc()/pic2964540.png","urlImage":"https://cf.geekdo-images.com/NXEilFtVJyz-ncybe3ai5Q__original/img/_S7GOCfxgOptMUb_pCLgQKGDO4A=/0x0/filters:format(png)/pic2964540.png"},{"bggId":"101644","name":"Bushido","description":"From the Developer's Website:&#10;&#10;Bushido is an oriental fantasy tabletop miniature battle game for two players. Each player commands a force of no more than a handful of individuals, represented by 32mm metal miniatures. These forces meet on the battlefield and the commanders (the players, that is) try to outwit, outfight and outlive the opposing force and fulfil their battle objectives while denying the enemy theirs. If you have played tabletop miniature games before, Bushido falls into the &lsquo;skirmish game&rsquo; category: all miniatures represent individuals and your force consists of a small group of unique characters rather than a big faceless army. A game of Bushido is fast-moving, flexible and filled with strategizing, counter-strategizing and counter-counter-strategizing. Your tactical acumen is important, but as dice add an element of randomness, so too is your ability to think on your feet. A typical game of Bushido takes between one and two hours to play - more if you are new to the game, less if you are a seasoned veteran.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":90,"maxPlayTime":90,"minAge":0,"categoriesAndMechanics":["Fantasy","Fighting","Miniatures","Action Points","Dice Rolling","Variable Player Powers"],"rating":4.173335,"complexity":3.5556,"urlThumb":"https://cf.geekdo-images.com/gYyF9OtzaHfNy_rscQBhrw__thumb/img/l5dsiQVLR_6fqmGuAU0AWvWGJ74=/fit-in/200x150/filters:strip_icc()/pic1039745.jpg","urlImage":"https://cf.geekdo-images.com/gYyF9OtzaHfNy_rscQBhrw__original/img/PrZGbroRj3ygW7xRhwyNELl6jUg=/0x0/filters:format(jpeg)/pic1039745.jpg"},{"bggId":"28574","name":"Magiczny Miecz","description":"This board game was produced by Sfera after the license for producing the Polish version of Talisman was revoked after the publication of a Sfera original expansion for Magia i Miecz called Jaskinia or The Cave.&#10;&#10;It is very much like Talisman except that the board is &quot;inside-out&quot; in that you start in the middle of the board in a valley and work you way up to the mountains around the outside of the board. Instead of the Crown of Command you must battle your way through the Fortress of the Beast which is situated on a bridge which spans the board. Game's world is a bit more darker than heroic Talisman.&#10;&#10;The basic layout of cards etc is the same as in Talisman except that Strength is replaced with Might and Craft with Magic.&#10;&#10;A version of the game was later made without license by Phantom, a Russian firm.&#10;&#10;Sfera produced a second edition of the game, which changed the style of the cards, but kept the art. The board was recreated using photo art and new character art was used. Only the base game was produced.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":240,"maxPlayTime":240,"minAge":12,"categoriesAndMechanics":["Adventure","Exploration","Fantasy","Fighting","Dice Rolling","Role Playing","Roll / Spin and Move","Variable Player Powers"],"rating":3.142335,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/K1q2Fg0Dmlr0R8RjoaVsNw__thumb/img/7REBfdgujcMzPQtJ9maYsWwz4no=/fit-in/200x150/filters:strip_icc()/pic193607.jpg","urlImage":"https://cf.geekdo-images.com/K1q2Fg0Dmlr0R8RjoaVsNw__original/img/ht4uXpl1_xv19q7pfEMyGHSwxnQ=/0x0/filters:format(jpeg)/pic193607.jpg"},{"bggId":"19212","name":"Island Of D 2: The Shadow of Dawn","description":"&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;A FREE one-player Fantasy Adventure Card GameNo bookkeeping, NO DICE, just you and the cards and a token and an adventure !!&#10;&#10;15-30 minutes playing time&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;INTRODUCTIONOne year after the Black Knight's defeat ...&#10;&#10;The Village of Dawn is in grave danger. Not only two of the village's special items were stolen, but the great and wise Village Elder of Dawn has missing for months without a trace. Soon after, Goblins and Orcs have appeared and begun terrorizing the village, and even worse are the bandits, for it is said that their mysterious leader is invincible, he can heal his wounds in seconds!&#10;&#10;A brave local spy was able to return with vital yet horrifying information, that in two weeks the bandits will attack with full force to completely take over the Village Of Dawn! In these desperate hours the Guildmaster of Dawn had no choice but to send a messenger for help to the nearby village, Dew.  They suffered and they prayed&hellip;. and now in their most critical moment, YOU are their answer, the hero who saved the island by defeating the Black Knight a year before.&#10;&#10;By the time you arrive at the Village of Dawn, you have only 8 days left until the bandits invade. After gathering some information while eating breakfast with the Guildmaster, you start your adventure to save Dawn&hellip;.&#10;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#10;&#9;&#9;&#9;&#9;&#9;THE MISSIONFind the High Priest in the Temple and have him create a Dispel Potion, then find the Bandit Lair and defeat the mysterious Bandit Leader in his own turf, but you must hurry, time is running out !!!&#10;&#10;&#10;     Designer's home page with info and downloads&#10;&#10;&#10;Online Play&#10;&#10;     You can play The Island of D 2 on Battlegrounds: RPG Edition (aka BRPG) virtual tabletop software. Click here for details.&#10;     You can play The Island of D 2 on Battlegrounds Gaming Engine (aka BGE) virtual tabletop software. Click here for details.&#10;&#10;&#10;In Series With:&#10;&#10;    Island Of D&#10;&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Adventure","Card Game","Exploration","Fantasy","Print & Play","Hand Management","Modular Board"],"rating":3.29231,"complexity":1.7083,"urlThumb":"https://cf.geekdo-images.com/llEZcvv0D_HU1zMs1_6D-A__thumb/img/2rjXJBJAmt31217wSxfeJ_v_L3o=/fit-in/200x150/filters:strip_icc()/pic389695.jpg","urlImage":"https://cf.geekdo-images.com/llEZcvv0D_HU1zMs1_6D-A__original/img/N0WZ3mT2CkjaSn7xBb-Trq4NbPc=/0x0/filters:format(jpeg)/pic389695.jpg"},{"bggId":"381827","name":"Pick a Pen: Tuinen","description":"Each turn in Pick a Pen: Tuinen, the active player rolls the five colored pencils, then chooses one and marks spaces on their individual player sheet. Each other player in turn drafts a pencil and uses it. Pencils show symbols on their different sides, and the symbols on top of the chosen pencil determine what players do on their sheets.&#10;&#10;Each sheet shows bordered gardens, and on a turn, you fill in the indicated number of spaces in that color; all of those spaces must be adjacent to one another, in addition to being adjacent to everything colored previously. Your goal is to fill gardens with only a single color or with five different colors, scoring bonus points as you do so. The game ends when a player has completely colored all of their gardens or failed to color in five times.&#10;&#10;Pick a Pen: Tuinen includes three difficulty levels of player sheets, with flowers and trees on sheets 2 and 3 to help you earn bonus points in different ways.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Farming","Puzzle","Drawing","Grid Coverage","Hexagon Grid","Paper-and-Pencil"],"rating":3.464425,"complexity":1.5,"urlThumb":"https://cf.geekdo-images.com/QSIAcqpzE-szkpPmciZudQ__thumb/img/J6vdK9yjHW5HnyiDgX4B5B5V-yc=/fit-in/200x150/filters:strip_icc()/pic7423191.jpg","urlImage":"https://cf.geekdo-images.com/QSIAcqpzE-szkpPmciZudQ__original/img/CsSSsUJEM7LARUDW0fU4r6E7Eq4=/0x0/filters:format(jpeg)/pic7423191.jpg"},{"bggId":"260264","name":"Glyph Chess","description":"Glyph Chess is a chessboard style game for 2 to 3 players, adapted from a Chinese comic book, Tales of Tarsylia. It is said that Glyph is the most popular game in the magical world and can only be played by the most powerful wizards. To win, players must maneuver their pieces to get their Scepter Piece to the center of the board, or eliminate all enemy players&rsquo; Scepters.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":60,"minAge":8,"categoriesAndMechanics":["Abstract Strategy","Comic Book / Strip","Dice","Fantasy","Fighting","Miniatures","Dice Rolling","Grid Movement"],"rating":3.85476,"complexity":2.6667,"urlThumb":"https://cf.geekdo-images.com/ml2qmudluj1r2-SCsMCGqg__thumb/img/XhE50qiSm13GeK3wmZU3la7YyX4=/fit-in/200x150/filters:strip_icc()/pic4397931.jpg","urlImage":"https://cf.geekdo-images.com/ml2qmudluj1r2-SCsMCGqg__original/img/5yjmTNLEVkTiy0lSgoOaC-cB98U=/0x0/filters:format(jpeg)/pic4397931.jpg"},{"bggId":"369384","name":"Blockits","description":"Blockits, first released as Juanito Blockits, is a roll-and-write game of managing blocks, both placing them in rows and using them to block others!&#10;&#10;Each player has an individual game board, and each round you place the figure rolled on the die in your game area, either to complete one or more lines or to maximize the number of blocked spaces. You also want to create specific figures to score more points, but the game boards rotate from one player to another, which might complicate your plans.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":20,"minAge":8,"categoriesAndMechanics":["Dice","Dice Rolling","Paper-and-Pencil","Pattern Building","Pattern Recognition"],"rating":3.928875,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/ZiBZYPAFzBXwHryJ-8wm4Q__thumb/img/sIrn8lwij0Jf6bxE-dOOc6AbhwM=/fit-in/200x150/filters:strip_icc()/pic7674100.jpg","urlImage":"https://cf.geekdo-images.com/ZiBZYPAFzBXwHryJ-8wm4Q__original/img/4OsR2bfGQRvb1J2FSZGhCzOYhYI=/0x0/filters:format(jpeg)/pic7674100.jpg"},{"bggId":"253149","name":"Wok Star (3rd Edition)","description":"Wok Star is a cooperative real-time game in which players take on different roles to help grow a Chinese restaurant in a tycoon style game. The clientele of customers is represented by a deck of cards with various Chinese dishes on them. Customers are served one at a time while a 30-second sand timer is running.&#10;&#10;Each order requires a combination of ingredients to make. The board is used for tracking the levels of ten prepared ingredients in the kitchen. To prepare more ingredients, players spend dice in different combinations. All players are in charge of different tasks and all must work simultaneously because the timer is running!&#10;&#10;At the end of each round, players pool their money and invest in different options to grow their business: acquire new recipes, upgrade preparation cards, or send out coupons to get more customers. The players must have a certain level of profit by the last round to keep the restaurant open and win!&#10;&#10;The third edition of Wok Star contains new gameplay wrinkles: You can re-roll dice by &quot;washing dishes&quot; and modify dice by using &quot;hustle&quot;. Fortune cubes limit how often you can share dice, and you now have daily goals that you must reach each round or else you lose immediately.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Real-time","Cooperative Game","Dice Rolling","Simultaneous Action Selection","Variable Player Powers"],"rating":3.173825,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/4SAjwkE-ncAgPEVPiPaCZQ__thumb/img/w4xEQFyExJpJaEUGXTNe_UJFI2Y=/fit-in/200x150/filters:strip_icc()/pic4126868.jpg","urlImage":"https://cf.geekdo-images.com/4SAjwkE-ncAgPEVPiPaCZQ__original/img/r5CAX84nl8Henh_RdpQq83VkaSE=/0x0/filters:format(jpeg)/pic4126868.jpg"},{"bggId":"461","name":"Freibeuter","description":"Freibeuter is a game of playing your boats in spaces allowed  by the cards you've drawn in hopes of being part of a capturing team of surrounding boats.   Sometimes you play the &quot;Flying Dutchman&quot; which can go more places but disappears as soon as the capture is made.  You also have the option of positioning to be the main deal-maker on a capture, which leaves you paying off all the surrounding boats but getting more money yourself on the deal at the end of the game.  Timing, of course, turns out to be a nice matter for judgment.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":45,"minAge":9,"categoriesAndMechanics":["Economic","Nautical","Pirates","Area Majority / Influence","Hand Management","Investment","Loans","Ownership","Variable Set-up"],"rating":3.149875,"complexity":1.8571,"urlThumb":"https://cf.geekdo-images.com/VgIWSSnw87kHdHVzPlHzhQ__thumb/img/2ADZ5hj9ugTxxQkuCYideI_Dmew=/fit-in/200x150/filters:strip_icc()/pic284697.jpg","urlImage":"https://cf.geekdo-images.com/VgIWSSnw87kHdHVzPlHzhQ__original/img/Va56TkjwujI6tsOKsQXlXZRmXP0=/0x0/filters:format(jpeg)/pic284697.jpg"},{"bggId":"177861","name":"Paths to Hell: Operation Barbarossa, June – December 1941","description":"Paths to Hell (PTH) (Volume III) is a stand-alone game in the War Storms series (WSS). Recreates the events of those days and allows the players to reproduce the most famous battles of the Blitzkrieg on the East Front at a tactical level. Players take command of either the Allied or Axis forces (or can play solitaire) in the tactical battles of each scenario.&#10;&#10;PTH while utilizing &quot;La Bataille de France, 1940&quot; base rules, incorporates new and adapted rules and additions for this new front. The WSS promises many hours of fierce fighting between the infantry, tanks, artillery and aircraft belonging to the armies enveloped in this conflict. Just a few of the additions include:&#10;&#10;&#10;    Human wave attacks&#10;    Battalion officers&#10;    Communist Commissars&#10;    Recon rules&#10;    Flamethrower tanks&#10;    Motorcycle recon&#10;    Waffen SS&#10;    Rumnanian&#10;    Gully&#10;    Rail Roads&#10;    One 8'5 x 11&quot; chart with many overlays&#10;&#10;&#10;PTH has a moderate complexity with good solitaire suitability. The system emphasizes the role of officers. Officers can activate units, coordinate with other officers and their units, call for artillery support, air support, smoke screens, influence moral checks, coordinate assaults, and much more. Rules for special actions.&#10;&#10;Based on the principle of simultaneous execution, or simply &quot;WE GO&quot;, a hybrid system of turns and &quot;real time&quot;. The players must activate unit leaders to perform many actions (fire, assault, move, coordinate, etc). A turn ends when both players have completed all their activations. The scale is platoon level with units &#10;representing groups of between 30 and 40 soldiers, weapons units represents groups of 3-4 weapons and their accompanying crews (20-25 soldiers), and the AFVs/Transports representing groups of 3 to 5 vehicles and their corresponding crews. Scenarios are divided into turns representing about 12-15 minutes of action.&#10;&#10;Turns are divided into the following phases: Command Phase, Initiative Phase, Activation Phase and Marker Removal Phase&#10;&#10;The game uses isomorphic mapboards, each of which can align to any edge of equal length on any other mapboard. This allows for an almost unlimited number of combinations to create any terrain situation, including player designed scenarios. Each map hex represents a distance of approximately 150 to 200 metres.&#10;&#10;Components&#10;&#10;    4 Isomorphic Maps&#10;    8 Overlays&#10;    5 sheets of Counters (3 of 5/8&rdquo; and 2 of 3/4&rdquo;)&#10;    1 Standard Rulebook&#10;    1 Exclusive Rulebook&#10;    7 Scenario Cards featuring 13 scenarios &#10;    3 Charts and Table Cards&#10;    2 Battalion Charts Cards&#10;    2 six-side dice&#10;&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Wargame","World War II","Dice Rolling","Hexagon Grid","Simulation"],"rating":4.03092,"complexity":3.4,"urlThumb":"https://cf.geekdo-images.com/_Db1YOEUTjbIHect_hWESQ__thumb/img/omynrF4SQyWztGl-Fj8FSbEIjqo=/fit-in/200x150/filters:strip_icc()/pic2524837.jpg","urlImage":"https://cf.geekdo-images.com/_Db1YOEUTjbIHect_hWESQ__original/img/5lTvpxm4S-CKakrCh91Xq8p5Q4s=/0x0/filters:format(jpeg)/pic2524837.jpg"},{"bggId":"277469","name":"The Phantom: The Card Game","description":"The Phantom the Card Game is an adventure game. You play alone or with a friend. You are in the world of The Phantom and can seek help from allies, using weapons and actions to support you. Players experience exciting adventures by using cunning to overcome problems and defeat enemies.&#10; Each round, players face a new problem that needs to be taken care of, but with limited resources and plays it is important to make good decisions to overcome short term obstacles, achieve the long term goal and at the same time evolve your supply of actions, items and allies. Any enemies that are not dealt with will injure you, making it hard to come back to full speed.&#10;&#10;The game includes 3 adventures that can be played in 4 different difficulties.&#10;Story of Devil:&#10;Follow the footsteps of the Phantom and experience how he met and bonded with his trusted wolf Devil. Based on Team Fantomen&rsquo;s 1979 publication The Story of Devil, written by Donne Avenell and drawn by Georges Bess.&#10;Diana in the Jungle Patrol:&#10;Take part in the story about how Diana became an esteemed jungle patrol officer. Based on the classic story from 1973 by Magnus Knutsson and Jaime Vallv&eacute;.&#10;Year One:&#10;Jump into the story year one the 21st Phantom&rsquo;s first adventure after taking the role as the Phantom. Based on the 2004 story created by Claes Reimerthi and Paul Ryan.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":45,"minAge":14,"categoriesAndMechanics":["Adventure","Card Game","Comic Book / Strip","Card Play Conflict Resolution","Cooperative Game","Hand Management","Solo / Solitaire Game"],"rating":3.4796,"complexity":2.1667,"urlThumb":"https://cf.geekdo-images.com/wBaCFFPxmbgAH40Q9yY5Fg__thumb/img/SVXEce7SmAr7J7C-Mx2Xx7SzCFg=/fit-in/200x150/filters:strip_icc()/pic5348619.jpg","urlImage":"https://cf.geekdo-images.com/wBaCFFPxmbgAH40Q9yY5Fg__original/img/bQAvL_jKxt1dIfa13pSQkrm_aw0=/0x0/filters:format(jpeg)/pic5348619.jpg"},{"bggId":"262310","name":"Tasty Humans","description":"Tasty Humans is a 30-60 minute, tile-laying, pattern-building game for 1-4 players who take on the role of fantasy monsters trying to appease their insatiable appetites. As the monsters toss around the village king, they attract a steady buffet of adventurers who muster their feeble attempts at putting up a fight. Players take turns selecting which adventurers their monster will consume, dropping various body parts into their stomach. Each creature has their own personal craving that dictates how they prefer having their food settle, and throughout the game they will acquire tasty leaders that also increase satisfaction in different ways. Once a monster has completely filled their stomach, the player that most effectively maximized the overall satisfaction of their monster will be victorious!&#10;&#10;&mdash;description from the publisher!&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Fantasy","Puzzle","Open Drafting","Pattern Recognition","Tile Placement","Variable Player Powers"],"rating":3.382045,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/on2jqGYKibnWAbA5ouc5Bw__thumb/img/7r6e4CG85eZTIaH1sBQ3MeSadDU=/fit-in/200x150/filters:strip_icc()/pic4654271.png","urlImage":"https://cf.geekdo-images.com/on2jqGYKibnWAbA5ouc5Bw__original/img/S5AluwpAR5xF9s4yHAlRKBVCKcI=/0x0/filters:format(png)/pic4654271.png"},{"bggId":"206780","name":"Vikingdoms","description":"Two Viking seafarers loot coins and build settlements by raiding islands. Each raid needs a larger troop that you recruit together so you can loot together&hellip; however the first to take the loot will be the one whose Viking leads the raiders.&#10;&#10;Vikingdoms is a strategy game, where you map the territories, plan your actions to get the loot and then step by step prepare your decisive raid(s). Capture prisoners, make allies, avoid rioters, to become the first in building three identical settlements or gathering 16 coins, to build the VI. Kingdom!&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":30,"minAge":12,"categoriesAndMechanics":["Abstract Strategy","Grid Movement","Set Collection"],"rating":3.3943,"complexity":2.3333,"urlThumb":"https://cf.geekdo-images.com/ZU4fatikIraQOUvorpnmjQ__thumb/img/GOyQxP0jqk8w0ChHj7AHssb1jSs=/fit-in/200x150/filters:strip_icc()/pic3173874.jpg","urlImage":"https://cf.geekdo-images.com/ZU4fatikIraQOUvorpnmjQ__original/img/IRmt1bGws-zyAxAp9wSQYCfcytM=/0x0/filters:format(jpeg)/pic3173874.jpg"},{"bggId":"295571","name":"Deckscape Crew vs Crew: The Pirates' Island","description":"Deckscape Crew vs Crew: Pirates' Island is part of a series of games inspired by real escape rooms in which a group of people is &quot;trapped&quot; inside a room full of puzzles and odd items. The goal of the game is to solve puzzles, understand the plot of the story, and make intelligent use of the items provided in order to exit from the room as quickly as possible.&#10;&#10;Deckscape Crew vs Crew: Pirates' Island differs from other Deckscape titles by adding a competitive element to the game! Players split into two teams and try to correctly solve the puzzles before the other team does. This chapter also features puzzle-based mini-games specially designed for a competitive experience!&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":90,"minAge":12,"categoriesAndMechanics":["Card Game","Pirates","Puzzle","Real-time","Team-Based Game"],"rating":3.079645,"complexity":1.6,"urlThumb":"https://cf.geekdo-images.com/Oh0Z94NPKRoK-1sXIriZjw__thumb/img/HOLKhQElEZaNN0h7TiovL-OhPAg=/fit-in/200x150/filters:strip_icc()/pic6001997.png","urlImage":"https://cf.geekdo-images.com/Oh0Z94NPKRoK-1sXIriZjw__original/img/G6HxWnKlofjJn6hkFYYJAw2_qyQ=/0x0/filters:format(png)/pic6001997.png"},{"bggId":"206904","name":"Twilight of the Gods: Age of Revelation","description":"Description of the publisher:&#10;&#10;In Twilight of the Gods you and your friends will each assume the role of a deity from myth and legend, and battle to the death to see who is the strongest god, using human armies, mystical beasts, and heroes of renown from both past and future.&#10;&#10;These deities span multiple pantheons, from numerous civilizations, and each favors a particular method of strategy - Aggression, Negotiation, Mysticism, or Sanctuary - which influences how your battle will play out. Every deity also possesses a special, once per game power that can be used to further the tide of battle in your favor, or come back from what seems like overwhelming defeat, so never count an opponent out until they draw their last card.&#10;&#10;Now go forth and let none stand in your way!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":90,"minAge":13,"categoriesAndMechanics":["Card Game","Mythology","Deck, Bag, and Pool Building","Hand Management","Memory","Open Drafting","Trading","Variable Player Powers"],"rating":3.55731,"complexity":3.7143,"urlThumb":"https://cf.geekdo-images.com/9zdP8UavZKmWGvUf_HzWbA__thumb/img/652yuQaCWx9K_5h9Z_1x0YHQ5No=/fit-in/200x150/filters:strip_icc()/pic3291986.jpg","urlImage":"https://cf.geekdo-images.com/9zdP8UavZKmWGvUf_HzWbA__original/img/pAAv733pzy_OJcRDvFeEjufnuvM=/0x0/filters:format(jpeg)/pic3291986.jpg"},{"bggId":"217974","name":"Bemused","description":"Bemused is a card game for 4-6 players in which the players take on the role of a muse seeking to elevate their chosen human virtuoso to the greatest height of celebrity and influence. To do so, the muse must eliminate their virtuoso's rivals by levying doubts and dreads upon them until they are driven insane...or worse.&#10;&#10;Bemused is not a social deduction game.  Although there are elements of deductive reasoning, Bemused is a social interaction experience that encourages shameless table talk, bluffing, and deal-making as players seek to maximize their scores in a &quot;take that&quot; environment.  Bemused is best described as a strategic &quot;ruin your rivals&quot; game with hidden goals and asymmetric player powers.  It is also a much deeper strategy game than it first appears.&#10;&#10;Each player has a virtuoso card that designates their human prot&eacute;g&eacute; and a hand of doubt and dread cards.  Each turn, the player draws two doubt cards for their hand, places a doubt or dread card from their hand onto a virtuoso card, then discards a card from their hand. In some cases, a player may play two doubt cards from their hand, but this action permanently reduces their hand size. Each virtuoso has an ability that their muse may use, such as change a dread to a doubt or move a doubt from one virtuoso to another.  Scheming, negotiating, and table talk are encouraged!&#10;&#10;When a virtuoso is saddled with a combined total of five doubt and/or dread cards, the virtuoso is driven insane. An insane virtuoso still gets their turn and may still win the game, but their options for which cards they may play on their turn is limited by their insanity. If an insane virtuoso has more dread than doubts, that virtuoso dies and becomes a fantasma that haunts the remaining living virtuosos. A fantasma may still win the game!&#10;&#10;Each muse's prot&eacute;g&eacute; also has a gemina, a secret virtuoso in the game that holds a psychic link with their prot&eacute;g&eacute;, and a secret that describes how their prot&eacute;g&eacute; feels about their gemina, and how the player's score will be affected by the state of their prot&eacute;g&eacute;'s gemina when the game ends (e.g., the player may gain points if their virtuoso's gemina is not insane at the end of the game).  Once a virtuoso's gemina is revealed, a player may use the gemina's ability as well as their prot&eacute;g&eacute;'s ability!  A player may also reveal and use their virtuoso's gemina for a price... but whenever a virtuoso goes insane, their gemina automatically flips over and can have severe consequences for play...&#10;&#10;","minPlayers":4,"maxPlayers":6,"minPlayTime":15,"maxPlayTime":30,"minAge":12,"categoriesAndMechanics":["Bluffing","Card Game","Fantasy","Negotiation","Hand Management","Hidden Victory Points","Take That","Variable Player Powers"],"rating":3.439065,"complexity":2.125,"urlThumb":"https://cf.geekdo-images.com/cIUqIilg3qEc63EMYMic9w__thumb/img/Stvc6VNiE2t0j-StSSiya4y-IGw=/fit-in/200x150/filters:strip_icc()/pic3396300.png","urlImage":"https://cf.geekdo-images.com/cIUqIilg3qEc63EMYMic9w__original/img/NUIRLGKaRY41Y9NTNbwEcIymYCE=/0x0/filters:format(png)/pic3396300.png"},{"bggId":"208321","name":"Holdfast: Atlantic 1939-45","description":"HoldFast Atlantic recreates the ship battles contesting control of the Atlantic Ocean during World War II.  The navies of Britain and the United States are challenged to keep sea lanes open for its convoys.  German U-Boats prowl these waters and German and Italian battleships and cruisers threaten the sea supply lines of the Allies.  The great Axis warships Bismarck, Tirpitz and others contest Britain's best while the United States fleet adds its might to the fight as the war progresses. As the Axis player can you cut the sea lanes that supply Great Britain and Russia to win the war?  Or as the Allied player, can you overcome the U-Boat menace and Axis naval and air forces to control the Atlantic.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":150,"minAge":13,"categoriesAndMechanics":["Nautical","Wargame","World War II","Area Majority / Influence","Area Movement","Dice Rolling","Minimap Resolution","Secret Unit Deployment","Simulation"],"rating":3.51238,"complexity":2.1667,"urlThumb":"https://cf.geekdo-images.com/SNruwMrCo_VymJzK_s5FQg__thumb/img/58a501CPYp6D0TqbQ2lMt4VWFeQ=/fit-in/200x150/filters:strip_icc()/pic3226287.jpg","urlImage":"https://cf.geekdo-images.com/SNruwMrCo_VymJzK_s5FQg__original/img/GIN8jFNfabn4r4XGsWT0jOXdYxw=/0x0/filters:format(jpeg)/pic3226287.jpg"},{"bggId":"8721","name":"Hof Gap: The Nurnberg Pincer","description":"Hof Gap - The Nurnberg Pincer  is one of several games in the Central Front Series published by SPI in the 1980s. Both the game and series depict the early days of World War III in West Germany. Combat is conducted at the company, battalion, and regiment level, with a map scale of 4 km per hex. The map covers the Hof Gap and includes the major West German city of Nurnberg.&#10;&#10;The Central Front series use a collection of mechanics, including &quot;Operations Points&quot; and &quot;Friction Points&quot;, variable length game turns, and Zones of Control to simulate modern battlefield conditions. As with most modern warfare games, the series includes rules for airpower, air-mobile operations, and nuclear/chemical warfare.&#10;&#10;The game contains three scenarios. &quot;Covering Force&quot; covers the first 36 hours of combat in the Coburg, Kronach, Hof and Cheb Gaps, and is played on the eastern half of the Hof Gap game-map. &quot;VII Corps&quot; uses the entire game-map, treating the Meiningen approach as well as the action shown in &quot;Covering Force&quot; for the first four of the next war. &quot;Seventh Army&quot; allows the player to join the Hof Gap game-map with the Fifth Corps: The Soviet Breakthrough at Fulda game-map and other components of the &quot;Fifth Corps&quot; game in order to represent the entire US front in central West Germany&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":120,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Modern Warfare","Wargame","Dice Rolling","Hexagon Grid","Simulation"],"rating":3.50315,"complexity":3.6,"urlThumb":"https://cf.geekdo-images.com/maoV6KajitBQmArRYACOSQ__thumb/img/zUWPNkkR91yh-l1e9Gnk1aHbQrw=/fit-in/200x150/filters:strip_icc()/pic4707831.jpg","urlImage":"https://cf.geekdo-images.com/maoV6KajitBQmArRYACOSQ__original/img/mvOHd3jD4JD9evPOkjvb74Gj8r4=/0x0/filters:format(jpeg)/pic4707831.jpg"},{"bggId":"164917","name":"Bananagrams WildTiles","description":"A Scrabble-like game without the board -- much like Pick Two!, but without the letter values.&#10;&#10;Using a selection of 144 plastic letter tiles in the English edition, each player works independently to create their own 'crossword'. When a player uses up all their letters, all players take a new tile from the pool. When all the tiles are gone, the first player to use up all the tiles in their hand wins.&#10;&#10;There are also variants included in the rules, and the game is suitable for solo play.&#10;&#10;In this new Target-exclusive version, six wild monkey tiles are added. They can be used as any letter and switched it up.&#10;&#10;","minPlayers":1,"maxPlayers":8,"minPlayTime":15,"maxPlayTime":15,"minAge":8,"categoriesAndMechanics":["Real-time","Word Game","Spelling","Tile Placement"],"rating":3.252315,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/NzVxZRGbrG1YWgC4MIrFzQ__thumb/img/0Xo9BZ4jfEmAuvNmccJmNZ1_6_I=/fit-in/200x150/filters:strip_icc()/pic2228144.png","urlImage":"https://cf.geekdo-images.com/NzVxZRGbrG1YWgC4MIrFzQ__original/img/hqiQJO_StDO_-NtUpeIIn9zJHHc=/0x0/filters:format(png)/pic2228144.png"},{"bggId":"348972","name":"Hidden Games Tatort: Königsmord","description":"An idyllic celebration ends with a death. Do the perpetrators come from their own family?&#10;&#10;The &quot;K&ouml;nig&quot; family is celebrating a festival at their country estate again this year. But this time everything turns out differently. Casper K&ouml;nig, the patriarch of the family, disappears without a trace shortly beforehand and his son Egon is found dead the morning after the feast. The family eye each other suspiciously - everyone is a suspect! What happened at Gut K&ouml;nig?&#10;&#10;The &quot;K&ouml;nigsmord&quot; case is perfect for beginners to crime games. The case is altogether more structured than the others and &quot;Inspector Hahnke&quot; guides you through the case to its successful conclusion. We guarantee: anyone (16 years and older) can solve this case.&#10;&#10;As a team, you will need to analyse letters and interpret the police interviews of various suspects. Your approach to finding a solution is guaranteed to be multidimensional. Collect all the information on various information sheets, discuss the alibis and motives. For your research during the investigation, you will need internet access. It is also helpful (but not absolutely necessary) if you have a laptop or tablet at hand. Mobile phones are also allowed!&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":90,"maxPlayTime":180,"minAge":16,"categoriesAndMechanics":["Deduction","Murder/Mystery","Cooperative Game","Deduction","Scenario / Mission / Campaign Game","Storytelling","Team-Based Game"],"rating":3.814395,"complexity":1.3333,"urlThumb":"https://cf.geekdo-images.com/5Tnvmxzh-8RWKLLA8m1Kdw__thumb/img/XLuOaEVju1xvTU3zQn-gE6vGQvY=/fit-in/200x150/filters:strip_icc()/pic6447000.jpg","urlImage":"https://cf.geekdo-images.com/5Tnvmxzh-8RWKLLA8m1Kdw__original/img/60zZalnkobIwFgEHUvwyvPBZopw=/0x0/filters:format(jpeg)/pic6447000.jpg"},{"bggId":"340465","name":"Holiday Hijinks #3: The Pumpkin Problem","description":"Trick-or-treating is in grave danger. You can feel it in your bones: someone in the neighborhood is a monster! Can you save Halloween and find the missing candy?&#10;&#10;The Pumpkin Problem, title #3 in the Holiday Hijinks line, is an escape room style game in just 18 cards! As a group, you will solve a series of puzzles to unravel a mystery.&#10;&#10;When you have solved a puzzle, you will enter the answer into the companion web app (compatible with all smart phones and computers) and it will check whether you are correct. If you are, the app will tell you which card or cards to take next.&#10;&#10;The app also contains a graduated hint system, so if you get stuck you can get just a small hint about the current puzzle to get moving again without giving too much away.&#10;&#10;Puzzles may test your perception, wordplay, and lateral thinking. English language fluency is required. Knowledge of traditional Halloween topics is helpful, but that information is also provided in the app if you need it.&#10;&#10;Most groups take about an hour to solve the game. You can write on the cards to help solve puzzles, but this is not required (or you could use penny sleeves) and the game is otherwise non-destructable. So while you can't play again yourself, you could give the used game to someone else to play.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":60,"minAge":13,"categoriesAndMechanics":["Card Game","Deduction","Puzzle","Deduction","Finale Ending"],"rating":3.789865,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/9QZCd7_DjcI_Y6wHaRJR2w__thumb/img/6Qh2kV55d8KG5O138byD6jYegiY=/fit-in/200x150/filters:strip_icc()/pic6918883.png","urlImage":"https://cf.geekdo-images.com/9QZCd7_DjcI_Y6wHaRJR2w__original/img/wYdf6aVxI1PrQOYUbK_eo6cptag=/0x0/filters:format(png)/pic6918883.png"},{"bggId":"235511","name":"Team UP!","description":"If you have ever worked in a game store, at a logistics company, or for a game publisher, you understand the theme in Team UP! It all starts with a pallet and multiple boxes of different shapes that you need to stack on top of it.&#10;&#10;The game is cooperative, with players teaming up to pack the most compact pallet possible. You draw cards that indicate the color or shape of a box, and that's the type of box you have to stack next. The game proceeds until there are no more boxes to stack or until the players decide it is best to stop to avoid penalties. Scoring takes into account three factors: the number of full rows on the pallet, the number of boxes that aren't stacked on the pallet at the end, and the number of penalty points (from cards you draw but cannot play). The best score is 25. The perfect solution exists, but will your team find it?&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":30,"minAge":7,"categoriesAndMechanics":["Abstract Strategy","Industry / Manufacturing","Transportation","Action Queue","Cooperative Game","Push Your Luck","Tile Placement"],"rating":3.174745,"complexity":1.3333,"urlThumb":"https://cf.geekdo-images.com/6hqatvV_uhGWebNPWzj4lA__thumb/img/Ja6pyHziaDDIi_2_jRCXUGNKWm0=/fit-in/200x150/filters:strip_icc()/pic3788130.jpg","urlImage":"https://cf.geekdo-images.com/6hqatvV_uhGWebNPWzj4lA__original/img/wQEfzA4Dkc9HXjJJ_nsb3lijOh4=/0x0/filters:format(jpeg)/pic3788130.jpg"},{"bggId":"187976","name":"Covil: The Dark Overlords","description":"You are the dark Overlord, and the ritual is complete. At your command, the Covil rises. A living and breathing fortress now profaned by the greed crystals. Inside its dungeons lies the gate to the dark lands where countless hordes of chaotic beings were enslaved for so long. This time you will have your revenge.&#10;&#10;In Covil: The Dark Overlords, you will struggle for the supremacy of the regions surrounding an isolated town. Each player controls a Dark Overlord with unique powers and countless troops of minions to &ldquo;defend the world from enemy hordes&rdquo;, bring &ldquo;peace and security to the territories&rdquo; &mdash; at a cost, of course!&#10;&#10;The game consist of 4 days, each of them is divided in 3 phases: &#10;Phase 1: Morning (Summoning troops) &#10;Phase 2: Afternoon (Performing Actions)&#10;Phase 3: Night (Dominance and Clean-up)&#10;&#10;At the end of the fourth night phase, the game ends. The player with most victory points wins.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":40,"maxPlayTime":90,"minAge":12,"categoriesAndMechanics":["Fantasy","Humor","Action Points","Area Majority / Influence","Take That","Variable Player Powers"],"rating":3.19177,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/FRAlaGLLKjTP7IK6AOjrRw__thumb/img/ekuzT-aNsCBCzAfeHurrHHHjAHU=/fit-in/200x150/filters:strip_icc()/pic3548292.png","urlImage":"https://cf.geekdo-images.com/FRAlaGLLKjTP7IK6AOjrRw__original/img/MLisTQsPa6qb40s3VLNJNjUVDY8=/0x0/filters:format(png)/pic3548292.png"},{"bggId":"11166","name":"Brandywine & Germantown","description":"Excerpts from the Clash of Arms website:&#10;&#10;Brandywine &amp; Germantown expands the Battles from the Age of Reason Series into the American War of Independence. The games adhere closely to the highly successful BAR rules system. The major change lies in the halving of the strength point ratio so that 1 point equals 50 men, 25 horsemen, or 1 cannon, accommodating the smaller battles and units of North America. There is a noted lack of cavalry in both battles. The counters are in the same style as the other BAR games, but with some interesting variations (e.g., rifle frocks). Brandywine (three maps) has 4 scenarios: Knyphausen's attack at Chads Ford, Cornwallis' attack at Birmingham Meeting House (both one mappers), Howe's historical plan (comprising both Knyphausen's and Cornwallis' attacks), and an optional Howe plan. The latter scenario will allow the British player to select alternative schemes of maneuver to attack the Americans.  Washington, in turn, has the ability to gain intelligence on the British movements      (both true and false information) and possibly readjust his force. Germantown (two maps) has 2 scenarios. They vary based on whether or not the Americans are required to seize the Chew House.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":360,"maxPlayTime":360,"minAge":12,"categoriesAndMechanics":["Age of Reason","American Revolutionary War","Wargame","Hexagon Grid"],"rating":3.84593,"complexity":4.1667,"urlThumb":"https://cf.geekdo-images.com/UaFWNjbzTcA5qWAv0EH6BA__thumb/img/O5NZ03I_YYrH9bQkd9zVAIhS1EM=/fit-in/200x150/filters:strip_icc()/pic45844.jpg","urlImage":"https://cf.geekdo-images.com/UaFWNjbzTcA5qWAv0EH6BA__original/img/QLWGZXxeqkwCqaPBpoF4QO9yD6w=/0x0/filters:format(jpeg)/pic45844.jpg"},{"bggId":"31075","name":"Ming Dynasty","description":"In the middle of the 14th Century the Chinese people succeeded in freeing themselves from the rule of the Mongols. With the accession to the throne of emperor Tai-Tsu they developed a rising country: China.&#10;Each player takes the role of an imperial prince and tries to gain influence with his family members during the growth of the Chinese people during the Ming dynasty. Place your fellow supporters securely into the 6 Chinese provinces, which are each divided into 3 prefectures. In order where your own family members get  majorities into the administration you will be recompensed during the election rounds with gifts from the emperor. &#10;Only the player with the most balanced collection of influence chips will be able to continue as next emperor of the Ming dynasty.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":90,"maxPlayTime":90,"minAge":10,"categoriesAndMechanics":["Medieval","Area Majority / Influence","Network and Route Building"],"rating":2.932265,"complexity":2.8448,"urlThumb":"https://cf.geekdo-images.com/E1mLjkBO93Hai8GaEfjSxw__thumb/img/cziMIP0FtsHN3K59UH5Mh5Lbvrc=/fit-in/200x150/filters:strip_icc()/pic367001.jpg","urlImage":"https://cf.geekdo-images.com/E1mLjkBO93Hai8GaEfjSxw__original/img/oLlO53NKXybpn5SENkSMno9CU4Y=/0x0/filters:format(jpeg)/pic367001.jpg"},{"bggId":"200351","name":"Pinball Showdown","description":"In Pinball Showdown you and the other players are the pinballs and the pinball machine is going like crazy! Before you have time to think, multi-ball starts placing you and the other players in competition to score the various pop bumpers, drop targets and other playfield devices. You and the other pinballs have only a short time to score the most points and complete the various combos for bonuses before it's all over and you inevitably drain.&#10;&#10;Players are dealt ten cards each of which represents a pinball playfield device. Each turn the players all select one card from their hand and one is added from the draw deck. These cards are placed face up in the center of the table and are the playfield devices that pinballs can steer towards and try to score this round. Starting with the first player, each player has three options. They may place a bid on a playfield device (Steer towards it), spend one or more control tokens to increase the speed of their pinball and they may purchase a playfield card from the discard pile. They many do any or all of these options or pass and do none. The highest bidders on each device takes their card and, assuming they meet the speed requirements to complete the device, they score it. Anyone who did not bid on a device starting with the first player selects one of the remaining devices. Pinballs must be going the speed listed on the device they get or greater to score it. If they are not, it is not scored and they still lose speed according to the device. Devices that are scored affect speed and can cause your pinball to speed up or slow down depending on the device. Besides scoring devices and trying not to drain by hitting a speed of zero, players are all competing to finish various combinations which score additional bonuses. At the end of ten rounds, the player that scored the most points wins.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":45,"minAge":12,"categoriesAndMechanics":["Card Game","Auction/Bidding","Set Collection"],"rating":3.37535,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/z530NJlYNoQGMiQxQmBGwQ__thumb/img/MGbv4s4cu2kUv0aVkvIpM3gpHNI=/fit-in/200x150/filters:strip_icc()/pic3193330.png","urlImage":"https://cf.geekdo-images.com/z530NJlYNoQGMiQxQmBGwQ__original/img/IaQVeUR0WpYBZcBHMVoRHma5XiA=/0x0/filters:format(png)/pic3193330.png"},{"bggId":"2060","name":"Probe","description":"Players try to guess each other's hidden words.  An activity deck spices things up a bit by altering scores or revealing letters.  No player is left out of the game because even if their word is revealed they continue to guess opponent's letters and score points.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":60,"minAge":8,"categoriesAndMechanics":["Card Game","Word Game","Deduction","Events","Spelling"],"rating":2.909715,"complexity":1.55,"urlThumb":"https://cf.geekdo-images.com/Rfx1aRFHoZGMdSWVQ4JcKg__thumb/img/x8ycKtGsGB4nv0H1pU9Jh9fjpOs=/fit-in/200x150/filters:strip_icc()/pic912712.jpg","urlImage":"https://cf.geekdo-images.com/Rfx1aRFHoZGMdSWVQ4JcKg__original/img/aKn-thgZQ9N2B2-GjvXBAwH36s4=/0x0/filters:format(jpeg)/pic912712.jpg"},{"bggId":"331699","name":"Zoo King","description":"In Zoo King, 2-4 players compete to build the best zoos by acquiring animal, staff, and facility cards, with the long-term goal of winning awards that will be revealed over the course of play.&#10;&#10;Before the game begins, each player purchases one of the staff or facility cards from their starting allotment of 1,000 money. Randomize the event and award cards into a single deck, with the cards being separated into groups based on the player count. On a turn, you reveal an event card from the deck, then perform two actions (whether the same or different) from these four:&#10;&#10;&#10;    Purchase an animal, staff, or facility card from those available on the market, then add it to your zoo.&#10;    Draw the top card from either the animal deck or the staff/facility deck, then either purchase it or discard it.&#10;    Purchase the top card of either discard pile at a discount, albeit not a card you discarded this turn.&#10;    Exchange an animal in your zoo for one of equal or lesser cost or star value in the market or on top of the discard pile.&#10;&#10;&#10;After you acquire a pair of animals, you receive an immediate bonus of 100. You can also earn money from event cards, with staff and facility cards granting discounts and other benefits.&#10;&#10;After a certain number of rounds, the first set of award cards will appear, with the awards being handed out one by one or returned to the bottom of the event deck in case of a tie. Sample awards include most felines, most money in hand, and highest total star value. As soon as a player has collected three awards &mdash; or four awards in a two-player game &mdash; that player immediately wins. If no one wins during the first award ceremony, then complete another round of events, after which more awards will be distributed.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Animals","Card Game","Video Game Theme","Events","Market","Open Drafting","Push Your Luck","Set Collection","Take That"],"rating":3.75641,"complexity":2.25,"urlThumb":"https://cf.geekdo-images.com/ttybjYmrHeELkfUwaL_uHg__thumb/img/deQTeej4WMZ9alXOCAk9DzXw3X0=/fit-in/200x150/filters:strip_icc()/pic6406594.png","urlImage":"https://cf.geekdo-images.com/ttybjYmrHeELkfUwaL_uHg__original/img/BifCpWEnvycwLgbJIL0HtaEb3QM=/0x0/filters:format(png)/pic6406594.png"},{"bggId":"2888","name":"Starfire II","description":"Starfire II was the first expansion for the original pocket game Starfire.  Although it was an expansion for Starfire, it was also designed as a stand alone game, and included the rules for the Starfire system.  Starfire II built on the Starfire (1st ed) rules, adding various ship systems to the prior rules and adding space fighters; it did not however include full ship construction rules.&#10;&#10;Re-implemented by:&#10;&#10;     Starfire 2nd Edition&#10;&#10;&#10;","minPlayers":2,"maxPlayers":3,"minPlayTime":30,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Science Fiction","Wargame","Area-Impulse","Hexagon Grid","Modular Board","Variable Player Powers"],"rating":3.350175,"complexity":2.6923,"urlThumb":"https://cf.geekdo-images.com/c92PhXSDuq78jo2KfaxQJA__thumb/img/QmJE4FNPcV8CINADd-IdCfCDHP0=/fit-in/200x150/filters:strip_icc()/pic48689.jpg","urlImage":"https://cf.geekdo-images.com/c92PhXSDuq78jo2KfaxQJA__original/img/-DLWF1_iN6wBCgOR3Icoc14bPko=/0x0/filters:format(jpeg)/pic48689.jpg"},{"bggId":"257962","name":"Karate Tomate","description":"In  Karate Tomate players are in a extraordinary culinary martial arts tournament. Learn from the &quot;Tomato&quot;, the great karate master, learning new fighting techniques and collecting the most trophies to win this game. But also collect enough kitchen knives to clear out enemy vegetables at the end of the game. Anyway, you should not be the player with the fewest knives! Then you lose - no matter how many trophies you have!&#10;&#10;","minPlayers":3,"maxPlayers":10,"minPlayTime":20,"maxPlayTime":20,"minAge":8,"categoriesAndMechanics":["Card Game","Humor","Set Collection"],"rating":3.13005,"complexity":1.25,"urlThumb":"https://cf.geekdo-images.com/wZ0gcY4KNGx3fVwQz7WuxA__thumb/img/reg5O8CC3Eyu7CVotMr_Z6ReSsg=/fit-in/200x150/filters:strip_icc()/pic4254428.jpg","urlImage":"https://cf.geekdo-images.com/wZ0gcY4KNGx3fVwQz7WuxA__original/img/4OpfMQhDv4g5QWf9hCxcxEoLnik=/0x0/filters:format(jpeg)/pic4254428.jpg"},{"bggId":"188465","name":"Otrio","description":"Played on a wooden board, there are three ways to win this  abstract-strategy game: Get three circular pieces of your color in a row in either ascending or descending order; get the same sized pieces in a row; or get three concentric pieces in the same space.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Abstract Strategy","Pattern Building"],"rating":3.021645,"complexity":1.3846,"urlThumb":"https://cf.geekdo-images.com/5Q2aQ149gpK3f7uQLjMC_w__thumb/img/pKVjS296FUKvgMAH0rn43wFUuSw=/fit-in/200x150/filters:strip_icc()/pic3770572.png","urlImage":"https://cf.geekdo-images.com/5Q2aQ149gpK3f7uQLjMC_w__original/img/PRAvp9SHQAKF5m6vyjcsorFbAnY=/0x0/filters:format(png)/pic3770572.png"},{"bggId":"346467","name":"Hunt A Killer: Nancy Drew – Mystery at Magnolia Gardens","description":"When Nancy Drew begins to investigate a potential poisoning at the botanical garden known as Magnolia Gardens, she soon becomes poisoned herself. In the small window before her symptoms take hold, Nancy manages to collect all of the evidence the player will need, and to interview the potential suspects. Someone at Magnolia Gardens is using the facility&rsquo;s dangerous plants for nefarious purposes, and Nancy needs your help to find out who before the culprit strikes again. To unearth the culprit, the player must figure out which suspect had the means, motive, and opportunity to commit the crime.&#10;&#10;Difficulty: 2/5 - Medium&#10;&#10;","minPlayers":1,"maxPlayers":99,"minPlayTime":60,"maxPlayTime":90,"minAge":14,"categoriesAndMechanics":["Deduction","Murder/Mystery","Puzzle","Cooperative Game","Deduction","Paper-and-Pencil","Scenario / Mission / Campaign Game","Solo / Solitaire Game","Storytelling"],"rating":3.70284,"complexity":1.3333,"urlThumb":"https://cf.geekdo-images.com/gKVcYwrdyw0xPfcf9w80uw__thumb/img/KJVVyGtRGnxMddMPjWtyjTgDnqg=/fit-in/200x150/filters:strip_icc()/pic6421114.jpg","urlImage":"https://cf.geekdo-images.com/gKVcYwrdyw0xPfcf9w80uw__original/img/OXeqHggz58q7tJ1plDTx7zhXrr0=/0x0/filters:format(jpeg)/pic6421114.jpg"},{"bggId":"202026","name":"Hundreds of Horses","description":"From the publisher:&#10;&#10;Let your imagination run wild with this unique game for all horse lovers. See how well you know the other players&rsquo; horse sense and win out with yours. Mix and match 100 horses in the stables with creative stories, individual personality traits and awards.&#10;&#10;The objective of the game is to guess which horse best fits the story, trait or award that has been read. If you correctly guess the same horse as other players, you earn a horseshoe token. Once all the tokens have been earned, the game ends and the player with the most apples wins.&#10;&#10;","minPlayers":3,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":30,"minAge":6,"categoriesAndMechanics":["Animals","Children's Game","Voting"],"rating":3.730665,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/flCgguyF4CVZl7vDWSWljg__thumb/img/zd59j6RtH9IX2uOvnjAbpeByYEc=/fit-in/200x150/filters:strip_icc()/pic3376352.jpg","urlImage":"https://cf.geekdo-images.com/flCgguyF4CVZl7vDWSWljg__original/img/29e0zlegMDZyGCoVFh9aBmcmTPw=/0x0/filters:format(jpeg)/pic3376352.jpg"},{"bggId":"165984","name":"Anno Domini: Wissenschaft & Forschung","description":"Each Anno Domini set consists of 340 cards, with a description of a historical event on one side of the card and the year (and sometimes specific date) in which it happened on the other. Anno Domini: Wissenschaft &amp; Forschung focuses on historical events related to science and research. Like all Anno Domini sets, this game can be played as a standalone or mixed with some or even all editions.&#10;&#10;In Anno Domini: Wissenschaft &amp; Forschung, each player receives nine cards (or fewer, if you want the game to be shorter) and may look only at the descriptions. In turn, players place a card on the table, trying to place their card in chronological order to those already present. Instead of adding a card, a player may claim that the order in which the cards have been placed is incorrect. In this case all cards are turned over and the correct years revealed.&#10;&#10;If the order is correct, then the doubting player receives two cards and skips a turn. If the order is incorrect, then the previous player &ndash; who accepted the order as correct or made it incorrect through her own placement &ndash; receives three cards. The first player with no cards remaining in hand wins.&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":30,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Bluffing","Card Game","Educational","Party Game","Trivia"],"rating":3.401925,"complexity":1.2857,"urlThumb":"https://cf.geekdo-images.com/PumQWqqXXxRZo_LM7vN4gw__thumb/img/sleGCd6SLJOAW0D-WLmz__10h-M=/fit-in/200x150/filters:strip_icc()/pic2241688.jpg","urlImage":"https://cf.geekdo-images.com/PumQWqqXXxRZo_LM7vN4gw__original/img/Xl4O9cxxIvIFlhR3a98Xp5O0GTg=/0x0/filters:format(jpeg)/pic2241688.jpg"},{"bggId":"209567","name":"Upstream","description":"Every spring, the melted snow fills the riverbeds, opening the way back home for the salmon after a life swimming in the oceans.&#10;&#10;In Upstream, each player controls a bank of salmon swimming upstream to lay their eggs where they were born. During their journey, they will face hungry bears, fierce birds of prey, and patient fishermen, all of which they must avoid in order to survive. These are not the only hazards the salmon must face as each round of play the strength of the water flow will cause some pieces of the river to fall back, making it impossible for some fishes to make their way upstream.&#10;&#10;The game is played in rounds, with each player spending five points among their salmon tokens in order to move them, either swimming or jumping across the hexagonal tiled river. At the end of each round, the lowermost pieces of the river are removed from the game, along with any salmon tokens standing on them, then three new tiles are added to the uppermost side of the river. The game ends when all salmon are either deceased or on the spawn point at the very end of the river. Players then score points, according to the number and order of arrival of their salmon. The player with most points wins.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":25,"maxPlayTime":40,"minAge":8,"categoriesAndMechanics":["Abstract Strategy","Animals","Environmental","Racing","Action Points","Grid Movement","Modular Board","Tile Placement"],"rating":3.152475,"complexity":1.875,"urlThumb":"https://cf.geekdo-images.com/Iv_eFbNzMuROy275e2X2pw__thumb/img/9hx4WYZfrvM_EFxaYL2oVpJEBuU=/fit-in/200x150/filters:strip_icc()/pic3674313.png","urlImage":"https://cf.geekdo-images.com/Iv_eFbNzMuROy275e2X2pw__original/img/sEeMCrggENKm1aER7-Lx1vs1PA0=/0x0/filters:format(png)/pic3674313.png"},{"bggId":"2399","name":"Senet","description":"Senet is an ancient Egyptian board game similar to backgammon.  Each player has 5 pawns which travel around a 3 by 10 board in an S shaped path.  Movement is dictated by the throw of 4 sticks (black on one side and white on the other) which can produce a 1,2,3,4, or 6, (5 is not possible) depending on how they land..  As in backgammon, the objective is to bear all of one's pawns off first.  A couple of interesting differences is that there are safe and trap spaces on the board.  Also, players may block each others' progress as in Parchisi.  Senet sets are usually constructed from various woods and are often quite beautiful.  Senet is one of the oldest boardgames but unfortunately it fell out of use for a few thousand years and no ancient rules set has been discovered.  Undoubtably another tragic loss resulting from the Library of Alexandria burning to the ground.  As a result scholars has made several educated guesses as to the rules.  The most popular versions are in the files section.&#10;&#10;It may be a relative of Aseb and The Royal Game of Ur.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":30,"minAge":6,"categoriesAndMechanics":["Abstract Strategy","Religious","Dice Rolling","Roll / Spin and Move"],"rating":2.91423,"complexity":1.4627,"urlThumb":"https://cf.geekdo-images.com/2gkFXJFYi6RAqkSSmrea5g__thumb/img/Gk0QB9iJ9iGbAhvYT86V14vcCBI=/fit-in/200x150/filters:strip_icc()/pic5722209.jpg","urlImage":"https://cf.geekdo-images.com/2gkFXJFYi6RAqkSSmrea5g__original/img/ZvfDLA5rIBSCjTmxum3oRi3LLBA=/0x0/filters:format(jpeg)/pic5722209.jpg"},{"bggId":"33159","name":"Middle Kingdom","description":"A fast card game where players blind bid for dynasty cards such as warriors, nobles, bureaucrats, peasants, and merchants. You must balance your claims to score well at the end. There are special cards gotten from having the most in a category that give you a bonus, often affecting the bidding process.  For example, the Palace lets you see all bids before placing yours and the Heir lets you claim an unclaimed dynasty card.&#10;&#10;From back of the box:&#10;&#10;Following the collapse of the Han Dynasty, warlords backed rival claimants to the Chinese Throne, while others sought influence among the merchants, nobles, farmers, and bureaucrats.&#10;&#10;Each round, players play Bid Cards to claim Dynasty Cards and take control of the Emperor, Heir, Palace, Market, and Harvest.  However, the heavens in the guise of a Celestial Dragon, can disrupt the best laid plans.  The game ends as the Emperor dies and whoever gains the most influence will ascen the throne.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":40,"maxPlayTime":40,"minAge":12,"categoriesAndMechanics":["Ancient","Card Game","Auction/Bidding","Hand Management","Set Collection"],"rating":2.972795,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/ds59Net3nNaL6Cnk6_4wmQ__thumb/img/pFYuNCgRubLhITMXQ5QeIS5Ns9w=/fit-in/200x150/filters:strip_icc()/pic300555.jpg","urlImage":"https://cf.geekdo-images.com/ds59Net3nNaL6Cnk6_4wmQ__original/img/uRglGQpXFC7Bc1onKf22AYTsSqg=/0x0/filters:format(jpeg)/pic300555.jpg"},{"bggId":"60316","name":"Moon Leap","description":"Each player receives five figures of the same color, numbered from 1 to 5. A player rolls the dice and then may move figures that correspond to the total of the dice, e.g. rolling a 5 allows a player to move the 5 piece, or the 2 and the 3. The pieces are always moved to the next free space that is available on the board.&#10;If the player succeeds in making a chain of 3 or more pawns, he or she may roll the dice again.&#10;The game is finished when the last three, specially-marked squares are occupied. Each player receives the number of points achieved by multiplying the number of the square by the number of the occupying pawn.&#10;&#10;Summary&#10;&#10;* roll d6; may move your matching-numbered token (* is wild but moves only one token)&#10;    * move it to the next free space on the track&#10;    * after any player's token has crossed a line (varies with number of players playing), rolls of 3 4 or 5 may be split between 2 of your tokens (3-&gt;1-2, 4-&gt;1-3, 5-&gt;1-4 or 2-3), but only if you can move both the other tokens&#10;    * if, with your move, you create 3 adjacent tokens of your color, go again (may do it repeatedly)&#10;    * game ends when last 3 spaces of the track are occupied&#10;    * final scores (for each token):&#10;          o (token number) x (number on that token's space)&#10;          o the multiplier for tokens never played to the board is -5&#10;          o highest sum wins&#10;&#10;The original version of the game provided players with six tokens, and had different rules for gaining points from the board spaces.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":7,"categoriesAndMechanics":["Dice","Math","Racing","Dice Rolling","Roll / Spin and Move"],"rating":2.98567,"complexity":1.1111,"urlThumb":"https://cf.geekdo-images.com/YyPTQ5zPw3QjoL6oRvqwgw__thumb/img/wWu06_NQxzq6wBE3WSUWow8iWNA=/fit-in/200x150/filters:strip_icc()/pic7025946.png","urlImage":"https://cf.geekdo-images.com/YyPTQ5zPw3QjoL6oRvqwgw__original/img/83xSDXkdG76kdqhTwfXlH4_9-NY=/0x0/filters:format(png)/pic7025946.png"},{"bggId":"169986","name":"Night of Man","description":"Night of Man is a card-driven, tactical board game. Set in a post-alien-invasion-of-Earth universe, the squads, heroes, and tanks of Earth's Militia battle against powerful aliens with enhanced power armor, hover tanks, Mechs (Ya, I need a better name.), and spider-like robots.&#10;&#10;In each turn gamers draw up to a four card hand and may play a card, sometimes more, in each impulse. The cards activate units to move, fire, assault, and use special powers, such as explosive rounds, telekinesis, and more. Special cards, such as critical hit or bullet storm, can also enhance a unit's attacks.&#10;&#10;Each turn continues until three end turn cards have been drawn. Players then choose one card from their hand to keep, the administrative markers are removed from the board, and a new hand is dealt to each player. The players use that new hand, or the card kept from the previous turn, to bid for initiative in the new turn.&#10;&#10;Night of Man ships with numerous scenarios, as well as a point system that allows gamers to put together their own battles in no time flat.&#10;&#10;","minPlayers":1,"maxPlayers":3,"minPlayTime":60,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Modern Warfare","Science Fiction","Wargame","Dice Rolling","Grid Movement","Hand Management","Simulation","Square Grid"],"rating":3.77633,"complexity":2.5,"urlThumb":"https://cf.geekdo-images.com/UeIC-qYm2kam04mfguWk_Q__thumb/img/IHwC7KobB2yWmYtWq8U8pq4Vhoc=/fit-in/200x150/filters:strip_icc()/pic4203734.jpg","urlImage":"https://cf.geekdo-images.com/UeIC-qYm2kam04mfguWk_Q__original/img/QpJaf3OyDm1wT9Xxw93_W08a6Qo=/0x0/filters:format(jpeg)/pic4203734.jpg"},{"bggId":"319402","name":"Silencio","description":"In Silencio, all players form a team together, a team that cannot speak to one another.&#10;&#10;You each start with a hand of cards from four suits, and your goal as a team is to discard as many cards as possible &mdash; but each card played must have a higher value than the previously played card of the same suit. If a newly played card is the direct successor of the card last played of that color, then you orient the card to show its dark side and suffer the penalty from that card, with the green penalty, for example, forcing the next card played to be green while the blue penalty requires you to give another player one of the face-up cards available from the Oracle.&#10;&#10;If a newly played card is not the direct successor of the card last played of that color, then you place the card with the light side face up, taking the bonus depicted on that half of the card if you desire, such as ignoring the next penalty or placing a card from your hand face up in front of you so that anyone could play it.&#10;&#10;Five shrines are play &mdash; one multicolor shrine and one of each color &mdash; and before or after your card play for the turn, you can choose to flip a shrine face down to use the bonus of that color.&#10;&#10;If you can't play or have no cards in hand, you must pass, and if all players pass in turn, then the game ends. Your score is based on the number of cards in all players' hands, with 0 being the best score possible. If you find the game difficult, you can include the tavern card that a few times each game allows a player to give limited information about their hand; if the game is too easy, you can remove some or all of the shrines to eliminate those &quot;extra&quot; bonuses.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":0,"minAge":10,"categoriesAndMechanics":["Card Game","Fantasy","Communication Limits","Cooperative Game","Hand Management"],"rating":3.23301,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/pTYGVUwNuwdI26ir4WOFGg__thumb/img/oh-iYt2becW_CvnrFYdJKKkHlpE=/fit-in/200x150/filters:strip_icc()/pic5741878.jpg","urlImage":"https://cf.geekdo-images.com/pTYGVUwNuwdI26ir4WOFGg__original/img/zIq9tp7Ai_oq-R37venlfXcLfyo=/0x0/filters:format(jpeg)/pic5741878.jpg"},{"bggId":"239808","name":"No Escape","description":"Can you escape Titan station? No Escape is a fast-paced, strategic maze-building tile game for 2-8 players. Use actions against each other, Play Maze tiles to increase the maze for your opponents, and move using a creative dice system. A game takes approximately 30 minutes, and easy setup and take-down time makes it an ideal game for travel or family events. Be the first to find the escape pod. For everyone else, there is No Escape.&#10;&#10;Each turn players may play one action tile from their hand. They then must play one maze tile and attempt to extend a path another player is taking. Finally players roll the custom dice an move along their own path. The first player to make it out of the maze wins.&#10;&#10;Be strategic when placing dead ends to block your opponents, as every dead end will also give players advantages. Play your Action tiles when they'll provide you the greatest advantage, but hold onto them too long and you may be forced to discard them all.&#10;&#10;Every disadvantage can lead to a new advantage. Every bonus has it's counter. This is No Escape!&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":30,"maxPlayTime":30,"minAge":13,"categoriesAndMechanics":["Exploration","Maze","Science Fiction","Grid Movement","Modular Board","Network and Route Building","Roll / Spin and Move","Take That","Tile Placement"],"rating":3.331185,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/8tVGiCt_vLE6RQuSguJs5A__thumb/img/6LwnWbjc-Is5byhmwevBQ48QG2M=/fit-in/200x150/filters:strip_icc()/pic7609395.jpg","urlImage":"https://cf.geekdo-images.com/8tVGiCt_vLE6RQuSguJs5A__original/img/ePT-Q3WVor1B_3l8AKl_fiI0uhw=/0x0/filters:format(jpeg)/pic7609395.jpg"},{"bggId":"193422","name":"C.O.G.","description":"London 1875 &ndash; The Cabinet of Gadgetry (C.O.G.) appeals for resources to continue its important work in constructing The Great Apparatus &ndash; an automated machine for transporting her majesty's citizens safely and quickly through the increasingly crowded streets of London. Will you answer the call and perform your service dutifully?&#10;&#10;C.O.G. is a steampunk themed game that fuses a crossword game with a eurogame. Each player has their own tableau (similar to a Scrabble board) on which they spell various resource words (such as cog, pulley, rod, aether, bulb, lens). When a player spells a word, they have collected that resource, which will score points at game end.&#10;&#10;The central turn mechanic is worker placement. In each round, players take turns placing workers to gather letter tiles, action cards, and a die. The letter tiles are used to construct words on the players' tableaus. The action cards provide a variety of actions. For example, some cards are &quot;resource cards&quot; that provide an alternative way to collect resources. Other cards provide the ability to manipulate letters. Other cards provide victory points and other special powers. The die chosen has two functions: (1) to move player's pawns along a track whose spaces provide more abilities and (2) to activate some of the action cards.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Dice","Science Fiction","Word Game","Tile Placement","Worker Placement"],"rating":3.26844,"complexity":2.3333,"urlThumb":"https://cf.geekdo-images.com/0nVD5Qhqc0cpy3mClY4UlQ__thumb/img/fFrIWWOalMs2Dqffxc_vdmIBRa8=/fit-in/200x150/filters:strip_icc()/pic3174916.jpg","urlImage":"https://cf.geekdo-images.com/0nVD5Qhqc0cpy3mClY4UlQ__original/img/6ZSGfDUOyIMSviXVmzozXmX-hC4=/0x0/filters:format(jpeg)/pic3174916.jpg"},{"bggId":"145086","name":"Shinobi Clans","description":"As a ruthless and cunning shinobi clan master, you lead your team of ninjas on secret missions that decide between life and death for dangerous ronin, noble daimyos and powerful shoguns. Recruit the most skilled assassins, arm them with the deadliest weapons, and devise plans that will outwit your rivals on your way to becoming the most feared and prosperous ninja clan of them all!&#10;&#10;Shinobi Clans is a strategic card game for 3-5 players. As ninja clan leaders, players must master all facets of ninja warfare: Secretly select missions on targets that promise the biggest rewards with the least opposition. Muster the most suitable ninjas and weapons by card drafting. Position them tactically through a card stack mechanism that can disrupt your enemy's plans. Use secret unit deployment to your advantage and hope the other clans' spies don't uncover your strategy...&#10;&#10;Until the final reveal, your clan's actions and motivations are shrouded in mystery. Can you throw the other clans off your trail while getting the job done? When the smoke clears, your schemes, ambition, and skill will be evident &ndash; but will they prevail?&#10;&#10;","minPlayers":3,"maxPlayers":5,"minPlayTime":60,"maxPlayTime":60,"minAge":13,"categoriesAndMechanics":["Card Game","Deduction","Open Drafting","Secret Unit Deployment"],"rating":3.095635,"complexity":2.125,"urlThumb":"https://cf.geekdo-images.com/gs6cKuQogEH_gNqsyJabeQ__thumb/img/dRSjGMQQANM-97y8MasAnpoio3U=/fit-in/200x150/filters:strip_icc()/pic2022124.jpg","urlImage":"https://cf.geekdo-images.com/gs6cKuQogEH_gNqsyJabeQ__original/img/B9bidCrKKwKbMnzkSZnI7u6v1A8=/0x0/filters:format(jpeg)/pic2022124.jpg"},{"bggId":"15069","name":"Ekonos","description":"Ekonos is a game that with rules and very simple mechanisms, simulates the functioning of the stock exchange and its relation with the real value of the companies.&#10;&#10;Easy to play, but deep enough if you want, Ekonos will challenge you!&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":60,"maxPlayTime":60,"minAge":0,"categoriesAndMechanics":["Economic","Stock Holding"],"rating":3.351055,"complexity":2.4706,"urlThumb":"https://cf.geekdo-images.com/eB3W9r3SPlKKwNoPil-lNA__thumb/img/RAHAAGqNK5C34kExePUQRl-3pLI=/fit-in/200x150/filters:strip_icc()/pic661248.jpg","urlImage":"https://cf.geekdo-images.com/eB3W9r3SPlKKwNoPil-lNA__original/img/N9xYAIl0MMT56x1EDLmbAdS0MMI=/0x0/filters:format(jpeg)/pic661248.jpg"},{"bggId":"300296","name":"PARKS Memories: Mountaineer","description":"PARKS Memories is a strategic matching game for two or more players offering simple and flexible gameplay. Parks are represented in tiles laid out in a grid across the table face down. Gameplay includes four simple steps: reveal two tiles; choose one of the revealed tiles and place it in front of you; add a new tile to the board; lock one of the tiles with the hiker token. Gameplay passes from person to person until one player or team has collected three sets of matching park tiles in front of them.&#10;&#10;Memories captures a depth of strategy in player abilities which can be activated by finding matches of PARKS resource icons when you reveal tiles. There are a variety of ways to enjoy the game. Play a head to head game, or on teams. Expand the grid size for a bigger challenge, or simplify the game to a memory game without player abilities for younger gamers.&#10;&#10;PARKS Memories: Mountaineers is one of three editions of PARKS Memories, highlighting the mountainous national parks of the  United States. It features a uniques set of player abilities. Collectively all three editions showcase every US national park.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":30,"maxPlayTime":30,"minAge":6,"categoriesAndMechanics":["Memory","Travel","Memory","Set Collection"],"rating":3.085265,"complexity":1.3333,"urlThumb":"https://cf.geekdo-images.com/pfawWfF3V6rKW-VqI-2bkQ__thumb/img/0K5DkMPAQjm5LmvjnWCmm7-AXO4=/fit-in/200x150/filters:strip_icc()/pic5900444.jpg","urlImage":"https://cf.geekdo-images.com/pfawWfF3V6rKW-VqI-2bkQ__original/img/DZj1k-P9tI9TLj8PIug3VS9k2Kk=/0x0/filters:format(jpeg)/pic5900444.jpg"},{"bggId":"10520","name":"Tyrus","description":"Two political parties vie for the control of the city. Elections take place in the citadels, markets and temples around the city. These elections will name the nine representatives who will sit at the high council. Each party must carefully divide its soldiers, merchants and priests, to obtain the majority of votes during the elections. These elections follow each another in each of the areas of the city. The struggle is tense and all manner of dirty tricks are allowed. Each faction has the capacity to apply pressure on the others and has the chance of canceling their votes. Tyrus is thus a game of careful application of power, force and influence in order to affect the best outcome possible for your political party. Throughout the game you must try to carefully conserve your troops, because you never know when they will be needed. Both parties start the game with equal forces, so Bluff and misdirection are your main weapons to win the day, and become Master of the city.&#10;&#10;Online Play&#10;&#10;&#10;     Bo&#195;&#174;te &#195;&#160; jeux (turn-based)&#10;     Yucata (turn-based)&#10;&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":30,"minAge":12,"categoriesAndMechanics":["Bluffing","Political","Rock-Paper-Scissors","Secret Unit Deployment"],"rating":2.977745,"complexity":1.8529,"urlThumb":"https://cf.geekdo-images.com/SkutKORSo1qBfQP5GWpc0g__thumb/img/MuSRfE5FUOMPRM73vA2mIEjlfqE=/fit-in/200x150/filters:strip_icc()/pic6910840.jpg","urlImage":"https://cf.geekdo-images.com/SkutKORSo1qBfQP5GWpc0g__original/img/ePUNH2zy4SCwEQ_BICGZaGoN1pY=/0x0/filters:format(jpeg)/pic6910840.jpg"},{"bggId":"251349","name":"Miskatonic University: The Restricted Collection","description":"The game is a quest, an extremely dangerous quest. Dr. Henry Armitage, Chief Librarian, needs you to search the perilous Restricted Collection for fragments of lore from among the grimoires to recover pieces of a particular sigil.&#10;&#10;Miskatonic University: The Restricted Collection lasts five rounds, and each round continues until no one is left in the library, each player having left voluntarily or having been expelled. Basic play consists of taking turns to select a library card and placing these cards face up on your player mats. Library cards come in three types: sigil pieces, grimoire fragments, and graduate students. In more detail:&#10;&#10;&#10;    Sigil pieces: Three pieces make a set and earn a lore card. Picking up a duplicate leads to expulsion unless you can use your defenses.&#10;&#10;&#10;&#10;    Grimoire fragments: Three pieces make a set and earn a lore card. Picking up a duplicate leads to expulsion unless you can use your defenses.&#10;&#10;&#10;&#10;    Graduate students: Collecting four means you can re-use one of your defense cards.&#10;&#10;&#10;Players have a chance to win black or red sanity cards, which increase your score. The game ends when the final fifth round is played. You then add up all the score cards you have received and the player with the highest score wins!&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":30,"maxPlayTime":45,"minAge":13,"categoriesAndMechanics":["Card Game","Horror","Hand Management","Push Your Luck","Set Collection","Take That"],"rating":3.056195,"complexity":1.7143,"urlThumb":"https://cf.geekdo-images.com/A_xVXh22gVoY6XSxGEUWgw__thumb/img/C-gtwbafIPxi2TkDowj7COgWxgE=/fit-in/200x150/filters:strip_icc()/pic4422854.png","urlImage":"https://cf.geekdo-images.com/A_xVXh22gVoY6XSxGEUWgw__original/img/e-Mjc7s2lB4clLdQckIf9tHN4Rc=/0x0/filters:format(png)/pic4422854.png"},{"bggId":"54201","name":"The d6 Shooters","description":"The d6 Shooters are a famous Old West posse, and you are their leader. In this solitaire Print-and-Play series, you will lead your posse on several adventures and missions, using a Yahtzee-style dice system to gain resources, movement and perform other important actions.  There is always danger near, and your journeys will be very challenging to complete, but there is also the potential for great reward with untapped gold deposits among the California lands where you travel.&#10;&#10;The first episode, &quot;The d6 Shooters: Long Road to Reno&quot; and the second installment, &quot;The d6 Shooters: Ghost Town Showdown&quot;, are both now available.&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":25,"maxPlayTime":25,"minAge":10,"categoriesAndMechanics":["American West","Dice","Print & Play","Dice Rolling","Paper-and-Pencil"],"rating":3.276145,"complexity":1.875,"urlThumb":"https://cf.geekdo-images.com/sm7SKJldxfesHevY0XoN7A__thumb/img/7puo2vsqeiCq3hoPHxQY4xP7xeA=/fit-in/200x150/filters:strip_icc()/pic556816.jpg","urlImage":"https://cf.geekdo-images.com/sm7SKJldxfesHevY0XoN7A__original/img/JyVzDWbWau_Mz5GXu2KhbaYvutc=/0x0/filters:format(jpeg)/pic556816.jpg"},{"bggId":"251213","name":"The Coin Tribes' Revolt: Boudica's Rebellion Against Rome","description":"It is 60 AD. Romans have occupied the wild lands of Britannia, and exist in an uneasy peace with the tribes of the land&hellip; When the Iceni king dies, Roman greed triggers a rebellion led by the Iceni queen Boudica that tears across the south-east of Britain. With the Roman forces spread elsewhere in Britain, the revolt could forever change the course of history.&#10;&#10;This is an asymmetrical game of warring factions set in the turbulent times during the early Roman occupation of Britain. It is inspired by the COIN series of games by Volko Runke, published by GMT, and attempts to recreate the GMT COIN Series game experience within the restrictions of the 9 card nano game format..&#10;&#10;This is an entry into the 2018 9 card nano game contest. Original WIP thread: https://boardgamegeek.com/thread/1943861/wip-coin-tribes-revolt-2018-9-card-nanogame-pnp-co&#10;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#9;&#9;&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Ancient","Print & Play","Wargame","Area Majority / Influence","Dice Rolling","Variable Phase Order","Variable Player Powers"],"rating":3.57972,"complexity":2.6667,"urlThumb":"https://cf.geekdo-images.com/MrctJIQAAAbrulkYgHvQWg__thumb/img/EnBZbWDbbxwCwvhP-ra08JlJJdo=/fit-in/200x150/filters:strip_icc()/pic4126032.jpg","urlImage":"https://cf.geekdo-images.com/MrctJIQAAAbrulkYgHvQWg__original/img/G-oRJk6YE5f1zheGTpnEvm8b6Wk=/0x0/filters:format(jpeg)/pic4126032.jpg"},{"bggId":"192288","name":"Kido Butai: Japan's Carriers at Midway","description":"At 1020 hours on June 4, 1942, Japanese naval aircraft still ruled the skies over the Pacific. All that changed within ten minutes, when U. S. dive bombers sunk three out of four carriers constituting Kido Butai, the Imperial Japanese Navy&rsquo;s main strike force which had devastated Pearl Harbor only six months before.&#10;&#10;The solitaire game Kido Butai simulates the dramatic events of the pivotal battle at Midway from a Japanese perspective. As commander of the Tenno's strike force, your task is to&#10;destroy the American base on the atoll and sink any carrier you encounter while preserving your own strength. Simple yet elegant mechanics make for an entertaining challenge. Will you be up to it and keep the imperial sun shining?&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":30,"maxPlayTime":90,"minAge":12,"categoriesAndMechanics":["Wargame","World War II","Chit-Pull System","Dice Rolling","Simulation","Solo / Solitaire Game"],"rating":3.56262,"complexity":2.2,"urlThumb":"https://cf.geekdo-images.com/gXXDi_wYVVCAXhunKruM5w__thumb/img/k1sayqgSUEo_rRCeTTAzPr6CnAA=/fit-in/200x150/filters:strip_icc()/pic2882641.jpg","urlImage":"https://cf.geekdo-images.com/gXXDi_wYVVCAXhunKruM5w__original/img/7pF5pdCjKQNXr0ZvKyn4BOsaBow=/0x0/filters:format(jpeg)/pic2882641.jpg"},{"bggId":"83919","name":"Scattergories Categories","description":"If you loved the game of &quot;Scattergories&quot;, then Scattergories Categories is the next game you will want to play. It's a great twist on your favorite. Keep the fun coming with this fast-thinking categories game. Contains 125 cards, containing 250 word challenges, 2-minute sand timer, 4 pads of score sheets, plastic card base, and rules.&#10;&#10;In this game, players take a word written vertically, and brainstorm a word that starts with each letter in that word. For example, if the word was FOOD: Frankfurter, Olive, Oatmeal, and Dumplings.&#10;&#10;New edition with 250 new word challenges was published in 2016.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":25,"maxPlayTime":35,"minAge":12,"categoriesAndMechanics":["Word Game","Paper-and-Pencil"],"rating":3.07588,"complexity":1.4286,"urlThumb":"https://cf.geekdo-images.com/0DyywnnKBl1jhE1prAc65g__thumb/img/Zz8E2Aw1fdX3s3qJEpa_9r9r43o=/fit-in/200x150/filters:strip_icc()/pic3001968.jpg","urlImage":"https://cf.geekdo-images.com/0DyywnnKBl1jhE1prAc65g__original/img/QF4S-xhFHMJtAEShKuhkIqvTnQY=/0x0/filters:format(jpeg)/pic3001968.jpg"},{"bggId":"825","name":"Screaming Eagles","description":"Screaming Eagles is a jet fighter dogfight with a unique board that allows for some bizarre moves. Players control 1 or 2 fighters and try to shoot each other out of the sky. Movement direction is determined by card play, and movement distance is determined by die roll. When your fighter moves off the front edge of the board, it &quot;loops&quot; to the back of the board and continues. If you successfully position your jet behind an enemy, open fire with you cannon or a missile.  Damage is assessed by a die roll, and multiple hits are needed to bring down a plane unless a(n un)lucky shot strikes the cockpit or fuel tank. This is simple game that plays at jet speed!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":20,"minAge":10,"categoriesAndMechanics":["Fighting","Wargame","Dice Rolling","Simultaneous Action Selection","Team-Based Game"],"rating":3.01602,"complexity":1.3448,"urlThumb":"https://cf.geekdo-images.com/_tBwZhChkF7epjvchZL2hg__thumb/img/2wpqQXSvT8jHGyOthjWo1lL7_MU=/fit-in/200x150/filters:strip_icc()/pic6977211.jpg","urlImage":"https://cf.geekdo-images.com/_tBwZhChkF7epjvchZL2hg__original/img/2vRyzk3em6QjaMTeoQ0vU20nbws=/0x0/filters:format(jpeg)/pic6977211.jpg"},{"bggId":"6121","name":"Tablut","description":"Tablut is a traditional tafl game played on a 9&times;9 grid. The game was originally recorded by Linnaeus in Lapland in 1732.&#10;&#10;game description for Swords &amp; Shields&#10;One player controls the Shields and the other controls the Swords.  The Swords player must try to capture the Chief Shield, while the Shields player must clear a safe path for the Chief Shield to escape off the board.  Pieces can move any number of spaces in a straight line, and are captured when bracketed on two opposite sides by opponent pieces.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":45,"maxPlayTime":45,"minAge":8,"categoriesAndMechanics":["Abstract Strategy","Medieval","Science Fiction","Grid Movement","Point to Point Movement"],"rating":3.141105,"complexity":2.5,"urlThumb":"https://cf.geekdo-images.com/khvU3Tib_POr8zij0cfpHA__thumb/img/2MI_bR6W3rL-2HxTMAszamVvSy4=/fit-in/200x150/filters:strip_icc()/pic438632.jpg","urlImage":"https://cf.geekdo-images.com/khvU3Tib_POr8zij0cfpHA__original/img/QvvSnXrHCPCIEjV9fCS0LMEEPeM=/0x0/filters:format(jpeg)/pic438632.jpg"},{"bggId":"153870","name":"Green Deal","description":"In Green Deal you lead an international corporation in 2050! It is your job to increase the profits and plan the finances. But your business must not only be profitable. Due to resource scarcity and social distemper, governments increasingly require clean production and compliance with social standards from you. Also the customers have become more demanding. That's why you initiate PR campaigns. Do good and most of all, talk about it!&#10;&#10;Each round players invest in project and action cards. About thirty different action cards give you special abilities. Before each round all players bid simultaneously for the turn order. On the world map you can cooperate with adjacent projects of other players or harm them financially.&#10;&#10;It is important to develop in all four project categories because you receive extra points for your weakest one. Moreover, the players with the best reputation in each category receive extra victory points. In PR Campaigns you can secretly decide in which area you want to boost your image.&#10;&#10;Try to predict the moves of your competitors and develop your own strategy to win Green Deal!&#10;&#10;","minPlayers":3,"maxPlayers":5,"minPlayTime":60,"maxPlayTime":90,"minAge":10,"categoriesAndMechanics":["Bluffing","Economic","Educational","Environmental","Political","Area Majority / Influence","Auction/Bidding","Simulation","Simultaneous Action Selection","Tile Placement"],"rating":3.47883,"complexity":2.9091,"urlThumb":"https://cf.geekdo-images.com/7gPYy_hEZiE_-3z_FKmd6g__thumb/img/Zw3qvNKjFYRHlY9Zl4yPKyVMM04=/fit-in/200x150/filters:strip_icc()/pic2210952.png","urlImage":"https://cf.geekdo-images.com/7gPYy_hEZiE_-3z_FKmd6g__original/img/UhSV5x1TdCB4AwdmzQbeJSY0NIc=/0x0/filters:format(png)/pic2210952.png"},{"bggId":"186793","name":"Barnyard Roundup","description":"Family bluffing card game, aimed at parents and adults that are bored playing old typical games. Fun for both adults and kids, Barnyard Roundup is a game that doesn&rsquo;t feel like a &ldquo;task&rdquo; to play for the adults and is on a level a kid would enjoy.&#10;&#10;The goal of the game is to collect the most valuable farm animals for Farmer Brown to sell on Market Day. You do this by playing cards face-down from your hand and declaring what they are, then giving one other player the choice to decide if you are bluffing or telling the truth. If they choose correctly, THEY get the Farm Animal card(s) you played, but if they guess wrong, YOU get the card instead. Whoever wins Farm Animal cards adds them to their collection. But you may also get Crows, pests that irritate Farmer Brown and count against you in the scoring.&#10;&#10;Collect the most animals by bluffing, baffling and out-guessing your friends! Score the most points and win the game!&#10;&#10;Barnyard Roundup is a family-friendly, appropriate game for ages 7 and up. We have played the game with players as young as 4 and had a lot of fun! Everyone in the family will enjoy this game, we have even brought this out on game night with the adults and had a great time!&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":10,"maxPlayTime":20,"minAge":6,"categoriesAndMechanics":["Bluffing","Party Game","Hand Management","Set Collection","Take That"],"rating":3.33457,"complexity":1.3333,"urlThumb":"https://cf.geekdo-images.com/3efGNNlnd64tfDicYaKyOA__thumb/img/0H-1W6ovlMrD_amCAmUOdo6JXNg=/fit-in/200x150/filters:strip_icc()/pic2891892.jpg","urlImage":"https://cf.geekdo-images.com/3efGNNlnd64tfDicYaKyOA__original/img/OLW1OOkNmV_Y6nlSQ6rfrQj7QHo=/0x0/filters:format(jpeg)/pic2891892.jpg"},{"bggId":"49261","name":"Kraby","description":"Time to catch some crabs! Not for dinner, mind you, but to sell to markets for a grand haul. In order to make the most for your efforts, you want to concentrate on those crabs grouped together in large sets. Otherwise you're piddling away time spent chasing individual crabs, which is hardly worth the bother. The fishermen who nets the most valuable haul wins the game.&#10;&#10;Set-up in Kraby differs depending on the number of players, with 80 or 120 tiles in play, the game board being 9x9 or 11x11, and the number of colored crab figures being 10, 12 or 15. Each player starts by secretly drawing six crab tiles (which come in four colors with two players and five colors otherwise) and placing them behind their screen. On a turn, a player chooses one tile and enters it from any side of the game board, sliding it in the row or column until it hits the island at the center of the board or another tile in play. (A move that would slide a tile off the board or create an impossible-to-fill space is illegal.) The player then draws a new tile and places it behind his screen.&#10;&#10;A player then has the option of placing one of the colored crab figures in his ship's hold. Each ship has three holds, with a scoring multiplier of x1, x2 or x3. A player can claim a color only once and cannot place it on the same multipler as another player. In a four-player game, a player can claim only two figures.)&#10;&#10;The game ends once the final tile has been placed and the game board filled. Each group of crabs in the same color, with orthogonally adjacent crabs belonging to the same group, is worth -1 to 5 points depending on its size. Once the value of a color is determined, each player scoring this color multiplies this value &ndash; which might be negative &ndash; by the multipliers showing on his ship's hold. The player with the highest score wins.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":7,"categoriesAndMechanics":["Abstract Strategy","Animals","Children's Game","Territory Building","Enclosure","Hand Management","Pattern Building","Stock Holding","Tile Placement"],"rating":3.10803,"complexity":2.0833,"urlThumb":"https://cf.geekdo-images.com/7vwp57rV3R-tX8LbxUNYfA__thumb/img/S-7Sbc8Jvt9cyAOd-AHg2x0tsJ0=/fit-in/200x150/filters:strip_icc()/pic725298.jpg","urlImage":"https://cf.geekdo-images.com/7vwp57rV3R-tX8LbxUNYfA__original/img/uUJIJtl4t457p7HdkiTURcGF7vg=/0x0/filters:format(jpeg)/pic725298.jpg"},{"bggId":"299939","name":"Doodle Dungeon","description":"A visit to the dungeon can be quite the tormenting affair on the hero side of life, so why not switch sides and become a certified dungeon architect instead? In Doodle Dungeon, each player works on their own dungeon blueprint. Drafted cards determine which elements &mdash; monsters, traps, and treasures &mdash; they have to add immediately. After fourteen cards have been drafted, the blueprint is passed to the next player, who then draws the route an anthropomorphic test hero will take because these days, even in the dungeon business, nothing works without quality inspection. The players receive their own blueprints back and try to keep the dummy hero from killing their monsters, stealing their treasures, and &mdash; obviously &mdash; making it out alive. They can use the drafted cards to fight off the hero or to support the heroes in their opponent's dungeons. In the end, only the creator of the most devious dungeon will triumph.&#10;&#10;Doodle Dungeon combines the rewarding elements of creating, then defending one's own dungeon, and mixes it with engaging draft-and-draw gameplay.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Fantasy","Humor","Hand Management","Line Drawing","Open Drafting"],"rating":3.13049,"complexity":1.6667,"urlThumb":"https://cf.geekdo-images.com/IZAgXOckOGjPnsohrDcTNg__thumb/img/NT2H9Q5VK1fT2l7YIYchIbjb1z4=/fit-in/200x150/filters:strip_icc()/pic5646175.jpg","urlImage":"https://cf.geekdo-images.com/IZAgXOckOGjPnsohrDcTNg__original/img/ztT4OXacPB3PMgwZP5-RwmSGTvM=/0x0/filters:format(jpeg)/pic5646175.jpg"},{"bggId":"374573","name":"Reviving Kathmandu","description":"Reviving Kathmandu is a bidding and set collection game for 1-6 players. In the game, players are builders who travel to Nepal. They&rsquo;ll compete to earn the title of Most Respected Architect in Kathmandu.&#10;&#10;Bid on construction materials (cards). Then collect those cards and use them to build the most prestigious Buddhas, Shrines, Stupas and Pagodas (&ldquo;Monuments&rdquo;). You&rsquo;ll score points for your monuments, for achieving special objectives, and for paying special attention to color. The architect who achieves the most points will win the game.&#10;&#10;HOW TO PLAY&#10;The game is played over 8 rounds. Each round has 3 phases: Bid, Collect, and Build. Players work through these 3 phases, in this order. Each phase is explained in greater detail in the rulebook. But, generally, players will:&#10;&#10;- BID: Starting with the first player and continuing clockwise, each player must place 1 coin of their choice face-down onto one of the bid spots on the playmat. Each bid spot targets 2 cards within the same row or column.&#10;&#10;- COLLECT: Players flip their coins and determine who won each card. Determine the winner for each card using this order:&#10;  1. The only bidder&#10;  2. Highest bidder&#10;  3.If tied, the player whose coin is closest to the card&#10;  4. If still tied, the player whose coin is on the long edge of the card&#10;Then each player collects 2 cards total to their hands &mdash; taking from the Market and/or the red deck.&#10;&#10;- BUILD: Players use as many cards as they want from their hands to build Monuments. To add to a Monument, slide an appropriate card under the previous one, revealing the section that continues the Monument. Once a Monument has all its required sections, it is &ldquo;complete.&rdquo; Buddhas are considered complete immediately after they are built. When you complete a Monument, immediately score points for completing it&#10;&#10;The game has 8 rounds. After every 4 rounds, each player will only have 1 coin left. When this happens, players either convert their last coin to points or buy 1 discarded card.&#10;&#10;MISSIONS: Players may complete various objectives for bonus points. Each Mission contains 4 objectives&mdash;to complete a Buddha, a Shrine, a Stupa, and/or a Pagoda with sections matching the color(s) shown on the Mission.&#10;&#10;GAME END:&#10;- Discard all cards left in your hands and discard piles.&#10;- Score points for the topmost card of any incomplete Monuments.&#10;- Score color bonuses (if any) for your completed Monument.&#10;&#10;WINNING: The player with the most points becomes the most well-respected architect, and therefore wins the game!&#10;&#10;Reviving Kathmandu is the second game in the Lemery Games Globetrotter Game Series, after Chili Mafia.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":40,"minAge":8,"categoriesAndMechanics":["Bluffing","Card Game","City Building","Party Game","Travel","Auction: Sealed Bid","Auction/Bidding","Betting and Bluffing","Deck, Bag, and Pool Building","Drawing","Market","Set Collection"],"rating":3.59798,"complexity":1.6667,"urlThumb":"https://cf.geekdo-images.com/hRD7OCAHS91fVNTMH3060w__thumb/img/eGFS_2C4xk-T0WWEUoyVpYnzg7M=/fit-in/200x150/filters:strip_icc()/pic7290095.jpg","urlImage":"https://cf.geekdo-images.com/hRD7OCAHS91fVNTMH3060w__original/img/1eHzkkk6Vjxm30_rcvQ_lJIUoqw=/0x0/filters:format(jpeg)/pic7290095.jpg"},{"bggId":"197071","name":"Gambler × Gamble!","description":"Gambler &times; Gamble! is a simple card game that won the &quot;Group SNE Contest&quot; in 2015 and published by COSAIC in 2016.&#10;&#10;Players begin the game with two gambler cards face up in front of them, two number cards (0 and 1) in their hands, and two coins in their treasury. As the game progresses, players will hire more gambler cards, receive larger number cards, and earn more coins. The major way to win the game is to earn 15 or more coins.&#10;&#10;On a player's turn, he may hire a new gambler as long as he can pay the cost. Hired gamblers are laid down face-up in front of the player.&#10;&#10;On the gambler card, there is a target number and reward amount. For example, there is a gambler card with target number 5 and reward amount 3.&#10;&#10;After optionally hiring a new gambler, the player who begins the round plays a number card face up. For the initial round, it would be 1 or 0. Then, other players play one of their number cards face down. After that, reveal all the number cards and add up the numbers. If that total equals the number of a gambler cards, any player who hired that gambler gets the reward accordingly.&#10;&#10;Play continues this way until a player collects 15 coins or more. The player with the most coins is the winner.&#10;&#10;","minPlayers":3,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Card Game","Betting and Bluffing"],"rating":3.37337,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/BV4QXYEdJtDcsPbTpCL63A__thumb/img/5mQvsVu6del_zg8V6dWu1_PAqVA=/fit-in/200x150/filters:strip_icc()/pic3078772.jpg","urlImage":"https://cf.geekdo-images.com/BV4QXYEdJtDcsPbTpCL63A__original/img/ZN7IE3DzgV1uSTwAskQ9Q5FOHa8=/0x0/filters:format(jpeg)/pic3078772.jpg"},{"bggId":"24078","name":"Lightning: North Africa on to Tobruk!","description":"From the publisher:&#10;&#10;Covering the great battles of Erwin Rommel from 1941 to 1943, as he fought his way back and forth across the deserts of North Africa. LNA uses cards to represent the military units, supply convoys and objectives of the historic campaign. To win, you must consider your units' combat power and maneuver options as well as their supply situation. The game features: the Afrika Korps, Tobruk, the Desert Rats, Malta, anti-tank guns, resupply from Europe, minefields and more. LNA is based around a new combat system that makes maneuver and planning as important as brute force. That approach is faithful to the historic events, in which smaller forces were often able to defeat and rout larger ones by using better tactics and planning. In LNA, battles can be won not only by overwhelming the enemy with firepower, but also by out-thinking and bluffing him. The dynamic game system puts you in charge of one of the most famous theaters of WWII.&#10;&#10;Lightning Game Series&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":30,"minAge":9,"categoriesAndMechanics":["Card Game","Wargame","World War II","Hand Management","Simulation"],"rating":3.271975,"complexity":2.05,"urlThumb":"https://cf.geekdo-images.com/bBiGMJHQ0_26eQMdIlCsVg__thumb/img/d9YyZsiBxNJsEHOF3Ui0FYMqwYI=/fit-in/200x150/filters:strip_icc()/pic722209.jpg","urlImage":"https://cf.geekdo-images.com/bBiGMJHQ0_26eQMdIlCsVg__original/img/ukn9yBl08t4MHEP-TXYsgAzPK4s=/0x0/filters:format(jpeg)/pic722209.jpg"}]