[{"bggId":"406961","name":"All things Impermanent:  The Battle of Dannoura","description":"The Battle of Dannoura is a Japanese doujin (fan-made) game produced by Ludens Faber. The game simulates the last battle of the Gempei War, a naval combat, between the Taira and Minamoto.&#10;&#10;The game is a typical wargame, with movement and attack values, zones of control, a CRT for combat results, and a turn track.&#10;&#10;The game includes a map, rules, historical guide, and mounted counters. The counters need to be cut out.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":120,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Wargame","Dice Rolling","Hexagon Grid","Ratio / Combat Results Table"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/tWZyRUwRZ95RdpYHwLXxbg__thumb/img/_mNW9Qrfj6plxRmKSltgGkSLEv0=/fit-in/200x150/filters:strip_icc()/pic7874658.png","urlImage":"https://cf.geekdo-images.com/tWZyRUwRZ95RdpYHwLXxbg__original/img/CQBA7NYAPgpC3TuSirF0VQEoVms=/0x0/filters:format(png)/pic7874658.png"},{"bggId":"406968","name":"Construction Kids Board Game","description":"It&rsquo;s time to start building! Get your team of builders and work together to complete a new construction project before the big storm arrives. The little builders are ready to collect the required materials from around the construction site and complete their project. But they better hurry! A big storm is on the way, and if the builders don&rsquo;t finish the project before it arrives, all their work will be washed away, and they will have to start over.&#10;&#10;In Construction Kids the little builders race around the construction site, trying to collect all the materials they need and finish their project before the storm cloud arrives. Players move across the board using numbered cards and collect their material tokens by collecting matching cards along the way. Work as a team to finish the project in time.&#10;&#10;Construction Kids uses a bright and exciting setting that makes completing a construction project fun and imaginative. This cooperative game is the perfect introduction to basic counting, strategic thinking, and teamwork. Minimal reading makes this game perfect for kids ages 4 and up.&#10;&#10;Box contains 1 game board, 4 builder tokens, 6 construction project tiles, 1 storm token, and 96 cards.&#10;&#10;-description from publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":30,"minAge":4,"categoriesAndMechanics":["Children's Game"],"rating":3.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/8NlqJbdSDurW8tM-qHAPVQ__thumb/img/rB5R5n3YYaSSRRIWOdbt1bbIdRY=/fit-in/200x150/filters:strip_icc()/pic7879087.png","urlImage":"https://cf.geekdo-images.com/8NlqJbdSDurW8tM-qHAPVQ__original/img/fd0VuTSWiSypm6q0J6vtsl2Ens8=/0x0/filters:format(png)/pic7879087.png"},{"bggId":"406970","name":"Super Kids Board Game","description":"Oh no, the town needs the Super Kids help! Gather the Super Kids and work together to help the town clean up the messes caused by the Mischief Maker and catch him before he escapes! The Super Kids are ready to race around the town collecting super gear that will help their neighbors clean up the messes made by the mean Mischief Maker. But they better be fast! If the Mischief Maker sneaks out of town before all the messes are cleaned up, he&rsquo;ll be back to cause trouble again.&#10;&#10;In Super Kids, our little heroes race around town collecting the things they need to clean up their neighbors&rsquo; messes. Players move around the board using dice with simple numbers and collect their super gear cards as they go. Work as a team to help all the neighbors and catch the Mischief Maker in time.&#10;&#10;Super Kids uses a cute and colorful setting that makes helping your neighbors and saving the day and exciting adventure. This cooperative game is the perfect introduction to basic counting, strategic thinking, and teamwork. Minimal reading makes this game perfect for kids ages 5 and up.&#10;&#10;Box contains 1 game board, 1 Mischief Maker token, 4 Super Kid tokens, 7 neighbor tokens, 2 dice, and 30 cards.&#10;&#10;-description from publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":30,"minAge":5,"categoriesAndMechanics":["Children's Game","Fantasy"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/TUlgRbQgxgWveBshV6Dn8g__thumb/img/WAY_y5hmPQL1v9A_-Ljzy2F3_tc=/fit-in/200x150/filters:strip_icc()/pic7879094.png","urlImage":"https://cf.geekdo-images.com/TUlgRbQgxgWveBshV6Dn8g__original/img/-RHfbHUhzvpCt3aFEUN18Wvcfsg=/0x0/filters:format(png)/pic7879094.png"},{"bggId":"406973","name":"Dream Apartment","description":"Humans don't care about its community, they just don&rsquo;t!&#10;Paws to business! Gather around your best domestic animals team and try to look after it.&#10;But, careful! There's another team of stray animals whom will try to destroy it.&#10;&#10;Animals go to work to the city to gather resources and use them to achieve goals, rest in its apartments. Use cards from you hand to activate effects. Block the enemy team by cancelling their actions.&#10;&#10;The team that has the most points at the end of the game, wins!&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":40,"minAge":8,"categoriesAndMechanics":["Abstract Strategy","Animals","Dice","Print & Play","Dice Rolling","Hand Management","Push Your Luck","Resource to Move","Take That","Team-Based Game","Turn Order: Pass Order","Worker Placement"],"rating":3,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/SIhWYUYytqr4_KBVxOqgVQ__thumb/img/FTa3tJnldBT-TWcjSibIchm4Vjc=/fit-in/200x150/filters:strip_icc()/pic7948027.png","urlImage":"https://cf.geekdo-images.com/SIhWYUYytqr4_KBVxOqgVQ__original/img/ASIDUDFFOYRA75qIOUFjhyiqYMo=/0x0/filters:format(png)/pic7948027.png"},{"bggId":"406974","name":"Shadow House: The Code","description":"After a series of extraordinary events, Viscount Shadow met an untimely demise. With no designated successor, the family recalled the existence of the Viscount's will, securely stored in a safe. The challenge, however, lies in the fact that nobody possesses the complete password to access the safe. The Viscount, known for his love of solving mysteries, had scattered clues throughout the mansion.&#10;&#10;In Shadow House: The Code, players assume the roles of detectives, invited to the Shadow Viscount's mansion to uncover clues that will unlock the safe. Throughout the game, you have already discovered some clues to make educated guesses about the password. You interact with your opponents, posing questions to extract additional clues, and then work towards deducing the final solution. It requires cleverness to answer accurately, as your conversation may inadvertently reveal more information to the listener. However, making a mistake in divulging secret document clues could expose your own secrets. The first person to input the correct pair of numbers while revealing the correct answer emerges victorious.&#10;&#10;This deduction game carries a lively party game atmosphere. In the course of the game, will you choose to disclose details such as the time you woke up today, your weight, or your birthday?&#10;&#10;-description from publisher&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Deduction","Multi-Use Cards","Questions and Answers"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/PrACwhWkoHBtazamBsZHOg__thumb/img/MbbuVoa5nA7i_zheYefOkU1CZJw=/fit-in/200x150/filters:strip_icc()/pic7893142.jpg","urlImage":"https://cf.geekdo-images.com/PrACwhWkoHBtazamBsZHOg__original/img/3aR6fJ0QLmVw2fWQgVzWkblf36g=/0x0/filters:format(jpeg)/pic7893142.jpg"},{"bggId":"406975","name":"A-Diccionante: Palabras Escurridizas","description":"In A-Diccionante - Palabras Escurridizas, each card contains three clues that can be: loose words, parts of words, or parts of an object's name.&#10;Before each of those clues, there is a missing word that is common to all three clues and the players must try to deduce.&#10;By adding the missing word before each clue, a new word, an everyday expression, or the name of another object will be formed.&#10;By using the exclusive &quot;3D Card Holder&quot;, the game can be played in 2 difficulty levels; in level 1 the 3 clues are shown, and in level 2 only 2 clues are shown, wich will difficult the deduction.&#10;&#10;&mdash;description from the designer&#10;&#10;En A-Diccionante - Palabras Escurridizas, cada tarjeta presenta tres pistas que pueden ser palabras sueltas, partes de palabras, o parte del nombre de un objeto.&#10;Delante de esas pistas, falta una palabra que es com&uacute;n a las tres y que los jugadores deber&aacute;n tratar de deducir. Al poner esa palabra delante de cada pista, se formar&aacute; una nueva palabra, una expresi&oacute;n cotidiana o el nombre de otro objeto.&#10;Mediante el uso del &quot;Tarjetero 3D&quot;, el juego puede jugarse en 2 niveles de dificultad; en el Nivel 1 se ver&aacute;n las 3 pistas, pero en el Nivel 2 se ver&aacute;n s&oacute;lo 2 pistas, lo que dificultar&aacute; la deducci&oacute;n.&#10;&#10;Contenido:&#10;&#10;Tablero de 22x70cm&#10;6 Fichas met&aacute;licas&#10;500 Tarjetas con 1500 pistas&#10;Tarjetero 3D&#10;Reloj de arena&#10;Cuadernillo con m&aacute;s de 555 de palabras&#10;Reglamento&#10;&#10;&mdash;description from the designer (Spanish)&#10;&#10;","minPlayers":3,"maxPlayers":12,"minPlayTime":30,"maxPlayTime":60,"minAge":13,"categoriesAndMechanics":["Deduction","Educational","Party Game","Trivia","Word Game","Cooperative Game","Deduction","Multi-Use Cards","Questions and Answers","Targeted Clues"],"rating":5,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/ZyurUCgsYCuw7HdA2heSFQ__thumb/img/EgaghAO6ARhh96VXTVTuPuS60RI=/fit-in/200x150/filters:strip_icc()/pic7879593.jpg","urlImage":"https://cf.geekdo-images.com/ZyurUCgsYCuw7HdA2heSFQ__original/img/NZuJudLbae7KY5L2TZ6IGZJ1cuU=/0x0/filters:format(jpeg)/pic7879593.jpg"},{"bggId":"406976","name":"Maligno Trip","description":"Maligno Trip is a social deduction game set in the Philippines. A game of betrayal roles, suspicious actions, and deceptive talk. Players must work together to go home to Manila, the capital city of the Philippines. Amongst the players are Maligno, a shapeshifting monster that is trying to kill them all.&#10;&#10;Going home with their car, a group of travelers will find themselves riddled by detours, wrong turns, and long routes which affects gas consumption. While the goal of the travelers is to go home, Maligno aims to consume all the gas in order to kill them before they go home.&#10;&#10;The trip will involve hidden information. As the maligno may curse and kill during the night, humans must find out who are their ally and their enemies. They must use their social skills to convince other players that they are on the good team, even if they are actually on the bad team. Actions, body language, and behavior of every player must be considered.&#10;&#10;Each day, a designated driver is elected by the group. During each turn, the driver and navigator will work together to decide which route to take. Every action is dictated by a random deck. Players must figure out if the actions of the driver are based on luck or based on deception.&#10;&#10;The objective of the Human team is to make sure the car token reach Manila. The objective of the Maligno team is to consume all gas so that the car token will not reach Manila. The board map is divided into 4 blocks or days. Each day, a designated driver is elected by the group who will decide the final action of the car token. When the car token landed on a location that is found beyond or on the boundary of blocks/days, then the night phase is initiated. Players will sleep during the night phase.&#10;&#10;The movement of the car token is dependent on turns. A navigator is assigned each turn to work with the driver. Navigators are automatically assigned counter-clockwise of the driver, starting on the right of the driver. Each turn, the navigator draws 3 action card from the deck and discards 1 action card. The navigator will pass the remaining 2 action card to the driver. The driver selects 1 action card and discards the other. A new turn will occur after the driver selects the final action card.&#10;&#10;The driver has the choice to reject any card that is handed by the navigator. Navigation rejection may only be done if the driver has not yet seen the action cards. The navigation bar on the board describes how many rejection has been made. Each day, three rejections may be done by the driver. The navigation bar resets each day. Depending on the action card, the car token may move from one location to another. Only the driver may place the car token to its proper place.&#10;&#10;Maligno, from the Filipino folklore, is a concept encompassing numerous malevolent creatures that embody misfortune, illness, and all things evil. The nature of these beings, who are often depicted as agents of chaos and suffering, are shapeshifters that are believed to inflict illness, possess individuals, manipulate dreams, and even cause death. Their presence is often associated with unusual occurrences, like inexplicable sounds, sudden illnesses, and unexplained misfortunes.&#10;&#10;-description from designer&#10;&#10;","minPlayers":4,"maxPlayers":8,"minPlayTime":10,"maxPlayTime":20,"minAge":14,"categoriesAndMechanics":["Adventure","Bluffing","Deduction","Spies/Secret Agents","Action/Event","Alliances","Cooperative Game","Deduction","Hidden Roles","Player Elimination"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/b6OsAp8l6Bwh1g9OHg7LMQ__thumb/img/x4nLE13B0IZqZcg_0VRPcrGaM0Y=/fit-in/200x150/filters:strip_icc()/pic7880665.png","urlImage":"https://cf.geekdo-images.com/b6OsAp8l6Bwh1g9OHg7LMQ__original/img/mHiuk8itIxqOJ3_JUA7_ygFIPrY=/0x0/filters:format(png)/pic7880665.png"},{"bggId":"406977","name":"Under Our Sun","description":"!!! Crowdfunding Live on Gamefound on March 12 2024 (New Date) !!!&#10;&#10;Under our Sun is a semi-cooperative exploration board game set in a post-apocalyptic world where life is at the mercy of the sun. One to four (six with Expansions) players embark on an adventure, assume the role of survivor, and join forces to reach a common goal. Players beware... everyone might not have the same goal in mind.&#10;&#10;Explore&#10;Head into the wasteland and uncover a new world, tile by tile.&#10;&#10;Craft&#10;Scavenge for crucial resources, craft unique items, weapons, and gear to prepare for the upcoming challenges.&#10;&#10;Survive&#10;Navigate an unforgiving landscape and adapt to the extreme conditions. &#10;Be it nature, human or something unknown, danger comes in many forms. Use your character's individual skills and collaborate to reach your goal and survive.&#10;&#10;Detailed description&#10;&#10;Under our Sun is a semi-cooperative, exploration board game set in a post-apocalyptic world. &#10;When a giant asteroid hits the sun, life on earth is suddenly at its mercy. Modern technology is no longer available, and the entirety of the northern hemisphere becomes a desolate hellscape as a result of the ensuing solar storms. &#10;Society&rsquo;s rules and regulations are replaced by anarchy, and every day becomes a struggle for survival.&#10;&#10;As gameplay commences, you will become an integral member of one of the few remaining honorable and socially-minded communities. Players will choose between four unique characters (six with expansions), each with their own strengths and weaknesses, and will head into the wastelands to ensure the survival of the group and fulfill crucial tasks. The game can be played with a fully-cooperative approach, or to make things extra interesting, there could also be a traitor within the group. &#10;Choose one of the four missions included in the core box, which are varied according to difficulty, play-time, and strategic approach. &#10; Under our Sun has a turn-based gameplay where each round represents a single day divided into different phases (morning, noon, evening, and night). Explore the area, tile by tile, to trigger events scattered throughout the map. Find precious loot and scavenge for resources to craft unique items in an effort to upgrade both your character and shelter. Engage in life or death fights against humans, animals, or something completely unknown. Adapt to ever changing weather conditions where even the most elementary of tasks results in a fight for survival.&#10;&#10;To succeed in this harsh land, players must manage resources, maintain their health, and ensure adequate water supply. Only through collaboration and the use of individual skills, will players be able to achieve survival and reach their ultimate goal (whatever that may be). &#10; Dive into the thrilling and complex world of &ldquo;Under our Sun,&rdquo; and become one of earth&rsquo;s final survivors!&#10;&#10;-description from designer&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":60,"maxPlayTime":180,"minAge":14,"categoriesAndMechanics":["Adventure","Dice","Exploration","Miniatures","Science Fiction","Action Points","Dice Rolling","Events","Modular Board","Scenario / Mission / Campaign Game","Semi-Cooperative Game","Solo / Solitaire Game","Traitor Game"],"rating":4.5,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/0r52y76oI7Gj-VZXxeeNeQ__thumb/img/AsmHobE61YOqguH0qoUL86iQwJI=/fit-in/200x150/filters:strip_icc()/pic7880348.jpg","urlImage":"https://cf.geekdo-images.com/0r52y76oI7Gj-VZXxeeNeQ__original/img/Bh6wHFEfkREkQnTLSTHJjyxrjeg=/0x0/filters:format(jpeg)/pic7880348.jpg"},{"bggId":"406988","name":"Kickoff","description":"Kickoff is the boardgame for real football fanatics, played with 11 pawns and corresponding cards on each team. Each card has a set of skills.&#10;&#10;The game is being played with 5 six-sided dice to move around. When interacting with an opponent a combination of dice and the skills on the player cards will decide the winner.&#10;&#10;Scoring a goal happens through the use of an action spinner, an eight-sided dice and a six-sided dice.&#10;&#10;Try to score before your opponent does in a thrilling football game!&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":2,"maxPlayers":20,"minPlayTime":30,"maxPlayTime":45,"minAge":10,"categoriesAndMechanics":["Card Game","Dice","Party Game","Sports","Dice Rolling","Moving Multiple Units","Open Drafting","Roll / Spin and Move","Score-and-Reset Game","Stat Check Resolution","Team-Based Game"],"rating":0,"complexity":0},{"bggId":"407004","name":"Slime Control","description":"Slime Control is a single-player puzzle game. The goal is to eliminate as many of the Multi-Eyed Gelatinous Cubes (D6 Dice) as possible before your last Slime is eliminated.&#10;&#10;The game setup includes tossing the dice onto the game board as a random setup each time the game is played.&#10;&#10;Slimes can take 1 of the following Actions each Turn as they take control of the Multi-Eyed Gelatinous Cubes (MEGC):&#10;Move a MEGC &#10;Grow into a Large Slime&#10;Suck Life out of a MEGC&#10;Jump onto an Adjacent MEGC&#10;Activate the Power of the MEGC&#10;&#10;Large Slimes can split into 2 smaller Slimes to take control of more MEGCs at the same time.&#10;&#10;Multi-Eyed Gelatinous Cube Powers&#10;Black    - Can only be controlled by a Large Slime. &#10;Blue    - Grow an Extra Small Slime and place it on an Adjacent MEGC, on the same turn&#10;Brown    - Starting Value is 6.    6&#10;Green    - When controlled by a Slime, it can move 2 Squares (instead of 1). &#10;Purple    - When controlled by a Slime, it can pass through a wall. &#10;Red    - UPKEEP: Automatically hunts down the nearest Slime and explodes when adjacent to the Slime. &#10;White    - Frozen and cannot be moved. &#10;Yellow    - UPKEEP: Automatically move clockwise around the board.&#10;&#10;After no additional valid moves can be made, count the number of dice remaining on the board.  The fewer dice remaining, the better the score.&#10;&#10;Required components:&#10;&#10;     A printed Dungeon Map (printed on 8.5 x 11 paper).  It contains a 6x6 grid of squares&#10;     5 Blue Glass Gems &ndash; 3 Small gems as small Slimes, 2 Large gems as large Slimes.&#10;         If you do not have gems, use 3 small coins (like dimes) and 2 larger coins (like nickels).&#10;    &#10;     Sixteen D6 Dice (2 of each of the following colors). These are the Multi-Eyed Gelatinous Cubes (MEGC) that populate the Dungeon. &#10;         2 Black&#10;         2 Blue&#10;         2 Brown&#10;         2 Green&#10;         2 Purple&#10;         2 Red&#10;         2 White&#10;         2 Yellow &#10;    &#10;&#10;&#10;Each Turn is made up of two Phases, Action and Upkeep.&#10;&#10;     During the Action Phase, the Player controls the Slime(s) on the board.&#10;     During the Upkeep Phase, the Player moves the Dice per specific rules.&#10;&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":20,"maxPlayTime":40,"minAge":10,"categoriesAndMechanics":["Dice","Fantasy","Print & Play","Puzzle","Different Dice Movement","Grid Movement","Pick-up and Deliver","Solo / Solitaire Game","Square Grid","Worker Placement with Dice Workers"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/D4J02pinoRHSQdAwCbHNCg__thumb/img/0FsGj86DxDPXH7XZxB2pzpw9SS4=/fit-in/200x150/filters:strip_icc()/pic7895694.png","urlImage":"https://cf.geekdo-images.com/D4J02pinoRHSQdAwCbHNCg__original/img/NhdhV2_h0ej805wwgskwb710rq0=/0x0/filters:format(png)/pic7895694.png"},{"bggId":"407005","name":"Escape Room the Game: Tuplapakkaus","description":"Includes two Escape Room the Game scenarios from 2017, both in Finnish:&#10;&#10;Escape Room: The Game &ndash; Secret Agent (2017) &#10;The new, self-named country of Zekestan holds the world in its grasp. Their show of power and threatening language about their secret weapon is absolutely frightening. The way in which the new President came to power seems only a small taste of what his sick mind is up to. There is only one way to stop him, and you have to find that way with your team of specialists! If you are caught, any involvement by your government will be denied and you are on your own &mdash; and you know what they do with traitors in Zekestan...&#10;&#10;Escape Room: The Game &ndash; Space Station (2017) &#10;In this expansion you are on a mission in space. But after an explosion this dream has become a nightmare. The oxygen reserve is enough for 60 minutes and your last chance is to take the escape shuttle. But you don't know the password to enter it ...&#10;&#10;","minPlayers":3,"maxPlayers":5,"minPlayTime":60,"maxPlayTime":60,"minAge":16,"categoriesAndMechanics":["Electronic","Puzzle","Cooperative Game","Deduction","Elapsed Real Time Ending"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/vwtWTmkJDSxWC1LPX6WgUA__thumb/img/_fhEkCWfJue5F6B7GeZ5SyQKK4M=/fit-in/200x150/filters:strip_icc()/pic7889262.jpg","urlImage":"https://cf.geekdo-images.com/vwtWTmkJDSxWC1LPX6WgUA__original/img/-dHAUJOtyVWvWd6k3Y_4Tc-iEvE=/0x0/filters:format(jpeg)/pic7889262.jpg"},{"bggId":"407006","name":"Knives Out","description":"The queen is dead! Long live the next heir or heiress or pet who survives this fierce battle of backstabbing, betrayal and dirty tricks.&#10;&#10;Place one candidate for the throne between every two players and two more in the center of the table.&#10;Each player chooses one of their cards, the number on it will determine the turn order. In that order, the players use the ability of the card on the table, available, furthest to the left, covering the old card with which they have played and, thus, create the new sequence of abilities for the next round.&#10;&#10;At the end of the game the candidates for the throne with more daggers than resistance will be eliminated. The candidate with the lowest value alive will be the worthy successor, and the players who are next to him will be the winners... If any...&#10;&#10;","minPlayers":3,"maxPlayers":10,"minPlayTime":20,"maxPlayTime":25,"minAge":8,"categoriesAndMechanics":["Renaissance","Hand Management","Hidden Roles","Simultaneous Action Selection","Take That"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/TCXitk2eG8sL1nbOjKGQDA__thumb/img/sRVfAn96oohpqr47TBiJPpxwGjs=/fit-in/200x150/filters:strip_icc()/pic7883156.png","urlImage":"https://cf.geekdo-images.com/TCXitk2eG8sL1nbOjKGQDA__original/img/KP33XfnKaVktGA7KCA84bed9OAk=/0x0/filters:format(png)/pic7883156.png"},{"bggId":"407008","name":"Tornado","description":"We are receiving reports of strong and unusual tornado activity never seen before. Meteorological satellites are unable to provide the information necessary to understand this disaster, which is why the government has launched the G.A.L.E. emergency protocol. (Gigantic Air Loop Extermination), in which several teams of tornado hunters will enter risk areas to obtain reliable information by taking photos.&#10;&#10;Secretly program your jeep's movement and your action this turn. In order, move the jeeps around the map trying to get the best position to take the best photos of the tornado and prevent the other players from falling into your square.&#10;&#10;Then carry out the action, if you can, take a photo of the tornado or take the opportunity to buy new skills.&#10;&#10;The best tornado chaser will win the game.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Simultaneous Action Selection"],"rating":5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/OcQtIz5OgRvZZBtSZyKOXQ__thumb/img/0jeree41W64CjqrCh5if5dUxEuo=/fit-in/200x150/filters:strip_icc()/pic7883260.jpg","urlImage":"https://cf.geekdo-images.com/OcQtIz5OgRvZZBtSZyKOXQ__original/img/vyhfYCe3GII7w6X6qRpOKM7oC-U=/0x0/filters:format(jpeg)/pic7883260.jpg"},{"bggId":"407009","name":"The Warrior Within Underground","description":"The Warrior Within is a fast paced card game with a focus on boxing first turn you draw 7 cards and face off with your opponent, using defensive, attack and utility cards to knock your opponent down. After the opponent is knocked down the opponent has to roll d6 according to their heart score. If the fighter rolls a 6 on any of the heart rolls the opponent gets off the canvas to keep fighting with a penalty to the fighters heart score. No judges no decisions you brawl till you fall.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":1,"maxPlayTime":10,"minAge":12,"categoriesAndMechanics":["Card Game","Fighting","Dice Rolling"],"rating":5,"complexity":0},{"bggId":"407010","name":"The Secret Flower","description":"A co-operative deduction 16 card micro-game where players must use limited communication to deduce the identity of a single secret card (the &quot;Secret Flower&quot;). Released as a promotional game during Asian Board Games Festival (ABGF) 2023 at Singapore, this game features flowers from the participating countries.&#10;&#10;To play, set aside one hidden card as the Secret Flower. Of the remaining cards, about half are given to players who shall keep these flowers' face down and identities hidden, and half are given to the players as playable hand cards. Players take turns playing their hand cards, strategically asking the questions on those cards in order to reveal partial information on the face down cards. When all cards have been played, most (in the standard game) or all (in the Expert difficulty game) of the players must be able to logically deduce the identity of the Secret Flower in order to win.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":20,"maxPlayTime":20,"minAge":10,"categoriesAndMechanics":["Card Game","Deduction","Puzzle","Communication Limits","Cooperative Game","Questions and Answers"],"rating":3.78889,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/qr-hJDWTyYJ0jiYCk5cGKg__thumb/img/yGKoYDUykNhWqTrysDlSkGRvoAE=/fit-in/200x150/filters:strip_icc()/pic7876500.jpg","urlImage":"https://cf.geekdo-images.com/qr-hJDWTyYJ0jiYCk5cGKg__original/img/gp8xj5Q2-t3O5muNTZrdeDS92mA=/0x0/filters:format(jpeg)/pic7876500.jpg"},{"bggId":"407011","name":"Wildlife Dice","description":"Step into the shoes of a park ranger. Create a home for many wild animals. Plant various trees, place lakes and meadows, to create suitable environment for every species of wildlife to live in. Invite animals to habitats you created - the greater the diversity of your park, the higher your point total will be.&#10;&#10;In the base game you will create Bialowieza National Park. It is the second oldest National Park in Poland. It is home to wisent, also known as European bison - the biggest European land mammal and the symbol of the park itself.&#10;&#10;Wildlife Dice involves a lot of strategy. Planning ahead is crucial for perfect alignment of different habitats. There is a great sense of accomplishment when you create perfect place to live for your happy animals.&#10;&#10;Wildlife Dice is a print and play game. All you need is a set of two standard six sided dice and 4 color pencils. Then you will give every player a gaming sheet with a writing tool, and you can start playing.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":99,"minPlayTime":20,"maxPlayTime":45,"minAge":8,"categoriesAndMechanics":["Animals","Children's Game","Dice","Print & Play","Dice Rolling","Paper-and-Pencil","Pattern Building"],"rating":3.75,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/zUHxg_30WPKOJtmcec9uZw__thumb/img/V5svu-5Q2eZVsBEqxN_IGjHSwqE=/fit-in/200x150/filters:strip_icc()/pic7877894.jpg","urlImage":"https://cf.geekdo-images.com/zUHxg_30WPKOJtmcec9uZw__original/img/6sXAdNXUD68ID5Xw108wIHVRMkQ=/0x0/filters:format(jpeg)/pic7877894.jpg"},{"bggId":"407012","name":"Night Princess","description":"&#233;&#154;&#160;&#227;&#130;&#140;&#232;&#186;&#171;&#227;&#129;&#174;&#227;&#131;&#138;&#227;&#130;&#164;&#227;&#131;&#136;&#227;&#131;&#151;&#227;&#131;&#170;&#227;&#131;&#179;&#227;&#130;&#187;&#227;&#130;&#185; (Night Princess) is a werewolf-style game from Japan, in which two teams try to identify the leader of the opposing team and defeat them. However, if a non-leader is defeated, the attacking team loses.&#10;&#10;The game has decks of cards to identify the two teams and the players' roles in their team, and item cards which are used for attack. Once the teams are established, the items cards are dealt out to form player hands.&#10;&#10;On their turn, a player plays an item card as an attack and places a damage token on it, and directs this against an opponent. The damage token represents a clue as to the identity of the attacker. The item cards have unique abilities which aid in the attack.&#10;&#10;Once the attack is resolved, the victim becomes the next player to attack if possible.&#10;&#10;The game continues in this manner until somebody is defeated, and reveals their hidden identity. If they were the leader, the opposing team wins. If not, the opposing team loses.&#10;user summary&#10;&#10;","minPlayers":2,"maxPlayers":13,"minPlayTime":15,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Bluffing","Deduction","Fantasy","Deduction","Hidden Roles","Player Elimination","Roles with Asymmetric Information","Team-Based Game","Variable Player Powers"],"rating":0,"complexity":0},{"bggId":"407013","name":"Host Your Own Murder Mystery: Murder At The Mansion","description":"It's the 1970's and there's been a murder! Charlie Rosemary has been found murdered at the Rosemary's mansion in spooky Salem, Massachusetts during a costume party.   Friends and family have to remain in the mansion all night whilst the local police investigate!&#10;&#10;","minPlayers":0,"maxPlayers":13,"minPlayTime":0,"maxPlayTime":0,"minAge":12,"categoriesAndMechanics":["Deduction","Murder/Mystery"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/_VV-aSiMsUXpj8DMC0a1Hw__thumb/img/zBJGzwfbdUE3bapyFoiD5LmQ3tg=/fit-in/200x150/filters:strip_icc()/pic7876031.jpg","urlImage":"https://cf.geekdo-images.com/_VV-aSiMsUXpj8DMC0a1Hw__original/img/aOr4AhFbDj3GIT4aCHgeo-MyA4w=/0x0/filters:format(jpeg)/pic7876031.jpg"},{"bggId":"407014","name":"Princess & Werewolf","description":"&#229;&#167;&#171;&#227;&#129;&#168;&#228;&#186;&#186;&#231;&#139;&#188; (Princess &amp; Werewolf) is a werewolf-style game from Japan which re-implements Night Princess from 2015 into a broader game design.&#10;&#10;The players are either in the Red or Blue team, and must identify and defeat the other team's leader (the Princess) to win. If a non-leader is defeated, the attacking team loses. Players have secret roles in the game, and use item cards to attack on opposing character, adding a token which gives a clue to their own identity. Players also have sword and shield tokens to use, and witch tokens.&#10;&#10;The new game differs by having each player run a number of characters in their team. This allows broad gameplay with just two players. Further, players do not start the game knowing who their allies are, and the characters include a werewolf who is a traitor to the team. If the werewolf can identify the princess, they win outright.&#10;&#10;When the game was first produced at the Tokyo Game Market in December 2023, pre-orders received some bonus cards:&#10;&#10;Hidden Princess - This character allows the leader to be switch amongst the other characters. The Hidden princess is more powerful than the normal Princess, and enables the game to played longer.&#10;&#10;Cursed Werewolf - If the cursed werewolf identifies the opposing Princess, the game does not end, and the team's leader may switch to another character.&#10;user summary&#10;&#10;","minPlayers":2,"maxPlayers":13,"minPlayTime":20,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Bluffing","Deduction","Fantasy","Negotiation","Deduction","Hidden Roles","Negotiation","Player Elimination","Roles with Asymmetric Information","Sudden Death Ending","Team-Based Game","Traitor Game","Variable Player Powers"],"rating":0,"complexity":0},{"bggId":"407015","name":"Manchomémo","description":"Manchom&eacute;mo is a funny memory based game which target is getting points remembering and guessing several kinds of animals until the penguin is discovered.&#10;&#10;Then the Game is over and the winner is the player with the most scoring.&#10;&#10;What's hiding on the other side of the card? You will need a memory like an elefant to win as many cards as you can just before the hiden penguin appears in order to finish the game.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":45,"minAge":6,"categoriesAndMechanics":["Animals","Memory"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/aOJbXJlOvX72RGKTRNpz-Q__thumb/img/lGkpqPlC2dMZMQfvU8tRqgEVU6I=/fit-in/200x150/filters:strip_icc()/pic7878793.jpg","urlImage":"https://cf.geekdo-images.com/aOJbXJlOvX72RGKTRNpz-Q__original/img/RPLKZWsNEtaLWJ_XduZJFAbWUAw=/0x0/filters:format(jpeg)/pic7878793.jpg"},{"bggId":"407017","name":"Escape Room: Ancient Egypt Edition","description":"Travel back in time and embark on a high stakes Egyptian adventure from the comfort of your own home - ideal for family nights in the chillier months. The mighty pharaoh has been woken up from his eternal slumber and holds you responsible. Can you and your team work together to solve the puzzles in just 60 minutes and uncover the spell to restore his sleep in order to escape his curse? Aimed at a younger audience than our other escape room games, this adventure has an easy difficulty level and is suitable for ages 9+. A smart phone, tablet or watch is required for the interactive elements of this game.&#10;&#10;Contents includes:&#10;An Instruction booklet, 12x Game Puzzles, 8x Tracing Paper Sheets, 1x Notepad, 1x Interactive Ending and a Photobooth Frame.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":60,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Deduction","Murder/Mystery","Puzzle","Real-time","Cooperative Game","Deduction","Real-Time"],"rating":3.5,"complexity":0},{"bggId":"407018","name":"ソクラテスラ 拡張版 (Sokuratesura shi no presentation)","description":"&#227;&#130;&#189;&#227;&#130;&#175;&#227;&#131;&#169;&#227;&#131;&#134;&#227;&#130;&#185;&#227;&#131;&#169;&#239;&#189;&#158;&#227;&#130;&#173;&#227;&#131;&#161;&#227;&#131;&#169;&#227;&#131;&#134;&#227;&#130;&#163;&#227;&#131;&#131;&#227;&#130;&#175;&#229;&#129;&#137;&#228;&#186;&#186;&#227;&#131;&#144;&#227;&#131;&#136;&#227;&#131;&#171;&#239;&#189;&#158;&#230;&#139;&#161;&#229;&#188;&#181;&#231;&#137;&#136; (Sokuratesura shi no presentation) (Socratesura - Battle Of The Chimeric Greats - Extended Death Edition) is a stand-alone expansion to &#227;&#130;&#189;&#227;&#130;&#175;&#227;&#131;&#169;&#227;&#131;&#134;&#227;&#130;&#185;&#227;&#131;&#169; (SocraTesla). This game introduces more legendary figures with which to build your chimera, and adds right-hand weapons too, making your fighters even more powerful. The player's hand size is increased to 8 cards, making it easier to summon the heroes.&#10;&#10;Combining the two games allows 12 players in one game.&#10;- user description&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":15,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Card Game","Fighting","Humor","Party Game","Hand Management","Set Collection","Trading"],"rating":4,"complexity":0},{"bggId":"407019","name":"Marvel Guardians of the Galaxy: The Groot Escape","description":"Introducing the fast-grabbing, loot-snatching charades game &ndash; The Groot Escape! Perfect for Guardians of the Galaxy fans and Marvel enthusiasts everywhere. Be the player with the most &quot;Units&quot; to win and more importantly &ndash; bragging rights over your fellow Guardians!&#10;&#10;HOW TO PLAY?&#10;&bull; Baby Groot is the only Guardian that is left back on the ship getting mission details.&#10;&bull; Unfortunately, he can only use actions to help you (charades-style) and only say &quot;I am Groot!&quot; to describe the specific item you need to get.&#10;&bull; You'll have limited time to understand Groot and then grab the item. Grab the correct item, you'll keep the bounty.&#10;&bull; But grab the wrong item, you risk triggering an alarm or even worse, not getting paid. Be the player with the most Units to win.&#10;&#10;Contents:&#10;- 62 cards&#10;- 9 jumbo cards&#10;- 1 punch sheet&#10;- rulebook&#10;&#10;","minPlayers":3,"maxPlayers":7,"minPlayTime":20,"maxPlayTime":20,"minAge":10,"categoriesAndMechanics":["Comic Book / Strip","Deduction","Movies / TV / Radio theme","Party Game","Real-time","Science Fiction","Word Game","Communication Limits","Real-Time"],"rating":2.916665,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/Frf8f061gHLT-PoNBWwdng__thumb/img/rwffEQ4QVaRRJuwmrj62hqCtp6k=/fit-in/200x150/filters:strip_icc()/pic7899556.png","urlImage":"https://cf.geekdo-images.com/Frf8f061gHLT-PoNBWwdng__original/img/HAv8uUuwBVFST3-Ow-UsIJEqlyM=/0x0/filters:format(png)/pic7899556.png"},{"bggId":"407020","name":"Only Fools Rush In","description":"How close can you get to the dragon without getting eaten?&#10;&#10;Send your three heroes on a dangerous mission to gain renown and hopefully steal a couple gems from the dragon. But be careful&hellip; get too close and you may not return at all&hellip;&#10;&#10;On your turn:&#10;Flip a card to reveal movements and place it beside the top card on the colors deck. You may change orientation to best suit your goal. Strategically, move the heroes in any order you wish. When moving, skip completely over occupied spaces. Once any player has entered the cave, there will be one more turn to see if they can keep their spot in the cave. If they are still in the cave at the end of the turn, the game ends and everyone scores points based on how close they are to the cave.&#10;&#10;Solo play introduces a brain bending puzzle to the mix as you must control 4 heroes of different colors, but end up as close to the dragon as you can in a certain order.&#10;&#10;A bidding variation allows you to predict what hero will win and gain points while it gradually becomes more and more obvious who will win. If they don&rsquo;t get eaten, that is.&#10;&#10;-description from designer&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Adventure","Exploration","Medieval","Move Through Deck","Moving Multiple Units","Push Your Luck","Relative Movement","Solo / Solitaire Game"],"rating":0,"complexity":0},{"bggId":"407033","name":"Viva el Cristo Rey!: Wargame Rules for the Spanish Civil War of 1936-1939","description":"Miniatures rules written for 1/72 or 1/76 scale, with each base representing an infantry company or cavalry squadron.&#10;&#10;","minPlayers":1,"maxPlayers":8,"minPlayTime":120,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Civil War","Miniatures","Wargame","Dice Rolling","Scenario / Mission / Campaign Game"],"rating":0,"complexity":0},{"bggId":"407034","name":"Draft Duel: Fantasy Football Card Game","description":"Fantasy Football is huge: Seems like everyone has a fantasy football team. This card game sees players drafting cards to form their football team and then playing them at the right time over the course of the five-game weekend, starting with the Thursday Night game through to the Monday Night game. Play the right combination of cards and you can hold a post game press conference to earn extra points.&#10;&#10;The game plays from 1-4 players with a number of additional solitaire options.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":10,"maxPlayTime":20,"minAge":8,"categoriesAndMechanics":["Card Game","Sports","Closed Drafting","Hand Management","Solo / Solitaire Game"],"rating":4.113335,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/iUTx22EN-yNhTswJW0D1iA__thumb/img/ZtSu46U4DkWPgMjR3657WtBHNGw=/fit-in/200x150/filters:strip_icc()/pic7875877.jpg","urlImage":"https://cf.geekdo-images.com/iUTx22EN-yNhTswJW0D1iA__original/img/S78bW9x0ysAk0kc0qOv4V6NT6h0=/0x0/filters:format(jpeg)/pic7875877.jpg"},{"bggId":"407036","name":"SD Gundam: Battle of the Sky Castle","description":"This is an LSI Electronic game centered around the SD Gundam franchise.&#10;&#10;The game involves both sides moving their pieces on a board in an attempt to capture each other's base.  When the time comes to resolve combat, the attacking and defensing pieces are placed into a machine which animates the battle and determines the outcome.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":60,"minAge":6,"categoriesAndMechanics":["Electronic","Wargame","Square Grid"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/-XXWEP-fQm9HOOShpQvQMA__thumb/img/LJGEIerxLIAOLiyRl0yjoEFUFd4=/fit-in/200x150/filters:strip_icc()/pic7876481.png","urlImage":"https://cf.geekdo-images.com/-XXWEP-fQm9HOOShpQvQMA__original/img/1HQskirhRuBJ73tQ-vnh3eIkCNE=/0x0/filters:format(png)/pic7876481.png"},{"bggId":"407037","name":"SD Gundam: GARMS Command Grand Strategy","description":"This is an LSI electronic game using the SD Gundam franchise.&#10;&#10;This is a wargame in which two players fight in an attempt to take each other's base out.  The game has electronic counters which, when one player attacks another, are placed inside a device that animates the battle and displays the results.&#10;&#10;Once a player invades their opponent's base, the land map is changed and they fight inside the headquarters.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":60,"minAge":8,"categoriesAndMechanics":["Electronic","Science Fiction","Wargame","Hexagon Grid"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/KZFQA9pgR7u2bv7zENoFiA__thumb/img/L0rSYVEeJd6MWfk6wrVpNZFiojE=/fit-in/200x150/filters:strip_icc()/pic7876542.png","urlImage":"https://cf.geekdo-images.com/KZFQA9pgR7u2bv7zENoFiA__original/img/I0A9t25POxgcQxcvNAnpx0S5ztU=/0x0/filters:format(png)/pic7876542.png"},{"bggId":"407046","name":"Velikiye Luki: Stalingrad of the North","description":"The Battle of Velikiye Luki, sometimes called The Stalingrad of the North, was fought during the Winter Campaign of 1942-1943. It was part of the northern pincer of the Rzhev-Sychevka Strategic Offensive (Operation Mars). The Soviet objective was to liberate the Russian city of Velikiye Luki and to cut the north-south rail line to the west of the city.&#10;&#10;Rather than attacking the town directly, the Soviet forces advanced into the difficult terrain to the north and south of the town. Despite heavy losses, they successfully cut the land links to the city, trapping the garrison. Hitler demanded that all the surrounded formations hold out while relief forces counterattacked to open a route to the encircled units. The garrison held out against repeated and determined Russian assaults. In the meantime, Soviet attempts to take their main objective, the rail lines at Novosokolniki, had been frustrated by the counter-attacks of the relief force. An attempt by the Germans to reach Velikiye Luki in late December ran into stubborn Soviet defense and was halted. The German garrison finally surrendered on January 16th.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":120,"minAge":16,"categoriesAndMechanics":["Wargame","World War II","Hexagon Grid","Simulation"],"rating":3.75781,"complexity":1.75,"urlThumb":"https://cf.geekdo-images.com/dipcNdi85qu9aJ1yU6Up2Q__thumb/img/vt94IUAdUIa6ri9wI8viLmRmj9Y=/fit-in/200x150/filters:strip_icc()/pic7875853.jpg","urlImage":"https://cf.geekdo-images.com/dipcNdi85qu9aJ1yU6Up2Q__original/img/5Kp1YV-2X7Zop87swqxsRHYXzsA=/0x0/filters:format(jpeg)/pic7875853.jpg"},{"bggId":"407064","name":"Cake-N-Bake Challenge","description":"Cake-N-Bake Challenge is a competitive game focused around stacking foam pieces to create a cake shown on the game card players are given. Players can win a Candle Card by being the first to stack the cake correctly, and the first to receive six of these cards is the winner and gets to wear the Chef's Hat. During gameplay, Special Action Cards can be drawn that change the way players must stack their cakes. Examples include stacking the cake with one hand, in the reverse order of what is seen on the game card, or from memory after viewing the game card for 10 seconds. The game can be played in three ways, but the main objective is always the same.&#10;&#10;Beginner Bakers (2-6 Players): Players start with foam cake pieces in all six colors and two different double-sided icing pieces that is theirs to keep throughout the game.&#10;&#10;Mixin' Madness (2-6 Players): All pieces (cake and icing) are mixed together in the middle of the table at the start of the game.&#10;&#10;Bakery Bakeoff (Sensory Play, 2-3 Teams): All pieces (cake and icing) are mixed together in the middle of the table at the start of the game. Each team picks one player as the Lead Baker, and one as the Assistant Baker. The Assistant Baker has their eyes closed, and must be instructed by the Lead Baker on how to bake the cake while feeling for pieces with the correct texture. The winning team receives the Candle Card at the end of the round.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":4,"categoriesAndMechanics":["Action / Dexterity","Children's Game","Memory","Cooperative Game","Memory","Simultaneous Action Selection","Stacking and Balancing","Team-Based Game"],"rating":0,"complexity":0},{"bggId":"407065","name":"Hunt A Killer: Whodonut? – A Murder Mystery Jigsaw Puzzle Game","description":"Fred Jackson Jr., the co-owner of Do Not Not Donut was killed behind the counter while opening up the shop. You will assume the role of a deputized detective trying to finish the work of ace investigator, Detective Frage. Along the way, you&rsquo;ll put the pieces together to reveal the crime scene, answer the lingering questions in the Detective&rsquo;s Notebook, and choose the right pieces from the Answer Board to fill in the blanks and solve the case.&#10;&#10;Whodonut? isn&rsquo;t just about putting together a jigsaw puzzle. This 1000-piece puzzle has a story behind it. First, you&rsquo;ll solve the puzzle. As a deputized detective, you&rsquo;ll also have a notebook that contains the details of the crime, information about the victim, and interviews with the three suspects. The notebook contains six unanswered questions about the case. Answer them correctly to complete the puzzle and solve the murder!&#10;&#10;Difficulty: 1/5 (Easy).&#10;&#10;Contents:&#10;- 1,000 jigsaw puzzle pieces&#10;- 6 blank pieces&#10;- A detective&rsquo;s notebook&#10;- An answer board&#10;- A solution envelope&#10;&#10;","minPlayers":1,"maxPlayers":99,"minPlayTime":60,"maxPlayTime":300,"minAge":14,"categoriesAndMechanics":["Deduction","Murder/Mystery","Puzzle","Cooperative Game","Deduction","Solo / Solitaire Game"],"rating":3.083335,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/9zn8IxVdNdIHihGL5-vdMQ__thumb/img/cfrpUgiYQp826lgHoaP7p6Mcm54=/fit-in/200x150/filters:strip_icc()/pic7875743.jpg","urlImage":"https://cf.geekdo-images.com/9zn8IxVdNdIHihGL5-vdMQ__original/img/4pjEXw8in30qZNtSKLJhtmH0hZM=/0x0/filters:format(jpeg)/pic7875743.jpg"},{"bggId":"407173","name":"LOOP","description":"How well can you play the same cards as someone else?&#10;&#10;In the first round of LOOP, each player receives a hand of eleven cards from a deck of three suits, with each suit having cards numbered 1-15. They each choose two cards to set aside face down.&#10;&#10;The lead player starts the first trick by laying down a single card, a pair of the same number, or two or more consecutive cards of the same suit. The next players in turn must play a higher matching combination of cards or pass, although a player who passes can re-enter the trick later. Once everyone passes, the player who won the trick leads again. (Note that all played cards stay in front of who played them.)&#10;&#10;If a player lays down an 8, whether alone or in combination, everyone else must pass, then this player leads a new trick. If a player runs out of cards, they score points based on how many players still have cards in hand, and play continues until all but one player goes out.&#10;&#10;The last player then takes over a player's seat: first in a two-player game, second in a three-player game, and first or second in a four-player game (with the third player then taking the other option). After moving to their new locations, players then take the eleven cards in front of them, discard two, then play the round again. If the player in the fourth seat can do better than fourth, they score points &mdash; lots of points if they come in first. Along the same lines, if the player in the first seat does poorly, they lose points.&#10;&#10;If a player has set aside an 8 in their two cards, they can declare &quot;&#227;&#129;&#169;&#227;&#130;&#147;&#227;&#129;&#167;&#227;&#130;&#147;&quot; (donden = revolution) by revealing the card on their turn. Now 1s are the high cards and 15s the low ones for the remainder of the round.&#10;&#10;Play multiple rounds until a player has reached the point threshold, which is based on the player count.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":15,"minAge":0,"categoriesAndMechanics":["Card Game","Hand Management","Ladder Climbing"],"rating":3.69524,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/5MLtsKvtUgOUTFkg-F_KTw__thumb/img/obfPhk2IUSh7Y4I9vilLL5wSV14=/fit-in/200x150/filters:strip_icc()/pic7875910.jpg","urlImage":"https://cf.geekdo-images.com/5MLtsKvtUgOUTFkg-F_KTw__original/img/upSGyaTLA53SBMu_Yg3bWRRjzeA=/0x0/filters:format(jpeg)/pic7875910.jpg"},{"bggId":"407174","name":"Crimen en Casa: Sincharro Case","description":"The first case from Crimen en Casa. A series of detective games where you need to help solving the crime.&#10;&#10;In this case Jorge was found dead in his office in the city of Sincharro. With the help of the evidence found, a city map, the local newspaper, witness statements, social profiles, digital trails and more. Follow the evidence, check the alibis and find the culprit.&#10;&#10;Can you solve the murder mystery?&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":90,"maxPlayTime":180,"minAge":14,"categoriesAndMechanics":["Murder/Mystery","Action/Event","Deduction","Events"],"rating":4,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/6NxpcRouReZthXQPl2sNwg__thumb/img/E8MkB5Oua4jjMmsLRxejmu0_4UA=/fit-in/200x150/filters:strip_icc()/pic7972405.png","urlImage":"https://cf.geekdo-images.com/6NxpcRouReZthXQPl2sNwg__original/img/synuFF-u7yq7W2APAmsTMeONNgY=/0x0/filters:format(png)/pic7972405.png"},{"bggId":"407175","name":"3Stein","description":"The battle for the three castles&#10;The peaceful coexistence of three castle lords is over and the gauntlet has been thrown down. Now they go into battle with their knights and squires. Everyone against everyone. How will this battle end? Which lord of the castle will be defeated first? And by whom? After all, three strong rivals are facing each other - there can only be one winner in this battle! But even the lord of the castle who is knocked out of the field first still has a chance of winning as a vassal.&#10;Strategic thinking, ingenious tactics and sensitive empathy are required, but a little luck is also necessary.&#10;&#10;","minPlayers":3,"maxPlayers":3,"minPlayTime":20,"maxPlayTime":40,"minAge":10,"categoriesAndMechanics":["Abstract Strategy","Area Movement"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/NaJyuCwRLv7T2ssV0sNCGg__thumb/img/K13qr3Or-l9kttBv4dVkvo__hGU=/fit-in/200x150/filters:strip_icc()/pic8072451.jpg","urlImage":"https://cf.geekdo-images.com/NaJyuCwRLv7T2ssV0sNCGg__original/img/_o3psVpLPdQCRhhJmz-Fby0cOAo=/0x0/filters:format(jpeg)/pic8072451.jpg"},{"bggId":"407176","name":"指輪を落とさないで (Don't Drop Your Ring)","description":"&#230;&#140;&#135;&#232;&#188;&#170;&#227;&#130;&#146;&#232;&#144;&#189;&#227;&#129;&#168;&#227;&#129;&#149;&#227;&#129;&#170;&#227;&#129;&#132;&#227;&#129;&#167; (&quot;Don't Drop Your Ring&quot;) is a trick-taking game with seven unbalanced suits. You try to predict how many tricks you'll win, but if you win a trick that contains the same number as the card you used, then the win counts twice! If you miss your bid, you lose points, which is symbolized by a ring falling lower on your finger. (The ring is on a plastic sheet that you slide lower on a hand scoring card.)&#10;&#10;If the ring falls off your finger, you lose.&#10;&#10;","minPlayers":3,"maxPlayers":5,"minPlayTime":20,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Card Game","Trick-taking"],"rating":3.358335,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/Hn3DdzQdiOxwmZ2IYJc6Mw__thumb/img/H_7J0i29WXKZz0wEw-fELOpJWQA=/fit-in/200x150/filters:strip_icc()/pic7876020.png","urlImage":"https://cf.geekdo-images.com/Hn3DdzQdiOxwmZ2IYJc6Mw__original/img/gmNylpOcN371c_tCZEBkt4sYYJA=/0x0/filters:format(png)/pic7876020.png"},{"bggId":"407178","name":"Outlive: Complete Edition","description":"Outlive and the Underwater expansion combined in a single box.&#10;&#10;&mdash;user summary&#10;&#10;2079 : Apr&egrave;s une Guerre Nucl&eacute;aire qui a tout d&eacute;vast&eacute;, 4 clans de Survivants se terrent dans leur Abri souterrain. Leur seul espoir vient du &laquo;Convoi&raquo;, une organisation qui recherche les Survivants les plus dignes d&rsquo;int&eacute;grer les cit&eacute;s subaquatiques secr&egrave;tes&hellip; o&ugrave; les places sont limit&eacute;es.&#10;&#10;Apr&egrave;s des ann&eacute;es d&rsquo;absence, Outlive revient en boutique dans cette nouvelle &eacute;dition compl&egrave;te.&#10;&#10;Retrouvez tout le contenu original de Outlive, ainsi que celui de son extension Outlive &ndash; Underwater, et &eacute;galement le Mode Solo. Le tout, au m&ecirc;me prix que le jeu de base &agrave; l&rsquo;&eacute;poque de sa sortie !&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":90,"minAge":14,"categoriesAndMechanics":["Science Fiction","Area Majority / Influence","Area Movement","Events","Set Collection","Solo / Solitaire Game","Variable Phase Order","Variable Set-up","Worker Placement, Different Worker Types"],"rating":0,"complexity":0},{"bggId":"407179","name":"Game Against Grey's Anatomy","description":"Similar to &quot;Cards Against Humanity&quot;, but specifically for fans of the TV show &quot;Grey's Anatomy.&quot;&#10;&#10;To start, the player who does the best imitation of the character 'Meredith' begins as the &quot;judge&quot; and is referred to as &quot;Queen Meredith.&quot; This person draws and reads the question or fill-in-the-blank phrase on the first black card. The players have previously been dealt or draw ten white phrase cards. Each player selects one phrase card and passes it face-down to Queen Meredith, who then shuffles them all together. Queen Meredith then reads each card combination with the group. For a fuller effect, Queen Meredith should re-read the black card with each of the white cards.&#10;&#10;Queen Meredith then chooses which combination they think is funniest, and the player who submitted that card receives one point. A new Queen Meredith is then selected and draws and reads a new black card, while the other players draw their hand back up to ten white cards.&#10;&#10;Play proceeds until a pre-determined number of rounds have been played, with the point leader being the winner, or one of the players reaches a pre-determined number of points.&#10;&#10;","minPlayers":4,"maxPlayers":20,"minPlayTime":30,"maxPlayTime":90,"minAge":17,"categoriesAndMechanics":["Card Game","Humor","Mature / Adult","Movies / TV / Radio theme","Party Game","Hand Management","Player Judge","Simultaneous Action Selection"],"rating":0,"complexity":0},{"bggId":"407180","name":"Ganz schön clever: Deluxe","description":"Roll and choose the best dice in Ganz sch&ouml;n clever: Deluxe, then enter them in the matching colored areas on your score sheet, triggering chains to score points! But all the dice you don't use can be chosen by the other players, keeping everyone in the game at all times.&#10;&#10;Ganz sch&ouml;n clever: Deluxe includes the original Ganz sch&ouml;n clever scoresheet as well as a second scoresheet that uses mechanisms of all four released titles: Ganz sch&ouml;n clever, Doppelt so clever, Clever hoch drei, and Clever 4-ever. The scoresheets are laminated, and the box includes a dice tower.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Dice","Number","Dice Rolling","Highest-Lowest Scoring","Paper-and-Pencil","Re-rolling and Locking","Solo / Solitaire Game"],"rating":4.083335,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/1YEb_dXUnNg__emgKzpLHw__thumb/img/P97lKcptJrgC4WlEe_I08fi9cwo=/fit-in/200x150/filters:strip_icc()/pic7975623.jpg","urlImage":"https://cf.geekdo-images.com/1YEb_dXUnNg__emgKzpLHw__original/img/5ISPWTBIGOEyGgnZwl6V51mKk3Y=/0x0/filters:format(jpeg)/pic7975623.jpg"},{"bggId":"407182","name":"Экопатруль: Биотрансы и техногиры (Ecopatrol: Biotrans and Technogears)","description":"Ecopatrol is one of the early game to be released by Tehnolog after their founding.&#10;&#10;The game deals with a planet where robotic animals live.  There are two sides: Biotrances and Technogyrs, who have been at war with one another for some time (much like Battlebeasts).&#10;&#10;The game is a miniatures-based one, with players moving their robots on the board (a 3-D structure). Each of the robots has their own abilities and attributes which players use in their games. For combat, players actually &quot;shoot&quot; with their robots and try to knock their opponent's over.&#10;&#10;&mdash;user summary&#10;&#10;EcoPatrol is a battle of robot-like beasts. The arena of battles is multi-tiered cardboard fortifications - ramps, galleries and towers. The characters of the game, the Environmental Rangers (in this role are animals - lions, rhinos, dogs, crocodiles, turned into combat cyborgs) confront smugglers and mercenaries - Technohybrids, robotic monsters. A series of exciting missions immerses players in the atmosphere of confrontation between galactic special forces protecting the nature of wild planets, and mercenaries in the service of interstellar corporations.&#10;&#10;&mdash;description from the publisher (translated)&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":30,"minAge":7,"categoriesAndMechanics":["Action / Dexterity","Animals","Miniatures","Science Fiction","Wargame","Area Movement","Dice Rolling"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/R1MRr9B_HHme_H6pyD_K-Q__thumb/img/QBnrZyqxodi7urYgtuFaIHWxRC4=/fit-in/200x150/filters:strip_icc()/pic7879235.jpg","urlImage":"https://cf.geekdo-images.com/R1MRr9B_HHme_H6pyD_K-Q__original/img/sgNVtHBaZD9FfE2ktBULVy6T_HM=/0x0/filters:format(jpeg)/pic7879235.jpg"},{"bggId":"407183","name":"Экопатруль: Биотрансы и техногиры 2 (Ecopatrol: Biotrans and Technogears 2)","description":"Ecopatrol is one of the early game to be released by Tehnolog after their founding.&#10;&#10;The game deals with a planet where robotic animals live.  There are two sides: Biotrances and Technogyrs, who have been at war with one another for some time (much like Battlebeasts).&#10;&#10;The game is a miniatures-based one, with players moving their robots on the board (a 3-D structure). Each of the robots has their own abilities and attributes which players use in their games. For combat, players actually &quot;shoot&quot; with their robots and try to knock their opponent's over.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":30,"minAge":7,"categoriesAndMechanics":["Action / Dexterity","Animals","Miniatures","Science Fiction","Area Movement"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/WO5ODG51wIqkdNpzJBy8sQ__thumb/img/R4G2Jch8DkZGbt2oFzXXan8EmL4=/fit-in/200x150/filters:strip_icc()/pic7879182.jpg","urlImage":"https://cf.geekdo-images.com/WO5ODG51wIqkdNpzJBy8sQ__original/img/rPC_YPYaRoiJSCsjhvbC5FC8C20=/0x0/filters:format(jpeg)/pic7879182.jpg"},{"bggId":"407184","name":"Champions of the Hundred Halls","description":"Champions of the Hundred Halls is a captivating 1-4 player coop strategy card game set in the bestselling Hundred Halls universe by Thomas K. Carpenter.&#10;&#10;Players must work together to defeat various scenarios from the books like a demonic invasion, or a delve into a trap filled dungeon while dealing with complications from the realm you're fighting in.&#10;&#10;The game sets up quickly, is simple to learn, and lasts 50-90 minutes with various levels of challenge available.&#10;&#10;The deluxe edition has an impressive 640 cards which includes 9 player decks, 6 scenario decks, and 5 realm decks including over 320 unique cards.  The high variation ensures a rich and varied gaming experience every time.  The game is a must-have for strategy card game enthusiasts, promising endless hours of engaging and strategic play, or play some of the easier combinations for a fun family game night.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":50,"maxPlayTime":90,"minAge":14,"categoriesAndMechanics":["Card Game","Fantasy","Novel-based","Cooperative Game","Drawing"],"rating":3,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/r5jzOa8DaapodXmL8oCWsw__thumb/img/AXJmiY4BEalNwv2Pk2nYVanUBYA=/fit-in/200x150/filters:strip_icc()/pic7881876.jpg","urlImage":"https://cf.geekdo-images.com/r5jzOa8DaapodXmL8oCWsw__original/img/zKgJVnYGj0XzmjSg127HQwNF2Ss=/0x0/filters:format(jpeg)/pic7881876.jpg"},{"bggId":"407186","name":"Grizzly Gulch Runaway Adventure","description":"Based on the Shanghai Disneyland attraction, this board game was a promotional item sent out in advance of the ride's opening.&#10;&#10;In this elaborately produced game, players race their mine carts around the track, collecting gold nuggets and avoiding hazards. The player to finish with the most gold wins!&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":60,"minAge":8,"categoriesAndMechanics":["American West","Dice","Racing","Roll / Spin and Move"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/iunmR2BTLMpg4wqXMuViTg__thumb/img/LnSBmlDsbgFXJEhNHC2a0foYU0c=/fit-in/200x150/filters:strip_icc()/pic7878834.jpg","urlImage":"https://cf.geekdo-images.com/iunmR2BTLMpg4wqXMuViTg__original/img/lHNqYtZVX9HsEqv3x6MjnBaiP9c=/0x0/filters:format(jpeg)/pic7878834.jpg"},{"bggId":"407187","name":"Muffin's Magical Kingdom","description":"On an ordinary day, an ordinary house cat named Muffin, was given an ordinary taste of some less than ordinary cat food. The mix of rotting fish and peculiar additives made her hallucinate. In a very extraordinary feverish trip, seven personalities diverged to manifest the seven houses of Muffins Magical Kingdom. Through acts of political discourse, and the clever use of magical tails, the Houses began to vie for control as they sway the tides of the Muffins Mind.&#10;&#10;Muffin's Magical Kingdom is a semi-cooperative trick-taking game for 3 or more players, that plays in 20-45 minutes depending on the number of players. It plays in exactly 21 tricks.&#10;&#10;We start with the dealer, who comes in the form of a Rat trying to put the pieces of Muffin back together again. They randomly deal a House and 10 cards to each player. The Rat then chooses the Trump House which serves a dual purpose for scoring. Each trick won, the player collects not only the cards from the trick but also the Trump house card.&#10;&#10;Each House has a special ability that is a reflection of their personality trait that is triggered whenever the card is played. These abilities can manipulate players hands, communication, and their future. Players may communicate by passing messages through courier Rats, but each message sent can be read by the Rat player so all houses should handle with care.&#10;&#10;The game ends when all 21 tricks are won, or any player wins a Trick from all 7 Houses. If the Rat player wins all 7 Houses, they immediately win the game. If a House player wins all 7 Houses, they immediately lose the game and the Rat wins.&#10;&#10;Scoring is based on the house and playing cards won during each each. 1 point for each card, 5 points for each card with a matching house, and 10 points for each card where all house cards are collected for that house. There are 4 cards for each house inclusive of the one randomly dealt at the start of the game.&#10;&#10;-description from designer&#10;&#10;","minPlayers":3,"maxPlayers":7,"minPlayTime":30,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Bluffing","Card Game","Party Game","Trick-taking"],"rating":0,"complexity":0},{"bggId":"407190","name":"Monopoly: Mandai","description":"A unique official licensed edition of Monopoly for the &quot;Mandai Wildlife Group&quot;.&#10;&#10;The how-to-play is similar to the typical Monopoly board game but instead of Chance and Community Chest cards, you will have Act for Wildlife and Care for Wildlife cards. The tokens are also different from the usual ones -- they include an orangutan, pangolin, turtle, cockatoo, handheld transceiver and gumboot, represent threatened species under the care of the Mandai Wildlife Group as well as the equipment and tools used in the parks.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":90,"maxPlayTime":180,"minAge":8,"categoriesAndMechanics":["Animals","Economic","Educational","Environmental","Negotiation","Auction/Bidding","Player Elimination","Roll / Spin and Move"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/L4FRmk8IvictctrWD4j59g__thumb/img/zYUpbQHnS-Gq_qBI1AQo73KSct0=/fit-in/200x150/filters:strip_icc()/pic7878641.jpg","urlImage":"https://cf.geekdo-images.com/L4FRmk8IvictctrWD4j59g__original/img/lbsrarV4ZKPLZ-n2LIQMKHC73eU=/0x0/filters:format(jpeg)/pic7878641.jpg"},{"bggId":"407191","name":"Do Not Go Gentle","description":"Global warming killed five billion people. They were the lucky ones. We who still live struggle daily against marauders, thieves and worse. After years of wandering and losing people, we found a small, defensible spot on the outskirts of a city. We are starting to settle, fortify, and rebuild. Each week, the vicious mobs come to take what little we have left. But we will not go gentle into that good night. We will rage against the dying of the light.&#10;&#10;Do Not Go Gentle is a solitaire post-apocalyptic game of worker placement, base building, hand management, scavenging, and survival.&#10;&#10;The game is played over six rounds. Your goal is to survive with at least one building left standing and one worker left alive at the end of six rounds. The game is played on a 9 x 9 map. You start the game with three basic building tiles: a basic farm, basic workshop, and basic weapons shop. Each round, you place survivors on building tiles to produce benefits to your compound (food, barricades, weapons, meds, and repairs ). At the end of each round, a vicious mob of marauders will attack the compound. You must strategically place your barricades, assign your survivors, and distribute your weapons to protect and defend against the ravenous marauders. Can you survive six rounds of increasingly more devastating attacks?&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":60,"maxPlayTime":90,"minAge":14,"categoriesAndMechanics":["Card Game","City Building","Print & Play","Hand Management","Solo / Solitaire Game","Worker Placement"],"rating":4,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/b54qSE7mC4Xn0YbbIHkBEg__thumb/img/dStRA3RUfs3TZKcjtwB0JEBNxSE=/fit-in/200x150/filters:strip_icc()/pic7878772.jpg","urlImage":"https://cf.geekdo-images.com/b54qSE7mC4Xn0YbbIHkBEg__original/img/2m26E0AyIZafZ2e-EvEMSveeFNw=/0x0/filters:format(jpeg)/pic7878772.jpg"},{"bggId":"407192","name":"Mail Bucks","description":"MAIL BUCKS is a light, yet strategic math game. The game is all about delivering mathematically-correct mail around neighbourhoods and collecting money in return.&#10;&#10;LASERCUT COMPONENTS: &#10;&bull; 108 number tiles: 1-9, 10, 20, 25, 30, 40, 50&#10;&bull; 12 sets of operator tiles: + - x&#10;&bull; 10 house standees with bases&#10;&bull; 5 mailboxes with bases&#10;&bull; 5 mail trucks with bases&#10;&bull; 20 coins in two denominations ($) ($$)&#10;&#10;GOAL: &#10;Players will be required to collect numbers to form equations. The equation will match a house number. Deliver the mail to the matching house to get paid. Collect the most value in coins by forming simple mathematical equations that yield a street delivery address for a target house.&#10;&#10;MODES: &#10;Younger Child Play: Only the addition operators will be used and house numbers will range from 11 to 20.&#10;Full Play: All mathematical operators are used with house numbers 11-99.&#10;&emsp;&#10;SETUP:  &#10;&bull; Arrange the houses into your choice of neighbourhoods with one mailbox per group (see Neighbourhoods below)&#10;&bull; Shuffle the number tiles and operators upside down in two separate draw piles&#10;&bull; Assign each house an address using random number tiles (1-9 only) face up.&#10;&bull; Place a coin on each house base as follows: one ($) for addresses 11-50, ($$) for addresses 51+.&#10;&bull; Place three number tiles and one operator tile face up on each mailbox base.&#10;&bull; Each player grabs a mail truck.&#10;&bull; Each player grabs one number tile to keep in secret.&#10;&#10;END OF GAME CONDITIONS:&#10;Agree upon what constitutes the end of the game:&#10;&bull; Abandoned Homes: upon picking up money, the house is abandoned and will no longer have an address.&#10;&bull; Target Score: play until a player has collected coins that total a minimum value like 5 points.&#10;&#10;GAME PLAY:  &#10;On each turn, a player has 30 seconds to do the following: &#10;&bull; Move their truck to either a mailbox or house.&#10;&bull; When at a mailbox, pick up one or more required tiles into their truck slots, replacing empty mailbox slots with fresh tile(s) from the draw pile(s).&#10;&bull; When at a house, call out their equation and destination address, allowing opponent(s) to verify the math is correct; collect the coin; replace the house with two fresh tiles (unless abandoned); discard all the tiles from the truck.&#10;&#10;Secret Number Tile:&#10;Place your secret number tile into your truck at any time. Once used, grab another number tile to keep secret.&#10;&#10;Mailbox Operations:&#10;A truck at a mailbox may either:&#10;&bull; Take one or more tiles from the mailbox and place in the truck; replace all empty mailbox slots with new tile(s) from the appropriate draw pile(s)&#10;&#10;House Operations:&#10;If the truck is in the same neighbourhood as their destination address, the player calls out their equation and collects the coins.&#10;&#10;If the truck fulfills their equation and is not at the neighbourhood with the destination address, the player must wait until their next turn to move their truck to the correct neighbourhood.&#10;&#10;TIP: Before selecting tiles at a mailbox, choose wisely based on the addresses you see.&#10;&#10;FORMING EQUATIONS:&#10;Form math equations by using at least two numbers and one operator. The equation is formed within the base of your truck. The solution to the equation will be the address of a house (destination). To form the equation, collect the correct numbers and operator(s). Examples:&#10;&#10;Valid Matching Equations&#10;7+7    2x5+4   20-6   all match house number 14.&#10;&#10;ENDING THE GAME:&#10;Keep playing until no one can collect any more tiles.&#10;&#10;WINNING THE GAME:&#10;The winner will have the most value in coins. If there is a tie, play another round.&#10;&#10;EXCEPTIONS:&#10;You cannot stop in a neighbourhood where there is another truck. Only one truck per neighbourhood.&#10;&#10;FAQ: TBD&#10;&#10;-description from designer&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":30,"maxPlayTime":45,"minAge":5,"categoriesAndMechanics":["Math","Matching","Set Collection"],"rating":0,"complexity":0},{"bggId":"407197","name":"Nightwatch: Blood and Bone","description":"Nightwatch - Blood and Bone is a game about killing monsters. All kinds, anywhere, any time.&#10;You and your friends are members of the NIGHTWATCH: an ancient order of warriors, trackers, wizards, and alchemists dedicated to hunting the malevolent creatures that terrorize humanity.&#10;&#10;Nightwatch: Blood and Bone is a tabletop adventure game set in a dark fantasy world where players band together to hunt monsters. Designed with 28mm miniatures in mind, Blood and Bone is a cooperative, open-world, miniature-agnostic rule set that combines miniature war gaming with a rules-light, role-playing system.&#10;&#10;Suitable for most fantasy settings from the Dark Ages to the Black Powder era, Blood and Bone is a stand-alone rule set that offers expanded character classes, a menu of mix-n-match traits to flavor your enemies, along with new weapon, equipment, and magic rules, to bring more depth, detail, and danger to your game sessions.&#10;&#10;Gather your friends, grab your cool miniatures, and gear up. You've got monsters to kill.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":90,"maxPlayTime":150,"minAge":14,"categoriesAndMechanics":["Fantasy","Horror","Miniatures","Cooperative Game","Dice Rolling","Push Your Luck","Role Playing","Scenario / Mission / Campaign Game"],"rating":5,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/OGXZgnF6QAXQlNOx3B0NFg__thumb/img/8_Ok0c7t2dO2U6opnhNphgkMwyw=/fit-in/200x150/filters:strip_icc()/pic7877957.jpg","urlImage":"https://cf.geekdo-images.com/OGXZgnF6QAXQlNOx3B0NFg__original/img/LRrbtpbdd4A3akTclM1Wj8rqHMQ=/0x0/filters:format(jpeg)/pic7877957.jpg"},{"bggId":"407204","name":"Something Wild! Mickey Mouse Sound Cartoon","description":"Something Wild is a line of card games featuring beloved characters and collectible Pop! pocket figures. Play numbered and colored character cards to make sets and runs. The first player to score three powers wins the game.&#10;&#10;With Something Wild: Mickey Mouse Sound Cartoon, you can score a set to snag the Steamboat Willie figure's special power to help you win!&#10;&#10;Combine Character Cards in sets and runs to score points, just like in Rummy. Use Power Cards to add a fun twist to the classic card gameplay.&#10;&#10;Combine multiple Something Wild! games to add more character cards, more Pop! figures, and more powers to your game!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":15,"minAge":6,"categoriesAndMechanics":["Card Game","Children's Game","Collectible Components","Set Collection"],"rating":3.25,"complexity":0},{"bggId":"407206","name":"Quagmire","description":"A race to stay afloat as the land gives away underfoot. Walk, run, and jump around the board to hamper the other team, but make sure to leave enough room for your own!&#10;&#10;Quagmire is an abstract strategy game for two players, played on a small hexagonal board.  On their turn, a player moves one of their two meeples a short distance and destroys some of the board in the process.  Meeple can jump small gaps, but eventually, through tactical movement and blocking, one player will run out of moves and lose the game.&#10;&#10;The game is intended to be an introduction to luckless, combinatorial games and to be accessible to young children.  Thus the game has simple rules and plays very quickly.&#10;&#10;-description from designer&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":10,"maxPlayTime":30,"minAge":6,"categoriesAndMechanics":["Abstract Strategy","Print & Play","Grid Movement","Hexagon Grid","Map Reduction"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/qeaO7GNgoxWptxVFe4TLfQ__thumb/img/5tAFd-7OlWe_OUbnGJh_DGX5d4U=/fit-in/200x150/filters:strip_icc()/pic7879583.png","urlImage":"https://cf.geekdo-images.com/qeaO7GNgoxWptxVFe4TLfQ__original/img/OTsST0zsLIKEgOf0eO16sieCZjA=/0x0/filters:format(png)/pic7879583.png"},{"bggId":"407210","name":"Return of the Tripods: All Quiet on the Martian Front","description":"Introducing the Return of the Tripods where you will fight mighty battles between invading Martian forces and the Earths human defenders in this fully revised 15mm tabletop wargame.&#10;&#10;The year is now 1917 and in the midst of the largest and most widespread conflict in human history the skies are once again lit up by pillars of fire heralding the Return of the Tripods.&#10;&#10;A fully revised game system developed by David Pearce and the team at Abby Normal. This Initiative based scalable game system allow players to start out with a few tripods and tanks with the ability to progress to play truly massive conflicts.&#10;&#10;Rules are designed to suit all previous versions models.&#10;&#10;In June 1904 Earth was forever changed when the skies were lit up by Martian drop pods streaking through pillars of fire into the ground. Emerging from these pods, Martian war-machines rapidly spread out destroying and killing everything in their path.  Despite humanities best efforts, the Martian Tripods were unstoppable. It was not until the invading Martians succumbed to infections and disease was their rampage halted. The year is now 1917 and in the midst of the largest and most widespread conflict in human history the skies are once again lit up by pillars of fire heralding the Return of the Tripods&trade;.&#10;&#10;Having learned from their previous incursion, the Martians have returned with improved war machines, new weapons, and biological immunities. Humanity has not been idle either.  Scavenging the remains of the Martian's previous attacks humans too have learned. While most of the secrets of Martian technology remain unfathomable, human ingenuity have enabled mankind too to invent new weapons of war and improve existing ones. In this heroic 15mm scale tabletop wargame take control of either Human or Martian forces in a battle for control of Earth.&#10;&#10;Leveraging the advances in 3D printing technology and the increasing availability of 3D printers Abby Normal are making all of their models available to anyone with a printer to print their own armies at their convenience. For those gamer's who would prefer to not worry about diving into the world of 3D printing they will also offer pre-printed physical models.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":90,"maxPlayTime":180,"minAge":14,"categoriesAndMechanics":["Science Fiction","Wargame","World War I","Dice Rolling","Hidden Movement","Measurement Movement","Order Counters"],"rating":5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/sbgM-BUW2OqKv8RxqrBmtA__thumb/img/AGa5XtFJgRQBDSWiti1m8QvLphg=/fit-in/200x150/filters:strip_icc()/pic7879199.jpg","urlImage":"https://cf.geekdo-images.com/sbgM-BUW2OqKv8RxqrBmtA__original/img/LudlJvTLjhEoctOKHpK78-0fPOw=/0x0/filters:format(jpeg)/pic7879199.jpg"},{"bggId":"407211","name":"The Battle of Doumyouji and Konda","description":"This battle occurred the day before the battle for Osaka Castle, where the Toyotomi clan fell in the 'Osaka Summer Battle (1615)'.&#10;&#10;It is a reenactment of the battle in which Goto Matabei and Sanada Nobushige (Yukimura) and others attempted to intercept and gain the upper hand against Tokugawa Shogunate forces invading the Kawachi Plain from the Yamato and Kishu areas at Domyoji and Komoda, located south of the Yamato River in southern Osaka.&#10;&#10;The game is made in government postcard size (100 mm x 148 mm) and was distributed as a special offer when purchasing products from online shops in Japan.&#10;&#10;The game map and pieces to be used are printed inside the postcard size, the pieces can be cut out and played, and the rulebook can be viewed via QR code or web address.&#10;&#10;The Battle of Yao and Wakae, which occurred on the same day as this battle, was also published simultaneously as a postcard game, and the two games can be linked together (the maps are not actually connected, but the game is played on two sides at the same time).&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":10,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Ancient","Game System","Wargame","Hexagon Grid"],"rating":4,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/SoGm4L3WTfzs9E_SB_Vzmw__thumb/img/Dg2nVnGT3TDp0N2Pc9Qv2OwrKGs=/fit-in/200x150/filters:strip_icc()/pic7879482.jpg","urlImage":"https://cf.geekdo-images.com/SoGm4L3WTfzs9E_SB_Vzmw__original/img/sIFjxZKdyTiKJk9pnBMUCH3KYLk=/0x0/filters:format(jpeg)/pic7879482.jpg"},{"bggId":"407212","name":"The Battle of Yao and Wakae","description":"This battle occurred the day before the battle for Osaka Castle, where the Toyotomi clan fell in the 'Osaka Summer Battle (1615)'.&#10;&#10;It is a reenactment of the battle in which Chousogabe Moritika and Kimura Shigenari and others attempted to intercept and gain the upper hand against Tokugawa Shogunate forces invading the Kawachi Plain from the Yamato and Kishu areas at Yao and Wakae, located north of the Yamato River in southern Osaka.&#10;&#10;The game is made in government postcard size (100 mm x 148 mm) and was distributed as a special offer when purchasing products from online shops in Japan.&#10;&#10;The game map and pieces to be used are printed inside the postcard size, the pieces can be cut out and played, and the rulebook can be viewed via QR code or web address.&#10;&#10;The Battle of Domyouji and Konda, which occurred on the same day as this battle, was also published simultaneously as a postcard game, and the two games can be linked together (the maps are not actually connected, but the game is played on two sides at the same time).&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":15,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Ancient","Game System","Wargame","Hexagon Grid"],"rating":4,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/EogTLuVDxEGwyYwr2-U25g__thumb/img/62tH3AFngogwIcbaGt0F-GW3v4A=/fit-in/200x150/filters:strip_icc()/pic7879485.jpg","urlImage":"https://cf.geekdo-images.com/EogTLuVDxEGwyYwr2-U25g__original/img/7uGwTxP5Fqv_ha3KM0nMT7FFLRg=/0x0/filters:format(jpeg)/pic7879485.jpg"},{"bggId":"407213","name":"Старсис: Вторжение на рун (Starsys: Rune Invasion)","description":"The game Starsis was released in 2 sets: Invasion of the Runes and Skirmish on Gronta. Each of the sets is dedicated to one &quot;amphibious operation&quot; in wars of the distant future. While managing a unit, players must complete a chain of missions - by completing them, one by one, they are approaching the ultimate victory. The games of the Starsys series unfold on a playing field divided by on the cells. But it doesn't stop there - the kit also includes a construction set. Its parts can be used to construct A whole labyrinth of ruins and fortifications. The game is decorated with spectacular accessories - cards, cubes, flags, a bright playing field. Squads of soldiers have their own names, combat characteristics, and army ranks.&#10;&#10;There is also a legend of the game - the battles of the space Empire and the interstellar Trade Protectorate. Star Troopers are Troops of the warring states. Having clashed in the battles of the first two missions, they will continue the war in the vast expanses hostile space.&#10;&#10;Games of the Starsis series no longer contain firing weapons - everything is solved with the help of dice. The figurines are noticeably smaller than those that Fantasy Battles players are used to. In general, the games of the Starsis series are solid tabletop tactical war games. Despite the fact that there are only two sets in this series, there are more than a dozen miniature figures. So Starsis can be safely to be called the first Russian &quot;fantastic&quot; wargame.&#10;&#10;&mdash;description from the publisher (translated)&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":60,"minAge":7,"categoriesAndMechanics":["Miniatures","Science Fiction","Wargame","Area Movement","Dice Rolling","Simulation"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/UcDEnnL37rKO_xKL-qxQ_w__thumb/img/UvnvgmfZ1OlliyKvTzhjKftquBU=/fit-in/200x150/filters:strip_icc()/pic7878895.jpg","urlImage":"https://cf.geekdo-images.com/UcDEnnL37rKO_xKL-qxQ_w__original/img/Y6iqtsfnEoS7gSVjYmSUPTUPT34=/0x0/filters:format(jpeg)/pic7878895.jpg"},{"bggId":"407214","name":"Syncro","description":"You are a mage who has taken a vow of silence. You will have to face an unprecedented threat and fight monsters that endanger the kingdom.&#10;&#10;Cooperate without speaking to defeat all the monsters!&#10;&#10;&#10;     At the beginning of the game, communicate the potential of your cards with a gesture.&#10;     In turn, place a face-down card on a monster of your choice.&#10;     At the end of a turn, reveal the cards placed on the monsters and find out if your attacks were powerful enough to defeat them.&#10;&#10;&#10;You must estimate the value played by your fellow players while having limited communication and information.&#10;&#10;As the game progresses, you will advance in the adventure and unlock new effects that will spice up your games.&#10;&#10;The game consists of 2 chapters with 4 and 5 levels respectively to cross in order to win the game.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":15,"minAge":10,"categoriesAndMechanics":["Card Game","Fantasy","Number","Communication Limits","Cooperative Game","Hand Management"],"rating":3.657895,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/rXMGOjLoEl4qZtscyca6kQ__thumb/img/M7HDQC2fGIBQHQJoBAj3p3YhpzM=/fit-in/200x150/filters:strip_icc()/pic7878184.jpg","urlImage":"https://cf.geekdo-images.com/rXMGOjLoEl4qZtscyca6kQ__original/img/P8E2Nji28C-BHg6fWnEBYf-H17E=/0x0/filters:format(jpeg)/pic7878184.jpg"},{"bggId":"407216","name":"Старсис: Схватка на гронте (Starsys: Skirmish on the Gront)","description":"The game Starsis was released in 2 sets: Invasion of the Runes and Skirmish on Gronta. Each of the sets is dedicated to one &quot;amphibious operation&quot; in wars of the distant future. While managing a unit, players must complete a chain of missions - by completing them, one by one, they are approaching the ultimate victory. The games of the Starsys series unfold on a playing field divided by on the cells. But it doesn't stop there - the kit also includes a construction set. Its parts can be used to construct A whole labyrinth of ruins and fortifications. The game is decorated with spectacular accessories - cards, cubes, flags, a bright playing field. Squads of soldiers have their own names, combat characteristics, and army ranks.&#10;&#10;There is also a legend of the game - the battles of the space Empire and the interstellar Trade Protectorate. Star Troopers are Troops of the warring states. Having clashed in the battles of the first two missions, they will continue the war in the vast expanses hostile space.&#10;&#10;Games of the Starsis series no longer contain firing weapons - everything is solved with the help of dice. The figurines are noticeably smaller than those that Fantasy Battles players are used to. In general, the games of the Starsis series are solid tabletop tactical war games. Despite the fact that there are only two sets in this series, there are more than a dozen miniature figures. So Starsis can be safely to be called the first Russian &quot;fantastic&quot; wargame.&#10;&#10;&mdash;description from the publisher (translated)&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":60,"minAge":7,"categoriesAndMechanics":["Miniatures","Science Fiction","Wargame","Area Movement","Dice Rolling"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/27DpwFQ4cgbC5WvzmBECig__thumb/img/nlHmai-BfelB-EPac-9hiTqQVSM=/fit-in/200x150/filters:strip_icc()/pic7878913.jpg","urlImage":"https://cf.geekdo-images.com/27DpwFQ4cgbC5WvzmBECig__original/img/iySGLlLv03-wHjdnd4hlKelEFTw=/0x0/filters:format(jpeg)/pic7878913.jpg"},{"bggId":"407225","name":"The Magician","description":"The Magician is a solitaire game played with a 78-card Tarot deck. You play as the Magician, attempting to subjugate the remaining 21 Major Arcana and gain absolute power. Your tools are wands, pentacles, swords, and cups: the cards of the Minor Arcana, which allow you to control the four elements of nature. Four Major Arcana cards are dealt in a diamond pattern so that the Minor Arcana cards can be placed adjacent to them on each side. The player tries to subjugate one or more of these cards by surrounding them with a Minor Arcana card of each suit, the sum of which also exceeds the value of the Major Arcana card. The player can use the Magician card to activate special powers, including the power to change the suit of a card to a wild suit. When cards are subjugated, both the Major Arcana and the surrounding Minor Arcana cards are discarded. Some Major Arcana cards have addition requirements for subjugating them, and others offer rewards after being subjugated. There are also expansion cards which include even more requirements and rewards for greater variability. If the player can subjugate all 21 Major Arcana before the Minor Arcana deck runs out, they win.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":15,"maxPlayTime":30,"minAge":12,"categoriesAndMechanics":["Card Game","Puzzle","Hand Management","Move Through Deck","Push Your Luck","Solo / Solitaire Game"],"rating":3.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/-chv7-U4H-5HYxZk_iMwXw__thumb/img/tg_1uRWDjDve6pTRC4UTrRCRaI0=/fit-in/200x150/filters:strip_icc()/pic7880684.png","urlImage":"https://cf.geekdo-images.com/-chv7-U4H-5HYxZk_iMwXw__original/img/zJN8_4zClSpOTcywIdsJRIu0CeI=/0x0/filters:format(png)/pic7880684.png"},{"bggId":"407231","name":"Match Trace","description":"Match Trace is a Print and Play paper and pencil &quot;arcade&quot; game that simulates sailboat racing.&#10;Players take on the roles of skippers, each controlling a sailboat on a course represented on paper.&#10;The game requires strategic planning, an element of chance, and tactical decision-making.&#10;The core mechanic involves three dice, which are passed between players.&#10;These dice determine the movement of the sailboats, with one die dictating forward (up or down) movement and the others controlling lateral movement, based on odd and even values.&#10;Players must judiciously use their &quot;knots&quot; to reroll dice and thus influence their course, adding a layer of strategy to each move.&#10;Interaction between players is a key aspect of Match Trace, mirroring the competitive nature of real-life match racing.&#10;Players can strategically impede their opponent's progress by &quot;covering their wind,&quot; a move that requires careful positioning and foresight.&#10;Match Trace offers various modes of play, including single races, best-of-three series, and timed challenges.&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":15,"maxPlayTime":25,"minAge":8,"categoriesAndMechanics":["Dice","Nautical","Print & Play","Racing","Sports","Dice Rolling","Line Drawing","Push Your Luck","Race"],"rating":3.333335,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/Ryawezi6hbeDHKmPKH7lLQ__thumb/img/IttwA_QJhIbqn9sJrzEyeuDWK-8=/fit-in/200x150/filters:strip_icc()/pic7880916.png","urlImage":"https://cf.geekdo-images.com/Ryawezi6hbeDHKmPKH7lLQ__original/img/eKLe1LJVa0JTsXGFlh8SPCoWRrI=/0x0/filters:format(png)/pic7880916.png"},{"bggId":"407232","name":"Apples to Apples Express","description":"It&rsquo;s the game of hilarious comparisons, ready for party play! In each round, a new judge draws a Description Card. You&rsquo;ve got to decide which card in your hand matches the Description in play, and hope the judge thinks your card is the best. And with so many cards in this version, it&rsquo;ll never be the same game twice!&#10;&#10;Filled with surprises and outrageous answers!&#10;&#10;The judge plays a Green Apple card with a descriptive word on it.&#10;&#10;From the five red apple cards in your hand, play the one that makes the best combination with the Green Apple card.&#10;&#10;If the judge likes your combination the best, you keep the Green Apple card.&#10;&#10;Collect four Green Apple cards to win!&#10;&#10;Includes more than 500 cards, plus tray and instructions.&#10; There are a few differences between this and standard Apples to Apples: players are dealt 5 cards instead of 7, they only need 4 green cards to win, and each green card has two options and the judge chooses the target adjective before players submit their cards.&#10;&#10;","minPlayers":3,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":12,"categoriesAndMechanics":["Card Game","Player Judge"],"rating":0,"complexity":0},{"bggId":"407233","name":"Tenby","description":"Tenby is one of the most beautiful towns in Wales. Wander our colourful streets, walk along our piers with some scrumptious fish and chips, and relax on our stunning beaches with a nice cold ice cream and a warm feeling in your heart.&#10;&#10;The aim of Tenby is to create the best town you can using the available cards. On your turn, you will add terraces, piers and Tenby town&rsquo;s landmarks into your streets. If you can persuade a hard working local resident to help, you might just pick up some extra points! Whoever has the most points at the end of the game is the winner!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":30,"maxPlayTime":60,"minAge":8,"categoriesAndMechanics":["Card Game","City Building","Action Drafting","Matching","Open Drafting"],"rating":4.2,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/8L5T9-_xGX5lFF-VlU77lA__thumb/img/Ko_vq3IV2pLJpheMWpRfydTwNhk=/fit-in/200x150/filters:strip_icc()/pic7880987.jpg","urlImage":"https://cf.geekdo-images.com/8L5T9-_xGX5lFF-VlU77lA__original/img/8NfeHNjIQB5cTciEeZr28wA25W8=/0x0/filters:format(jpeg)/pic7880987.jpg"},{"bggId":"407234","name":"Bam! Smash! Ka-pow!","description":"This retro parody super hero themed card game requires players to defeat 3 villains ravaging Crime Capitol City. Players gain Mutations, Weapons, and Hideouts on their play mat to power up attacks. During an attack opponents can help as a side kick or hinder with a variety of modifier cards such as &ldquo;Annoying Detective.&rdquo; Watch out when drawing Final Strike as you may end up fighting another villain instead!&#10;&#10;Turn based gameplay consists of two actions that allow players to combine strategies to disrupt opponents (such as passing/stealing cards) or maximize an attack opportunity. The best laid plans can be interrupted by a timely Plot Twist- a counter to most cards and actions in the game.&#10;&#10;This strategic party game is for 2-6 players (single player rules available on the game&rsquo;s website). Players will enjoy the retro graphics, clever card text, and strategy that evolves the more you play.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":15,"maxPlayTime":30,"minAge":12,"categoriesAndMechanics":["Card Game","Humor","Card Play Conflict Resolution","Drawing","Hand Management","Multi-Use Cards"],"rating":0,"complexity":0},{"bggId":"407241","name":"Fire Flowers (Clear Duets & Solo Series)","description":"Japan's most prestigious fireworks competition is about to begin! Will you be able to make all your fire flowers bloom to their fullest? It's up to you to keep the audience delighted!&#10;&#10;Fire Flowers (Clear Duets &amp; Solo Series) is a polyomino puzzle game for 1&ndash;2 players that combines hand management, limited communication, layering, and grid coverage/reduction in a fun way. It consists of 36 cards (18 Clear cards + 18 Standard cards).&#10;&#10;This game is part of our Clear Series, more specifically our Clear Duets &amp; Solo Series, which focuses on cooperative and solo games for 1&ndash;2 players and combines Clear cards and Standard cards in many surprising ways.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":20,"minAge":14,"categoriesAndMechanics":["Abstract Strategy","Card Game","Puzzle","Communication Limits","Cooperative Game","Grid Coverage","Hand Management","Layering","Map Reduction","Solo / Solitaire Game","Tile Placement"],"rating":0,"complexity":0},{"bggId":"407254","name":"Berestechko 1651","description":"Berestechko 1651 is a game for two players simulating the third day of the battle of Berestechko, fought on 30th June 1651 between the Zaporozhian Cossacks, led by Hetman Bohdan Khmelnytsky and aided by their Crimean Tatar allies, and a Polish-Lituanian army under King John II Casimir, near the Styr river in Volhynia It was one of the largest land battles of 17th century Europe.&#10;&#10;The game is a small-footprint simulation intended to give a quick and easy representation of the battle, focusing on good preparation of attacks and on when and where to withhold, retreat, rally and reorganize. The game lasts two turns. In each turn players alternate performing &ldquo;impulses&rdquo;, in which they activate units and/or gather coordination and reorganization commands. In each turn each unit can be activated up to two times. A turn ends when all units of one  player have been activated twice. Once the second turn ends, victory is assessed, although an automatic victory can happen before the end of the two turns if certain conditions are met.&#10;&#10;-description from developer&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":90,"minAge":12,"categoriesAndMechanics":["Pike and Shot","Wargame","Dice Rolling","Hexagon Grid","Impulse Movement","Simulation"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/bLSXgxZ3q4Qtv1LgZG-MNA__thumb/img/Gf7_OvQofVOvLTh0Q9NaRjx6_1A=/fit-in/200x150/filters:strip_icc()/pic7880214.png","urlImage":"https://cf.geekdo-images.com/bLSXgxZ3q4Qtv1LgZG-MNA__original/img/GdujD_ShjHcYwi5dE6DtID2kCt4=/0x0/filters:format(png)/pic7880214.png"},{"bggId":"407265","name":"Star Realms: Deluxe Colonial Collection","description":"Get the ultimate travel version of the award-winning Star Realms Deckbuilding Game! The Deluxe Colonial Collection is an awesome, all-foil 2-4 player card set with 4 high-quality score dials and a beautiful game board in sturdy magnetically sealed box!&#10;&#10;The Colonial Collection features 234 beautiful foil cards. That includes foil versions of every card from Colony Wars, Scenarios, all 4 United Packs, Stellar Allies, and the Year 2 Promo Pack. Plus, you&rsquo;ll get beautiful Alt Art Scouts and Vipers in the four included starter decks.&#10;&#10;-description from developer&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":20,"minAge":12,"categoriesAndMechanics":["Card Game","Fighting","Science Fiction","Deck, Bag, and Pool Building","Delayed Purchase","Hand Management","Open Drafting","Take That"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/sFlZmacFHxcq6-nbr55qeg__thumb/img/_7WYHapekO9Uo5aTmoBpJaN0m60=/fit-in/200x150/filters:strip_icc()/pic7881691.jpg","urlImage":"https://cf.geekdo-images.com/sFlZmacFHxcq6-nbr55qeg__original/img/9r4T2Bc__Mi_iQ57PWMefpclHTY=/0x0/filters:format(jpeg)/pic7881691.jpg"},{"bggId":"407286","name":"Kimono","description":"Geisha-themed game for 2-4 players, where you compete to gain the favor of the emperor getting your character more elegant than the others.&#10;&#10;It's a set collection game focused on getting more points at the end of the game.&#10;&#10;At the start of Kimono you have to choose a maiko to support. You display the Kakemono board and take the six buttons for you chosen character. Depending on the number of players, you use more or less  fabric cards and accessories.&#10;&#10;Each card has a number and a pair of signs (Animal, vegetal, or three marks of the draper) which will be used to make combinations and scoring points. Cards are displayed at the center of the table, alongside the Kakemono board, in a 4 lines x 4 cards or 5x3 disposition for 2/4 players and 3 players respectively.&#10;&#10;The main phase of the game is called the Market phase. All the fabric cards and accessories will be displayed at the centre of the table, but only those matching the selected colours.&#10;In the draw phase, a player must draw one card that is on the extreme right of any line of their choice.  Players must draw them in their turns in order to make combinations, which appear on the Kakemono board a the center of the table. That's is the way a player can score points on this game.&#10;&#10;For example, in an attempt to make a Katyou Fugetsu kakemono player 1 will need 2, 3, 4, 5 or 6 cards with the Animal mark on them. Player 1 can use 2 cards with the same number (for example 2) with the animal mark on it, and, as marked on the Kakemono board, he will score two points. Player 1 must put the button on the Kakemono board in the matching combination and no other player can make that combination again.&#10;&#10;The end of the game arrives when each player has drawn 12 cards. In this phase, players gain points for each combination made, also if they used the 12 cards they drawn there is 2 extra points for those players. Each accessory card is equal to 1 extra point. Finally, players score how many kinds of fabric they used as listed on the kakemono board. The player with the highest score is the winner.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":45,"minAge":10,"categoriesAndMechanics":["Card Game","Drawing","Hand Management","Pattern Recognition","Set Collection"],"rating":2.75,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/HjGkhIpChm7ZSzVEOSNrgQ__thumb/img/TvjKNpjk1Z-kjNV79aJ0yijYDNA=/fit-in/200x150/filters:strip_icc()/pic7883276.jpg","urlImage":"https://cf.geekdo-images.com/HjGkhIpChm7ZSzVEOSNrgQ__original/img/-bdBl7YwOu5w2L5C-OlvAyvLN1g=/0x0/filters:format(jpeg)/pic7883276.jpg"},{"bggId":"407287","name":"Say What? Card Game","description":"These frantic phonetics will make you babble along as you try to sound out the sentences without melting your brain or twisting your tongue. Do you have what it takes to unscramble the babble?&#10;&#10;&mdash;description from the back of the box&#10;&#10;","minPlayers":3,"maxPlayers":99,"minPlayTime":0,"maxPlayTime":0,"minAge":12,"categoriesAndMechanics":["Card Game"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/Vczwf2GbUiVfGIajpNwlnQ__thumb/img/siuhSx1X6wvNztsgEeFQlBLCDI0=/fit-in/200x150/filters:strip_icc()/pic7883038.jpg","urlImage":"https://cf.geekdo-images.com/Vczwf2GbUiVfGIajpNwlnQ__original/img/Kt48IWgJQGxzcejrjpRqSkVQUqk=/0x0/filters:format(jpeg)/pic7883038.jpg"},{"bggId":"407289","name":"ドキドキッチン？！ (Dokidokitchen⁈)","description":"&#227;&#131;&#137;&#227;&#130;&#173;&#227;&#131;&#137;&#227;&#130;&#173;&#227;&#131;&#131;&#227;&#131;&#129;&#227;&#131;&#179;&#239;&#188;&#159;&#239;&#188;&#129; (Dokidokicchin&#226;&#129;&#136;) (Dokido kitchen&#226;&#129;&#136;) is a game from Japan, in which players try to guess the ingredients and the name of a dish. (The game title is a pun; 'dokidoki' is your heartbeat).&#10;&#10;The ingredients are guessed by closing your eyes, touching the ingredient piece and guessing from its shape.&#10;For the name of the dish, the player guesses and guesses the dish that can be made by combining the guessed ingredients.&#10;&#10;Depending on the degree to which the player guesses the ingredients and the name of the dish, the 'maker' and the 'guesser' each get a point. The person with the highest score wins.&#10;&#10;The game tests the overall ability to remember the shape of the ingredients, the ability to analyse and identify the differences in shape by touch, and the ability to deduce the dishes that can be made from these ingredients.&#10;&#10;&#227;&#128;&#140;&#227;&#131;&#137;&#227;&#130;&#173;&#227;&#131;&#137;&#227;&#130;&#173;&#227;&#131;&#131;&#227;&#131;&#129;&#227;&#131;&#179;&#227;&#128;&#141;&#227;&#129;&#175;&#227;&#128;&#129;&#230;&#150;&#153;&#231;&#144;&#134;&#227;&#129;&#174;&#233;&#163;&#159;&#230;&#157;&#144;&#227;&#129;&#168;&#230;&#150;&#153;&#231;&#144;&#134;&#229;&#144;&#141;&#227;&#130;&#146;&#229;&#189;&#147;&#227;&#129;&#166;&#227;&#130;&#139;&#227;&#130;&#178;&#227;&#131;&#188;&#227;&#131;&#160;&#227;&#129;&#167;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#10;&#233;&#163;&#159;&#230;&#157;&#144;&#227;&#129;&#175;&#227;&#128;&#129;&#231;&#155;&#174;&#227;&#130;&#146;&#227;&#129;&#164;&#227;&#129;&#182;&#227;&#129;&#163;&#227;&#129;&#166;&#233;&#163;&#159;&#230;&#157;&#144;&#227;&#131;&#148;&#227;&#131;&#188;&#227;&#130;&#185;&#227;&#130;&#146;&#232;&#167;&#166;&#227;&#130;&#138;&#227;&#128;&#129;&#227;&#129;&#157;&#227;&#129;&#174;&#229;&#189;&#162;&#227;&#129;&#139;&#227;&#130;&#137;&#230;&#142;&#168;&#230;&#184;&#172;&#227;&#129;&#151;&#227;&#129;&#166;&#229;&#189;&#147;&#227;&#129;&#166;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#230;&#150;&#153;&#231;&#144;&#134;&#229;&#144;&#141;&#227;&#129;&#175;&#227;&#128;&#129;&#230;&#142;&#168;&#230;&#184;&#172;&#227;&#129;&#151;&#227;&#129;&#159;&#233;&#163;&#159;&#230;&#157;&#144;&#227;&#130;&#146;&#231;&#181;&#132;&#227;&#129;&#191;&#229;&#144;&#136;&#227;&#130;&#143;&#227;&#129;&#155;&#227;&#129;&#166;&#227;&#129;&#167;&#227;&#129;&#141;&#227;&#130;&#139;&#230;&#150;&#153;&#231;&#144;&#134;&#227;&#130;&#146;&#230;&#142;&#168;&#230;&#184;&#172;&#227;&#129;&#151;&#227;&#129;&#166;&#229;&#189;&#147;&#227;&#129;&#166;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#233;&#163;&#159;&#230;&#157;&#144;&#227;&#130;&#132;&#230;&#150;&#153;&#231;&#144;&#134;&#229;&#144;&#141;&#227;&#130;&#146;&#229;&#189;&#147;&#227;&#129;&#166;&#227;&#129;&#159;&#229;&#186;&#166;&#229;&#144;&#136;&#227;&#129;&#132;&#227;&#129;&#171;&#227;&#130;&#136;&#227;&#129;&#163;&#227;&#129;&#166;&#227;&#128;&#140;&#228;&#189;&#156;&#227;&#129;&#163;&#227;&#129;&#159;&#228;&#186;&#186;&#227;&#128;&#141;&#227;&#129;&#168;&#227;&#128;&#140;&#229;&#189;&#147;&#227;&#129;&#166;&#227;&#129;&#159;&#228;&#186;&#186;&#227;&#128;&#141;&#227;&#129;&#140;&#227;&#129;&#157;&#227;&#130;&#140;&#227;&#129;&#158;&#227;&#130;&#140;&#231;&#130;&#185;&#227;&#130;&#146;&#229;&#190;&#151;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#229;&#189;&#147;&#227;&#129;&#166;&#227;&#130;&#139;&#228;&#186;&#186;&#227;&#130;&#146;&#233;&#160;&#134;&#231;&#149;&#170;&#227;&#129;&#171;&#229;&#155;&#158;&#227;&#129;&#151;&#227;&#129;&#166;&#227;&#129;&#132;&#227;&#129;&#163;&#227;&#129;&#166;&#227;&#128;&#129;&#229;&#190;&#151;&#231;&#130;&#185;&#227;&#129;&#174;&#233;&#171;&#152;&#227;&#129;&#132;&#228;&#186;&#186;&#227;&#129;&#174;&#229;&#139;&#157;&#227;&#129;&#161;&#227;&#129;&#167;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#10;&#233;&#163;&#159;&#230;&#157;&#144;&#227;&#129;&#174;&#229;&#189;&#162;&#227;&#130;&#146;&#232;&#166;&#154;&#227;&#129;&#136;&#227;&#129;&#166;&#227;&#129;&#138;&#227;&#129;&#143;&#232;&#168;&#152;&#230;&#134;&#182;&#229;&#138;&#155;&#227;&#128;&#129;&#231;&#180;&#176;&#227;&#129;&#139;&#227;&#129;&#132;&#229;&#189;&#162;&#227;&#129;&#174;&#233;&#129;&#149;&#227;&#129;&#132;&#227;&#130;&#146;&#232;&#167;&#166;&#227;&#129;&#163;&#227;&#129;&#166;&#232;&#166;&#139;&#229;&#136;&#134;&#227;&#129;&#145;&#227;&#130;&#139;&#229;&#136;&#134;&#230;&#158;&#144;&#229;&#138;&#155;&#227;&#128;&#129;&#227;&#129;&#157;&#227;&#130;&#140;&#227;&#130;&#137;&#227;&#129;&#174;&#233;&#163;&#159;&#230;&#157;&#144;&#227;&#129;&#139;&#227;&#130;&#137;&#227;&#129;&#167;&#227;&#129;&#141;&#227;&#130;&#139;&#230;&#150;&#153;&#231;&#144;&#134;&#227;&#130;&#146;&#230;&#142;&#168;&#231;&#144;&#134;&#227;&#129;&#153;&#227;&#130;&#139;&#230;&#142;&#168;&#231;&#144;&#134;&#229;&#138;&#155;&#227;&#129;&#168;&#227;&#129;&#132;&#227;&#129;&#163;&#227;&#129;&#159;&#231;&#183;&#143;&#229;&#144;&#136;&#229;&#138;&#155;&#227;&#129;&#140;&#232;&#169;&#166;&#227;&#129;&#149;&#227;&#130;&#140;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#10;--description by publisher&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":20,"minAge":7,"categoriesAndMechanics":["Deduction","Humor","Memory","Party Game","Deduction","Memory"],"rating":0,"complexity":0},{"bggId":"407290","name":"Elevenses: Tea for Two","description":"Elevenses reimplemented for two players.&#10;Currently only available in the Elevenses: Trolley Box&#10;&#10;Includes:&#10;21 Morning Tea cards&#10;6 Action Cards&#10;22 Prepare Tokens&#10;1 Starting Server Card&#10;1 rulebook&#10;&#10;You are a respectable 1920s socialite striving to serve teh finest morning tea!&#10;&#10;All around Britain, eleven in the morning is recognised as the perfect time to stop and have a bite to eat. In Elevenses: Tea for Two, you direct your servants by playing cards to prepare your spread - sandwiches, biscuits, cakes - and don't forget the tea! When eleven o'clock strikes, the hsotess with the best prepared tea wins!&#10;&#10;Will your morning tea be the talk of the town?&#10;&#10;Game Overview:&#10;In each game of Tea for Two, two players will compete to serve the best morning tea. They will set their servants to work in the hopes that they will lay the best spread in the village has yet seen.&#10;&#10;This is done by playing cards to the table, each one representing another scrumptious asset of any highly regarded tea party.&#10;&#10;The players start the game with two morning tea cards in thier hand. The remaining cards will either be in a face-down deck, known as the Kitchen, or, a face-up row, known as the pantry.&#10;&#10;Each morning tea card has a special action which is carried out when it is played.&#10;&#10;The cards must be played to a particular postition in the player's spread (row), of cards. Players will usually attempt to play cards that belong in order next to each other. If they do not, more preparation time will have to be used, in order to push one's servants to work even harder.&#10;&#10;The game ends when a player plays the Elevenses card. This signifies that it is now 11 o'clock, the hour when guest will begin arriving. The players will then compare the value of thier morning tea cards in front of them. The player with the greatest spread wins the game - and the respect of the whole town - having hosted the finest morning tea of all!&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":0,"minAge":10,"categoriesAndMechanics":["Induction","Push Your Luck","Tile Placement"],"rating":2.75,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/yzRmdo6OoU2sgu4ZqKprGg__thumb/img/ke6609129mU8b2LW2DHUWFRutpI=/fit-in/200x150/filters:strip_icc()/pic7973776.jpg","urlImage":"https://cf.geekdo-images.com/yzRmdo6OoU2sgu4ZqKprGg__original/img/IuQWpPjcpMvihrK8fE9E_xM2D80=/0x0/filters:format(jpeg)/pic7973776.jpg"},{"bggId":"407291","name":"Gnomes In BURANO","description":"&#227;&#129;&#132;&#227;&#129;&#159;&#227;&#129;&#154;&#227;&#130;&#137;&#227;&#129;&#147;&#227;&#129;&#179;&#227;&#129;&#168;&#227;&#129;&#168;&#227;&#129;&#151;&#227;&#129;&#190;&#227;&#129;&#151;&#227;&#129;&#190;&#227;&#129;&#174;&#229;&#179;&#182; (Itazura kobito to shimashima no shima) is the Japanese title of this game, meaning Naughty Gnomes on Shimashima Island. &#227;&#129;&#151;&#227;&#129;&#190;&#227;&#129;&#151;&#227;&#129;&#190; is Shimashima, meaning Striped, &#229;&#179;&#182; is Shima (sounded like &#227;&#129;&#151;&#227;&#129;&#190;) meaning Island. But the publisher has given it a simpler English title 'Gnomes in Burano'. The theme of the game is the rows of coloured houses that need swapping about.&#10;&#10;The theme of the game is shown by the Striped housing cards. Each player has a total of 12 house tiles, (4 tiles of 3 different colours), and the aim is to complete the pattern in as few moves as possible.&#10;&#10;You can only turn over two Gnome cards at a time. Each player is free to choose which card to use first, which to remove, and which to move left or right. When everyone has moved their two Gnome cards, a new Gnome card is flipped over and the rearrangement continues.&#10;&#10;The game ends when someone completes the pattern of the theme card, and the player who completes the pattern wins. the game can be played solitaire.&#10;&#10;&#227;&#129;&#151;&#227;&#129;&#190;&#227;&#129;&#151;&#227;&#129;&#190;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#129;&#171;&#227;&#130;&#136;&#227;&#129;&#163;&#227;&#129;&#166;&#227;&#128;&#129;&#227;&#129;&#138;&#233;&#161;&#140;&#227;&#129;&#174;&#227;&#129;&#151;&#227;&#129;&#190;&#227;&#129;&#151;&#227;&#129;&#190;&#230;&#168;&#161;&#230;&#167;&#152;&#227;&#129;&#140;&#231;&#164;&#186;&#227;&#129;&#149;&#227;&#130;&#140;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#229;&#144;&#132;&#227;&#131;&#151;&#227;&#131;&#172;&#227;&#130;&#164;&#227;&#131;&#164;&#227;&#131;&#188;&#227;&#129;&#175;&#227;&#129;&#138;&#227;&#129;&#134;&#227;&#129;&#161;&#227;&#130;&#191;&#227;&#130;&#164;&#227;&#131;&#171;&#239;&#188;&#147;&#232;&#137;&#178;x4&#230;&#158;&#154;&#227;&#129;&#174;&#232;&#168;&#136;12&#230;&#158;&#154;&#227;&#130;&#146;&#230;&#140;&#129;&#227;&#129;&#161;&#227;&#128;&#129;&#227;&#129;&#147;&#227;&#129;&#179;&#227;&#129;&#168;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#129;&#167;&#230;&#177;&#186;&#227;&#130;&#129;&#227;&#130;&#137;&#227;&#130;&#140;&#227;&#129;&#159;&#230;&#149;&#176;&#229;&#173;&#151;&#227;&#129;&#174;&#230;&#158;&#154;&#230;&#149;&#176;&#227;&#129;&#160;&#227;&#129;&#145;&#230;&#138;&#156;&#227;&#129;&#141;&#229;&#135;&#186;&#227;&#129;&#151;&#227;&#129;&#166;&#229;&#183;&#166;&#229;&#143;&#179;&#227;&#129;&#174;&#227;&#129;&#169;&#227;&#129;&#161;&#227;&#130;&#137;&#227;&#129;&#139;&#227;&#129;&#171;&#227;&#129;&#164;&#227;&#129;&#170;&#227;&#129;&#146;&#227;&#130;&#139;&#227;&#129;&#147;&#227;&#129;&#168;&#227;&#129;&#167;&#228;&#184;&#166;&#227;&#129;&#179;&#227;&#129;&#139;&#227;&#129;&#136;&#227;&#129;&#166;&#227;&#129;&#132;&#227;&#129;&#141;&#227;&#128;&#129;&#227;&#129;&#167;&#227;&#129;&#141;&#227;&#130;&#139;&#227;&#129;&#160;&#227;&#129;&#145;&#229;&#176;&#145;&#227;&#129;&#170;&#227;&#129;&#132;&#230;&#137;&#139;&#230;&#149;&#176;&#227;&#129;&#167;&#227;&#129;&#138;&#233;&#161;&#140;&#227;&#129;&#174;&#227;&#129;&#151;&#227;&#129;&#190;&#227;&#129;&#151;&#227;&#129;&#190;&#230;&#168;&#161;&#230;&#167;&#152;&#227;&#130;&#146;&#229;&#174;&#140;&#230;&#136;&#144;&#227;&#129;&#149;&#227;&#129;&#155;&#227;&#130;&#139;&#227;&#129;&#147;&#227;&#129;&#168;&#227;&#130;&#146;&#231;&#155;&#174;&#230;&#140;&#135;&#227;&#129;&#151;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#10;&#228;&#184;&#128;&#229;&#186;&#166;&#227;&#129;&#171;&#227;&#130;&#129;&#227;&#129;&#143;&#227;&#130;&#139;&#227;&#129;&#147;&#227;&#129;&#179;&#227;&#129;&#168;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#129;&#175;2&#230;&#158;&#154;&#227;&#129;&#167;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#227;&#128;&#140;&#227;&#129;&#169;&#227;&#129;&#161;&#227;&#130;&#137;&#227;&#129;&#174;&#230;&#149;&#176;&#229;&#173;&#151;&#227;&#130;&#146;&#229;&#133;&#136;&#227;&#129;&#171;&#228;&#189;&#191;&#227;&#129;&#134;&#227;&#129;&#139;&#227;&#128;&#141;&#227;&#128;&#140;&#227;&#129;&#169;&#227;&#129;&#147;&#227;&#130;&#146;&#230;&#138;&#156;&#227;&#129;&#141;&#229;&#135;&#186;&#227;&#129;&#153;&#227;&#129;&#139;&#227;&#128;&#141;&#227;&#128;&#140;&#229;&#183;&#166;&#229;&#143;&#179;&#227;&#129;&#169;&#227;&#129;&#161;&#227;&#130;&#137;&#227;&#129;&#171;&#229;&#139;&#149;&#227;&#129;&#139;&#227;&#129;&#153;&#227;&#129;&#139;&#227;&#128;&#141;&#227;&#129;&#175;&#229;&#144;&#132;&#227;&#131;&#151;&#227;&#131;&#172;&#227;&#130;&#164;&#227;&#131;&#164;&#227;&#131;&#188;&#227;&#129;&#140;&#232;&#135;&#170;&#231;&#148;&#177;&#227;&#129;&#171;&#233;&#129;&#184;&#227;&#129;&#179;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#229;&#133;&#168;&#229;&#147;&#161;&#227;&#129;&#140;&#227;&#129;&#147;&#227;&#129;&#179;&#227;&#129;&#168;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;2&#230;&#158;&#154;&#229;&#136;&#134;&#227;&#130;&#146;&#229;&#139;&#149;&#227;&#129;&#139;&#227;&#129;&#151;&#231;&#181;&#130;&#227;&#130;&#143;&#227;&#129;&#163;&#227;&#129;&#159;&#227;&#130;&#137;&#227;&#128;&#129;&#230;&#150;&#176;&#227;&#129;&#151;&#227;&#129;&#143;&#227;&#129;&#147;&#227;&#129;&#179;&#227;&#129;&#168;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#130;&#146;&#227;&#130;&#129;&#227;&#129;&#143;&#227;&#129;&#163;&#227;&#129;&#166;&#228;&#184;&#166;&#227;&#129;&#179;&#227;&#129;&#139;&#227;&#129;&#136;&#227;&#130;&#146;&#231;&#182;&#154;&#227;&#129;&#145;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#10;&#232;&#170;&#176;&#227;&#129;&#139;&#227;&#129;&#140;&#227;&#129;&#138;&#233;&#161;&#140;&#227;&#129;&#174;&#230;&#168;&#161;&#230;&#167;&#152;&#227;&#130;&#146;&#229;&#174;&#140;&#230;&#136;&#144;&#227;&#129;&#149;&#227;&#129;&#155;&#227;&#129;&#159;&#227;&#130;&#137;&#227;&#130;&#178;&#227;&#131;&#188;&#227;&#131;&#160;&#227;&#129;&#175;&#231;&#181;&#130;&#228;&#186;&#134;&#227;&#129;&#167;&#229;&#174;&#140;&#230;&#136;&#144;&#227;&#129;&#149;&#227;&#129;&#155;&#227;&#129;&#159;&#228;&#186;&#186;&#227;&#129;&#174;&#229;&#139;&#157;&#227;&#129;&#161;&#227;&#129;&#167;&#227;&#129;&#153;&#227;&#128;&#130;&#10;--description by publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":10,"maxPlayTime":15,"minAge":6,"categoriesAndMechanics":["Puzzle","Pattern Building","Pattern Recognition","Solo / Solitaire Game","Tile Placement"],"rating":5,"complexity":0},{"bggId":"407298","name":"Bonnie and Clyde, Love at First Shot","description":"Bonnie and Clyde, Love at First Shot is an engaging solo game where you step into the shoes of Clyde Barrow. You must navigate a dangerous world, evading the police while trying to win Bonnie Parker's heart. Every decision matters, from resource management to avoiding law confrontations, as you carve your path to destiny.&#10;&#10;In this game, Bonnie&rsquo;s presence through her poetry is a constant influence on your choices. Her spirit and writings add a romantic and narrative dimension, as you, playing as Clyde, seek to earn her affection and forge the bond that will unite them in history.&#10;&#10;Gameplay: Each turn, you have (at best) 4 actions to distribute in order to optimally manage your resources while paying the cost of living and avoiding being imprisoned too often or too quickly. You need to accumulate poems, love, and boredom, as well as ammunition, before stealing a 1927 Ford A and embarking on the roads of &quot;Bonnie and Clyde, Love and Death&quot; before being killed by the police.&#10;&#10;-description from designer&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":10,"maxPlayTime":20,"minAge":14,"categoriesAndMechanics":["Worker Placement"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/m86E5fr0ZMfn_OiMUBBmaA__thumb/img/aVgCwiUYB9rsnmCakM6Z3R1Vkis=/fit-in/200x150/filters:strip_icc()/pic7880185.jpg","urlImage":"https://cf.geekdo-images.com/m86E5fr0ZMfn_OiMUBBmaA__original/img/gC18exPdbjDL-g4dfeuu-APzHaM=/0x0/filters:format(jpeg)/pic7880185.jpg"},{"bggId":"407299","name":"Justin & Dave's Awesome Would You Rather...? Board Game","description":"Deal an &lsquo;A&rsquo; and a &lsquo;B&rsquo; answer card to each player and place your mover piece on the start position. The person to the player&rsquo;s left picks up a card and reads the dilemma.&#10;&#10;The player must decide between &lsquo;A&rsquo; or &lsquo;B&rsquo; and places their answer card face down. Other players decide what they think the player has chosen and cast their votes.&#10;&#10;Everyone flips their cards OVER. If no-one guessed what the player chose the PLAYER moveS ahead 3 spaces, otherwise anyone who guessed what the player chose moves ahead 1 space.&#10;&#10;The first player to reach the finish space wins. If more than one player makes it to the finish at the same time &ndash; you&rsquo;re all winners!&#10;&#10;","minPlayers":3,"maxPlayers":99,"minPlayTime":0,"maxPlayTime":0,"minAge":16,"categoriesAndMechanics":["Party Game","Questions and Answers","Voting"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/-L3FyNHQv7pDoYA4ItQUnA__thumb/img/0AiZjvEAWqMsZeZM4swRfZpQUOs=/fit-in/200x150/filters:strip_icc()/pic7879390.jpg","urlImage":"https://cf.geekdo-images.com/-L3FyNHQv7pDoYA4ItQUnA__original/img/VXUqR8mc5I7zJSWkFXmVglSJzSo=/0x0/filters:format(jpeg)/pic7879390.jpg"},{"bggId":"407301","name":"Ternion Factor","description":"Contains rules for two games.&#10;&#10;Ternion Factor: on a unique grid of squares and triangles, players vie to get all their pieces on the board by occupying intersections and forcing their opponents to make unfortunate moves. Each turn a player does three actions, which have three interwoven consequences of adding or removing pieces, with a bit of luck thrown into the choice process. The first person with all eighteen pawns in the play area at the end of their turn is the winner.&#10;&#10;In &quot;Escape!&quot;: this is a Halma variant using this board. Escape! is a strategy game where pawns are jumped across the board to reach one of the intersections beyond the blue line on the other player's side of the board. The first player whose pawns all Escape! is the winner.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Abstract Strategy","Area Majority / Influence","Race"],"rating":1,"complexity":0},{"bggId":"407302","name":"RunnuRound","description":"A betting game to see who can correctly guess the number of sequences in a randomly created grid of tiles. Forty numbered tiles are shuffled and place in a 4x10 grid and players make secret bets on how many &quot;runs&quot; will be present. Then the tiles are flipped and everyone earns or loses points based on how close they were to their bet. First player to get 10 points wins.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Abstract Strategy","Betting and Bluffing"],"rating":1.5,"complexity":0},{"bggId":"407307","name":"Pack-Lash","description":"Packlash is a card game where two players have a 15 card deck with a different way to win. Each deck is filled with cards that either win you the game, get you closer to winning the game, or prevent your opponent from getting closer to winning. Items are your win condition or a static ability that changes the game until they are removed. On your turn you can play items and actions to get closer to winning; whereas your opponent can play reactions to piggy back off of your progress. Be the first to fulfill your unique win condition to succeed!&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":1,"maxPlayTime":5,"minAge":10,"categoriesAndMechanics":["Card Game","Interrupts","Multi-Use Cards","Take That","Variable Player Powers"],"rating":0,"complexity":0},{"bggId":"407314","name":"Dragon City: Battle of Taiyuan","description":"&#233;&#190;&#141;&#229;&#159;&#142;&#233;&#163;&#155;&#229;&#176;&#135;&#239;&#188;&#154;&#230;&#138;&#151;&#230;&#136;&#176;&#228;&#185;&#139;&#229;&#164;&#170;&#229;&#142;&#159;&#230;&#156;&#131;&#230;&#136;&#176; (&quot;Siege Songs: Battle of Xuzhou&quot;) is a two-player board wargame that simulates the battle of Beiping- Tianjin and the battle of Taiyuan, from Jul.7 , 1937 to Nov. 10, 1937. &quot;Dragon City&quot; is the third game in the War of Resistance series.&#10;&#10;Each turn represents 1 week and each hex is about 10-12 km across. Each unit is from battalion to division. One player commands the Imperial Japanese Army &#239;&#188;&#136;&#229;&#164;&#167;&#230;&#151;&#165;&#230;&#156;&#172;&#229;&#184;&#157;&#229;&#156;&#139;&#233;&#153;&#184;&#232;&#187;&#141;&#239;&#188;&#137; and the other player commands the National Revolutionary Army &#239;&#188;&#136;&#229;&#156;&#139;&#230;&#176;&#145;&#233;&#157;&#169;&#229;&#145;&#189;&#232;&#187;&#141;&#239;&#188;&#137;.&#10;&#10;In Siege Songs, each player uses operation points to activate Army HQ to lead combat units to move, barrage, combat. In each turn, each player draws tactic markers respectively and roll for initiative. The units include infantry, artillery, cavalry, and tank, etc. The NRA side needs to defend Xinkou, Pingxingguan, and Taiyuan in different scenarios to win the game.&#10;&#10;The components includes two 80cm*57cm inches map and 3 15mm die-cut counter boards.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":360,"minAge":12,"categoriesAndMechanics":["Wargame","World War II","Action Points","Dice Rolling","Hexagon Grid"],"rating":0,"complexity":0},{"bggId":"407317","name":"Cascadia: Rolling Hills","description":"Cascadia: Rolling is a series of puzzly flip-and-roll-and-write games featuring the habitats and wildlife of the Pacific Northwest! Simultaneously roll dice, collect wildlife, and complete habitat cards to fill in different environments in Cascadia. Use special actions to manipulate your dice, and dynamic completion cards to unlock powerful combos!&#10;&#10;There are two versions of Cascadia: Rolling. Each version features the following unique content - get both versions to play 1-8 players on 8 different maps!:&#10;&#10;A unique Central Special Die that changes the way each round plays out.&#10;&#10;4 unique Environment Sheets, based on a different region of Cascadia, each with its own special gameplay elements.&#10;&#10;30 Unique Habitat Cards with breathtaking art by Beth Sobel.&#10;&#10;8 Unique Advanced Completion cards for unique ways to combo discounts and bonuses each round!&#10;&#10;A unique mini-expansion that introduces completely new gameplay elements like end game scoring bonuses and competitive objectives to ramp up the competition!&#10;&#10;Roll your dice, collect wildlife and Nature Tokens, complete Habitat Cards, and fill in the puzzle on your personal Environment Sheet to create the most harmonious ecosystem in Cascadia! Although the core rules are simple, each unique Environment Sheet has its own twist so no two games of Cascadia: Rolling will play out the same!&#10;&#10;Cascadia: Rolling Hills features unique content specific to the prairie environments of Cascadia!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Abstract Strategy","American West","Animals","Dice","Environmental","Puzzle","Territory Building","Contracts","Dice Rolling","End Game Bonuses","Hexagon Grid","Line Drawing","Market","Multiple Maps","Paper-and-Pencil","Set Collection","Solo / Solitaire Game","Variable Set-up"],"rating":3.605385,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/mMRhKYMGTyoeKxmwXqpdNA__thumb/img/A_RLhXTJF4trW215qGKK2DWe47I=/fit-in/200x150/filters:strip_icc()/pic7880978.png","urlImage":"https://cf.geekdo-images.com/mMRhKYMGTyoeKxmwXqpdNA__original/img/zmeLh9JBDI7TspOVRcxp7Oy6FGM=/0x0/filters:format(png)/pic7880978.png"},{"bggId":"407318","name":"Cascadia: Rolling Rivers","description":"Cascadia: Rolling is a series of puzzly flip-and-roll-and-write games featuring the habitats and wildlife of the Pacific Northwest! Simultaneously roll dice, collect wildlife, and complete habitat cards to fill in different environments in Cascadia. Use special actions to manipulate your dice, and dynamic completion cards to unlock powerful combos!&#10;&#10;There are two versions of Cascadia: Rolling. Each version features the following unique content - get both versions to play 1-8 players on 8 different maps!:&#10;&#10;A unique Central Special Die that changes the way each round plays out.&#10;&#10;4 unique Environment Sheets, based on a different region of Cascadia, each with its own special gameplay elements.&#10;&#10;30 Unique Habitat Cards with breathtaking art by Beth Sobel.&#10;&#10;8 Unique Advanced Completion cards for unique ways to combo discounts and bonuses each round!&#10;&#10;A unique mini-expansion that introduces completely new gameplay elements like end game scoring bonuses and competitive objectives to ramp up the competition!&#10;&#10;Roll your dice, collect wildlife and Nature Tokens, complete Habitat Cards, and fill in the puzzle on your personal Environment Sheet to create the most harmonious ecosystem in Cascadia! Although the core rules are simple, each unique Environment Sheet has its own twist so no two games of Cascadia: Rolling will play out the same!&#10;&#10;Cascadia: Rolling Rivers features unique content specific to the riverine environments of Cascadia!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Abstract Strategy","American West","Animals","Dice","Environmental","Puzzle","Territory Building","Contracts","Dice Rolling","End Game Bonuses","Hexagon Grid","Line Drawing","Market","Multiple Maps","Paper-and-Pencil","Set Collection","Solo / Solitaire Game","Variable Set-up"],"rating":3.89,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/UvdyFCLA0LEddVA7o2gmpg__thumb/img/g7qCqrGZiPh0cdgxN-msWC7WMx0=/fit-in/200x150/filters:strip_icc()/pic7880984.png","urlImage":"https://cf.geekdo-images.com/UvdyFCLA0LEddVA7o2gmpg__original/img/YQiLJxkDjb9k5l6TN1Y_ZzbbDDk=/0x0/filters:format(png)/pic7880984.png"},{"bggId":"407321","name":"The Lovers","description":"You are the archangel Raphael. Your mission is find pairs of lovers from the Minor Arcana and connect their fate to each of the 22 Major Arcana of the Tarot deck. Nobles will help you by blessing the unions of certain lovers, but time is running out...&#10;&#10;The Lovers is a solitaire game played with a Tarot deck. The player takes on the role of the the archangel Raphael and must find 22 pairs of lovers from the Minor Arcana to connect their fates each to a different Major Arcana before the deck runs out. Lovers must share the same rank or the same suit, and their values can be added, subtracted, multiplied, or divided to match the value of a Major Arcana card. Nobles (represented by the court cards) can be used to bless certain unions, altering the individual or total value of the lovers. But they must be used sparingly, since the end of the deck means the end of the game.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":15,"maxPlayTime":30,"minAge":12,"categoriesAndMechanics":["Card Game","Math","Number","Hand Management","Move Through Deck","Solo / Solitaire Game"],"rating":5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/y-cd0WJv_hCFL0MSVpxBwQ__thumb/img/US5Ao-EkVJ5XgWxFN7ZVfsn6UWY=/fit-in/200x150/filters:strip_icc()/pic7880711.png","urlImage":"https://cf.geekdo-images.com/y-cd0WJv_hCFL0MSVpxBwQ__original/img/eWvJ8iJm8FxQ4GBUk7lhUlm86b8=/0x0/filters:format(png)/pic7880711.png"},{"bggId":"407343","name":"Ironwood","description":"An eternal conflict for the land of Ironwood is raging between two factions: the stalwart and hard-working Ironclad, settlers of the iron mountains; and the ferocious Woodwalkers, swift and deadly shadows of the forests. Both factions struggle for the ultimate control over the land for its greatest treasure: the Larimor Crystals, a mysterious substance holding immense energy within. It can be found both inside the colossal mountains and scattered across the dense forests.&#10;&#10;The Ironclad extract the essence of the crystals and process their energy to fuel their machines and mechanical inventions. If they succeed, their giant forges will swarm the land with endless armies, and establish ultimate dominance over Ironwood.&#10;&#10;The Woodwalkers use the crystals&rsquo; raw magical power to discover and retrieve three ancient totems from secret ritual sites, hidden in the mountains. Once retrieved, the combined power of these totems will summon the Guardian, the ancient protector of the woods, to wipe out the Ironclad once and for all.&#10;&#10;One way or another, the eternal conflict is finally coming to an end.&#10;&#10;Ironwood is a rules-light, highly asymmetric, card-driven tactical game for 1-2 players. Each round, you and your opponent alternate playing a total of 3 of your faction-specific cards for their action effects. These effects include positioning your warbands, initiating combat, extracting crystals, bestowing temporary passive effects, and many more. When combat occurs, you will use the same cards for their combat values instead, in a simultaneous bid to gain combat bonuses, inflict and fend off casualties, and augment the Dominance value of your warbands to win the combat.&#10;&#10;The two factions are completely asymmetric in their play styles, decks, victory conditions - even in which parts of the map they can access.&#10;&#10;As the Commander of the Ironclad, your primary goal is to lay down the foundations of your forges in the outer mountains, and once you have collected enough crystals, build forges on the foundations. As the Chieftain of the Woodwalkers, your mission is to locate your people&rsquo;s ancient totems through Vision cards, clear the path to them by defeating Ironclad warbands, and finally securing them in the outer forests, beyond the Ironclads&rsquo; reach. Once you have retrieved the third totem as the Chieftain, or built the third Forge as the Commander, you immediately win the game.&#10;&#10;Ironwood also features a low-upkeep solo mode against the Ironclad or the Woodwalkers. Although both solo opponents work on the same main principles, each of them bears its faction&rsquo;s unique aspects and features.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Fantasy","Wargame","Area Movement","Card Play Conflict Resolution","Command Cards","Hand Management","Multi-Use Cards","Pick-up and Deliver","Solo / Solitaire Game"],"rating":3.966665,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/bHjyk23An87Hl0ZuA91sTg__thumb/img/APzgIOZ7YNukCeoR0lERexoNR5Y=/fit-in/200x150/filters:strip_icc()/pic7885912.jpg","urlImage":"https://cf.geekdo-images.com/bHjyk23An87Hl0ZuA91sTg__original/img/E5S_FHGVPqwihXfws4S0VpVJjr0=/0x0/filters:format(jpeg)/pic7885912.jpg"},{"bggId":"407355","name":"秘宝の番人ゾンビゲーム (Keeper of the Hidden Treasure: Zombie Game)","description":"This is a game designed by Ginichiro Suzuki, and produced by Epoch. It is a game where you are exploring the underground, uncovering treasures, and fighting monsters, all in an attempt to get to the castle and have the most treasure.&#10;&#10;Hailed as a Masterpiece in Japan.  It is not so much the game, but the art of Ritta Nakanishi that makes this game so popular.  Ritta is noted for his military illustrations and military model art.  This game is fully illustrated from top to bottom (well, not the bottom of the box) with his wonderful art featuring all sorts of horror.&#10;&#10;In addition, the entirety of the box is used.  In fact, there are four tops/lids that are illustrated and used in the game.  The result is a three-dimension board where the players move through different levels.  There are even pitfalls at the highest level, as well as caves, in addition to foldable terrain pieces.  To top this off, there is a facade that fits to the back of the board featuring the game's objective. All this creates a highly immersed game experience.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":8,"categoriesAndMechanics":["Adventure","Exploration","Fighting","Horror","Zombies","Critical Hits and Failures","Dice Rolling","Grid Movement","Pieces as Map"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/gtM7iUdvCDNMAHawXexYfA__thumb/img/UoDBRI24xiauEfj4_4J39C1gx58=/fit-in/200x150/filters:strip_icc()/pic7882221.jpg","urlImage":"https://cf.geekdo-images.com/gtM7iUdvCDNMAHawXexYfA__original/img/zsQLI1LNZuyb7bmRpsTUxTDQ65k=/0x0/filters:format(jpeg)/pic7882221.jpg"},{"bggId":"407383","name":"まとりて！ (Matorite!)","description":"&#227;&#129;&#190;&#227;&#129;&#168;&#227;&#130;&#138;&#227;&#129;&#166;&#239;&#188;&#129; (Matorite!) is trick-taking card game from Japan using magic cards.&#10;&#10;Magic has the attributes of fire, water, earth and wind, and if the lead player uses magic of the fire attribute, the other players must also use magic of the fire attribute.&#10;&#10;However, if there is no fire-attribute magic in the hand, magic of another attribute can be used.&#10;Attributes have affinities, such as &quot;Fire &larr; Water &larr; Earth &larr; Wind &larr; Fire&quot;.&#10;&#10;If you can use water-attribute magic that is effective against fire-attribute magic in such a situation, you will be one step closer to victory.&#10;&#10;&#227;&#129;&#190;&#227;&#129;&#168;&#227;&#130;&#138;&#227;&#129;&#166;&#239;&#188;&#129;&#227;&#129;&#175;&#233;&#173;&#148;&#230;&#179;&#149;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#130;&#146;&#228;&#189;&#191;&#231;&#148;&#168;&#227;&#129;&#151;&#227;&#129;&#159;&#227;&#131;&#136;&#227;&#131;&#170;&#227;&#131;&#131;&#227;&#130;&#175;&#227;&#131;&#134;&#227;&#130;&#164;&#227;&#130;&#173;&#227;&#131;&#179;&#227;&#130;&#176;&#227;&#129;&#167;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#233;&#173;&#148;&#230;&#179;&#149;&#227;&#129;&#171;&#227;&#129;&#175;&#231;&#129;&#171;&#227;&#131;&#187;&#230;&#176;&#180;&#227;&#131;&#187;&#229;&#156;&#159;&#227;&#131;&#187;&#233;&#162;&#168;&#227;&#129;&#174;&#229;&#177;&#158;&#230;&#128;&#167;&#227;&#129;&#140;&#227;&#129;&#130;&#227;&#130;&#138;&#227;&#128;&#129;&#232;&#166;&#170;&#227;&#129;&#140;&#231;&#129;&#171;&#229;&#177;&#158;&#230;&#128;&#167;&#227;&#129;&#174;&#233;&#173;&#148;&#230;&#179;&#149;&#227;&#130;&#146;&#228;&#189;&#191;&#231;&#148;&#168;&#227;&#129;&#151;&#227;&#129;&#159;&#227;&#130;&#137;&#228;&#187;&#150;&#227;&#129;&#174;&#227;&#131;&#151;&#227;&#131;&#172;&#227;&#130;&#164;&#227;&#131;&#164;&#227;&#131;&#188;&#227;&#130;&#130;&#231;&#129;&#171;&#229;&#177;&#158;&#230;&#128;&#167;&#227;&#129;&#174;&#233;&#173;&#148;&#230;&#179;&#149;&#227;&#130;&#146;&#228;&#189;&#191;&#231;&#148;&#168;&#227;&#129;&#151;&#227;&#129;&#170;&#227;&#129;&#145;&#227;&#130;&#140;&#227;&#129;&#176;&#227;&#129;&#170;&#227;&#130;&#138;&#227;&#129;&#190;&#227;&#129;&#155;&#227;&#130;&#147;&#227;&#128;&#130;&#10;&#227;&#129;&#159;&#227;&#129;&#160;&#227;&#129;&#151;&#227;&#128;&#129;&#230;&#137;&#139;&#230;&#156;&#173;&#227;&#129;&#171;&#231;&#129;&#171;&#229;&#177;&#158;&#230;&#128;&#167;&#227;&#129;&#174;&#233;&#173;&#148;&#230;&#179;&#149;&#227;&#129;&#140;&#227;&#129;&#170;&#227;&#129;&#132;&#229;&#160;&#180;&#229;&#144;&#136;&#227;&#129;&#175;&#228;&#187;&#150;&#227;&#129;&#174;&#229;&#177;&#158;&#230;&#128;&#167;&#227;&#129;&#174;&#233;&#173;&#148;&#230;&#179;&#149;&#227;&#130;&#146;&#228;&#189;&#191;&#231;&#148;&#168;&#227;&#129;&#153;&#227;&#130;&#139;&#227;&#129;&#147;&#227;&#129;&#168;&#227;&#129;&#140;&#227;&#129;&#167;&#227;&#129;&#141;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#229;&#177;&#158;&#230;&#128;&#167;&#227;&#129;&#171;&#227;&#129;&#175;&#227;&#128;&#140;&#231;&#129;&#171;&larr;&#230;&#176;&#180;&larr;&#229;&#156;&#159;&larr;&#233;&#162;&#168;&larr;&#231;&#129;&#171;&#227;&#128;&#141;&#227;&#129;&#174;&#227;&#130;&#136;&#227;&#129;&#134;&#227;&#129;&#171;&#231;&#155;&#184;&#230;&#128;&#167;&#227;&#129;&#140;&#229;&#173;&#152;&#229;&#156;&#168;&#227;&#129;&#151;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#227;&#129;&#147;&#227;&#129;&#174;&#227;&#130;&#136;&#227;&#129;&#134;&#227;&#129;&#170;&#230;&#153;&#130;&#227;&#129;&#171;&#231;&#129;&#171;&#229;&#177;&#158;&#230;&#128;&#167;&#227;&#129;&#171;&#229;&#175;&#190;&#227;&#129;&#151;&#227;&#129;&#166;&#230;&#156;&#137;&#229;&#138;&#185;&#227;&#129;&#170;&#230;&#176;&#180;&#229;&#177;&#158;&#230;&#128;&#167;&#227;&#129;&#174;&#233;&#173;&#148;&#230;&#179;&#149;&#227;&#130;&#146;&#228;&#189;&#191;&#231;&#148;&#168;&#227;&#129;&#153;&#227;&#130;&#139;&#227;&#129;&#147;&#227;&#129;&#168;&#227;&#129;&#140;&#227;&#129;&#167;&#227;&#129;&#141;&#227;&#130;&#140;&#227;&#129;&#176;&#227;&#128;&#129;&#229;&#139;&#157;&#229;&#136;&#169;&#227;&#129;&#184;&#228;&#184;&#128;&#230;&#176;&#151;&#227;&#129;&#171;&#232;&#191;&#145;&#227;&#129;&#165;&#227;&#129;&#143;&#227;&#129;&#167;&#227;&#129;&#151;&#227;&#130;&#135;&#227;&#129;&#134;&#227;&#128;&#130;&#10;--description by publisher&#10;&#10;","minPlayers":3,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":12,"categoriesAndMechanics":["Card Game","Fantasy","Hand Management","Rock-Paper-Scissors","Trick-taking"],"rating":0,"complexity":0}]