[{"bggId":"341175","name":"Medieval Genius","description":"Overview&#10;Explore a game of Science, Technology, &amp; Engineering in a world of Mushrooms, Monsters, &amp; Magik. It is always your turn in this 4X, War-Mongering, Empire-Building, Real-Time-Strategy Board Game. There are 4 ways to win:&#10;   1st - Collect 6 Matching STEM Points&#10;   2nd - Muster 6 Mushroom Forests&#10;   3rd - Control 8 Trolls On the Map&#10;   4th - Get All Of The Battle Tokens By Taking Home Bases&#10;&#10;The Game &quot;Optimized For MAXIMUM Fun!&quot;&#10;Finally, a game with minimal waiting, where players take their turns simultaneously together &quot;First-Come First-Serve.&quot; Choose from a range of characters (minorities/women in STEM)! Explore a new map every game! Harness magik from Mushrooms around the world to make your character magical, or make investments that allow you to build a mighty empire or conduct research to refine your STEM skills, or recruit armies to defend yourself against both humans &amp; monsters!&#10;&#10;The Scenario&#10;Based on the book, &quot;The Art of Good Magik,&quot; The Black Sorcerer&rsquo;s quest for omniscience threatens destruction of all life in an Enchanted Land of Medieval Fantasy &amp; Magical Mystery. Scientists &amp; Engineers from Modern Earth awaken in this hallucination, and here you are, walking in their footsteps! Will you survive? Define how Magik, Military-Strategy, &amp; STEM might aid you in your rise to greatness!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":240,"minAge":14,"categoriesAndMechanics":["Civilization","Educational","Fantasy","Novel-based","Real-time","Moving Multiple Units","Pieces as Map","Real-Time","Tile Placement"],"rating":5,"complexity":0},{"bggId":"341177","name":"Zeichen und Wunder","description":"The game combines several tasks known from other games and places them in a religious-Christian context. The players solve tasks such as &quot;draw or pantomime a term&quot;, &quot;explain a term without taboo words&quot;, &quot;fill in a blank&quot;, &quot;name Christian terms with given initial letters&quot;. Whoever solves the task correctly moves his figure towards the goal. The players who correctly guess the terms are also rewarded. The winner is the one who reaches the goal first.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":3,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":10,"categoriesAndMechanics":["Action / Dexterity","Party Game","Religious","Acting","Track Movement"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/RRjAx0jvB6MS-gwtxuq2zg__thumb/img/LAXjky3QpURuSxibu1u2ULOs3M8=/fit-in/200x150/filters:strip_icc()/pic6243477.jpg","urlImage":"https://cf.geekdo-images.com/RRjAx0jvB6MS-gwtxuq2zg__original/img/JnwFA0DGaX-Hfc2x8Zla6ZViK48=/0x0/filters:format(jpeg)/pic6243477.jpg"},{"bggId":"341179","name":"99 Gemeinheiten","description":"The playing cards show different aggressive (mostly also punishable) actions with which one can annoy his fellow men (in the enterprise the bosses and colleagues). Two of these actions match each other and these cards are to be laid out by the players as a pair. The player who got rid of his hand cards ends the game. The winner is the player who has collected the most pairs.&#10;&#10;There are four different theme sets, each with the same game principle:&#10;&#10;     In marriage&#10;     In traffic&#10;     In business&#10;     Among friends&#10;&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":0,"maxPlayTime":0,"minAge":18,"categoriesAndMechanics":["Card Game","Humor","Mature / Adult","Hand Management","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/iLOTRVjWTfN2esELqfj-NA__thumb/img/JhKK5J0BsHjmIAxNpArJrLbfXgE=/fit-in/200x150/filters:strip_icc()/pic6243583.jpg","urlImage":"https://cf.geekdo-images.com/iLOTRVjWTfN2esELqfj-NA__original/img/hDnP6uMsgjt5Y5F_dKESEMJRBGg=/0x0/filters:format(jpeg)/pic6243583.jpg"},{"bggId":"341182","name":"Fußball-WM Würfelspiel","description":"Each player has a goalkeeper and 10 field players with whom he can move across the field. The ball itself is also represented as a game piece. The dice are rolled for the ball and the players. The player with the ball first moves the ball (horizontally, vertically or diagonally) to an unoccupied field, and then 3 of his field players, also horizontally, vertically or diagonally. The opposing player also moves 3 field players with the same number of dice. If a field player of the player previously in possession of the ball is standing by the ball after the movement, he remains in possession of the ball. If only one field player of the opponent is standing by the ball, the opponent gains possession of the ball. There are additional rules for the goalkeeper, fouls, offsides, offsides and penalty kicks. The player who has scored the most goals after an agreed period of time wins the game.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Dice","Sports","Dice Rolling","Grid Movement","Simulation"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/M6SODhl1FjWJM8JQizlTiA__thumb/img/Pr55ONfpG54RTRZRq4h4skUu3Qs=/fit-in/200x150/filters:strip_icc()/pic6243602.jpg","urlImage":"https://cf.geekdo-images.com/M6SODhl1FjWJM8JQizlTiA__original/img/QUKGVZOXpIf7RyFFS9oeAYzF57U=/0x0/filters:format(jpeg)/pic6243602.jpg"},{"bggId":"341183","name":"Årets Chef","description":"Meteors, zombies, strikes in the coffee industry, and African killer bees. Your company has had it's shares of wild scenarios. But how is the boss going to solve the problems? By having a crisis meeting? Or how about a pet pig for the employees? That should fix everything.&#10;&#10;In &quot;&Aring;RETS CHEF&quot; (&quot;Boss of the Year&quot;) players take turns being the boss of a fictional company, which is facing a series of wacky challenges. The boss has to &ndash; with the help of the employees &ndash; find the best solution.&#10;&#10;In the game the boss can be one of four types, which all makes decisions based on the characteristics of the given type. The boss can be the good boss, the bad boss, the nutty boss, and the burned-out boss. All four boss types are created as archetypes and are meant to spark some fun discussions and good laughs.&#10;&#10;The game is perfect for your company's next social event, or for a good evening with your friends.&#10;&#10;The game is played over 8 rounds in which the players take turn being the boss.&#10;In each round the player goes through the following phases:&#10;&#10;&middot; The boss is secretly dealt a boss type card.&#10;&middot; The boss draws a challenge card and reads it out loud.&#10;&middot; The employees play a solution card from their hand face down.&#10;&middot; Solution cards are shuffled and read out loud by the boss.&#10;&middot; The boss picks the solution that fits the boss type the best (the boss is always right in his/her choice).&#10;&middot; Players secretly guess what type the boss is.&#10;&middot; The boss reveals his/her boss type.&#10;&#10;Player who guessed the correct boss type, score their solution card (worth 1 point).&#10;If a least one player guessed the correct boss type, the boss scores the challenge card (worth 2 points).&#10;The player who played the solution card the boss choose, becomes the boss in the next round.&#10;&#10;After 8 round the players with the most points wins the game.&#10;&#10;","minPlayers":4,"maxPlayers":12,"minPlayTime":30,"maxPlayTime":45,"minAge":15,"categoriesAndMechanics":["Card Game","Deduction","Humor","Party Game","Deduction","Hidden Roles","Player Judge","Semi-Cooperative Game","Storytelling"],"rating":3.833335,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/gKnJqlQLQrwOuhldFUqD6A__thumb/img/_pbSizY1LWYrrCl8-a7CvXR-kGc=/fit-in/200x150/filters:strip_icc()/pic7305908.png","urlImage":"https://cf.geekdo-images.com/gKnJqlQLQrwOuhldFUqD6A__original/img/jABg3u3EVVlv_iW0S3O63RBFa5Y=/0x0/filters:format(png)/pic7305908.png"},{"bggId":"341185","name":"Das Kreuzwortspiel","description":"The players try to score as many points as possible by laying out letters in a colored crossword grid. They are free to choose which of the available letters they want to use. It should be noted that only valid German words (lexicon) can be formed, and valuable letters should be placed on own color fields if possible (plus points). Letters on opposing fields cause minus points. As soon as the target field has been reached, the game ends and the player with the most accumulated points wins.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":10,"categoriesAndMechanics":["Word Game","Square Grid","Tile Placement"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/u35ciyVyV3zTDJh0GLZV3g__thumb/img/AfaEOFJb4R3gx9IDwKD_me_c5NQ=/fit-in/200x150/filters:strip_icc()/pic6243902.jpg","urlImage":"https://cf.geekdo-images.com/u35ciyVyV3zTDJh0GLZV3g__original/img/kbECjZedbkXRiVUjeJz0Qv9xDi8=/0x0/filters:format(jpeg)/pic6243902.jpg"},{"bggId":"341188","name":"How Many Stars?","description":"In How Many Stars, players are 'Bidding' to get as close as possible to the answer to a question, such as &quot;How many stars are in the Milky Way&quot; or &quot;What % of Brits like Simon Cowell&quot;, without going over.&#10;&#10;Bid or Pass?&#10;&#10;Players take it in turns to &lsquo;bid&rsquo; on the answer, where the next bid must be a higher answer than the previous. If a player thinks that the answer has got too high, they can pass.&#10;&#10;Reveal!&#10;&#10;Once all players have passed except one, the answer is revealed. If the final player's answer is at, or below, the correct answer, they score points. If the answer is even just a fraction above, all the other players score points.&#10;&#10;Confident?&#10;&#10;Think you know the exact answer? Then slap your hand on the Star Card while shouting out the answer. If you're exactly correct, you score lots of points! If you're wrong, however, all the other players score lots of points! Risky.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":18,"minPlayTime":15,"maxPlayTime":30,"minAge":11,"categoriesAndMechanics":["Bluffing","Party Game","Trivia","Auction/Bidding","Betting and Bluffing","Push Your Luck","Team-Based Game"],"rating":3,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/rFLqhKzmq5-QuPdhvkMATw__thumb/img/XDAhhZ6eywyuJLEG29cirPQb4ZQ=/fit-in/200x150/filters:strip_icc()/pic6245526.jpg","urlImage":"https://cf.geekdo-images.com/rFLqhKzmq5-QuPdhvkMATw__original/img/R_nrPoeuxWydbEG9YkZFCUhLSak=/0x0/filters:format(jpeg)/pic6245526.jpg"},{"bggId":"341209","name":"Ashigaru: 1567","description":"The 16th century was a time of strife for Japan. Its many clans were autonomous, headstrong and resistant to unification. The emperor thus began a competition for shogun between his two greatest samurai. You and an opponent will vie for the title as you coerce one village after another, searching for the three resources vital to the creation of the fighting infantry called Ashigaru &ndash; men, food and gold. Will you be able to unite the major clans, better your opponent and become shogun? Find out by playing all three games of Ashigaru:1567 &ndash; making wise decisions, using clever card management, and playing winning 3-Card Poker hands! (Note: This is the first in a series of low-cost games using the 3CP Game Engine&trade;, which employs custom cards plus a user-supplied 52-card deck of standard playing cards.)&#10;&#10;During the game, players try to win Ashigaru cards by playing 3-card poker hands from a standard deck. However, it's not as simple as it first appears. Since you get a new card every round, will you hold onto a pair of jacks, for example, hoping for a third -- making three-of-a-kind? Or break up two Aces to use one in a straight? A simple, easily memorized chart determines what Ashigaru cards you get -- and the better your winning hand, the better the cards you win.&#10;&#10;There are three related games included, of easy to moderate complexity. All are simple to learn, fun to play and balanced, with a fairly high tension level.&#10;&#10;&#10;     Print &amp; Play cards available in Files section.&#10;     Professionally produced card deck available at thegamecrafter.com.&#10;&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":15,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Card Game","Print & Play","Card Play Conflict Resolution","Hand Management","Set Collection"],"rating":4,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/3zsdwUiGPiqjFx7Di-1AYA__thumb/img/63589TNFlqYgOsqGmvt_2xV2hik=/fit-in/200x150/filters:strip_icc()/pic6245604.jpg","urlImage":"https://cf.geekdo-images.com/3zsdwUiGPiqjFx7Di-1AYA__original/img/k_6CtHMfgHVEJ125NjW3cAB3YK4=/0x0/filters:format(jpeg)/pic6245604.jpg"},{"bggId":"341210","name":"Arazi: Batalla por los amuletos","description":"To protect Arazi, the king has summoned fierce adventurers to a trial. Only the first to obtain each one of the unique magical amulets will become Arazi's champion. Travel to exotic regions, face mighty bosses, and use the power of the amulets to defeat your rivals!&#10;&#10;All players start the game with three heart tokens and their pawn on the Arazi board space. On your turn, receive one Vaava token and roll for movement. Then you can move in any direction, use object cards and one of your amulet powers in any order. Each board space has different outcomes after landing. To obtain the amulets, players can go to each boss area and challenge one. Beating them is easy: roll the dice to defeat them or bribe them with Vaava tokens.  Each amulet will grant special powers that can secure your victory if used correctly. Avoid losing all your hearts to keep the lead. Also, be wary of your position since enemy players near you may try to steal your Vaavas, objects, or even an amulet if they succeed.&#10;&#10;In Arazi: the battle for the amulets, you will gather epic loot, challenge bosses, and even steal from other players to win. Players' decisions make each game different. There are many strategies in this free-for-all battle, get each unique amulet first and become Arazi's new champion.&#10;&#10;","minPlayers":3,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":60,"minAge":13,"categoriesAndMechanics":["Collectible Components","Dice","Fantasy","Fighting","Medieval","Bribery","Critical Hits and Failures","Dice Rolling","Race","Set Collection","Variable Set-up","Victory Points as a Resource"],"rating":3.5,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/YMIWI2FggSbXWhc2_gyvtQ__thumb/img/-H5wVSiUfVk__jSEjEzxE5k71oM=/fit-in/200x150/filters:strip_icc()/pic6523803.png","urlImage":"https://cf.geekdo-images.com/YMIWI2FggSbXWhc2_gyvtQ__original/img/sTDL-qKGJhX8dvW_hG01J0eUeWU=/0x0/filters:format(png)/pic6523803.png"},{"bggId":"341211","name":"Admiral: Naval clashes in the Second World War","description":"Admiral is a naval tabletop game, for two players, settled in the world war II, where each player commands ships from one of the six navy involved in the conflict: Kriegsmarine, Royal Navy, Regia Marina, Marine Nationale, U.S. Navy and Nippon Kaigun. This book provides you with all the rules you need to play, the features of all units involved and several missions to carry out.&#10;&#10;The rules are for ships in 1:1850 scale but easily adaptable for ships in 1:2.400 and 1:3000 scale through a conversion table.&#10;Each ships is identified by a number and a corresponding card and the game is divided in round.&#10;&#10;At the start of each round each player create its activation deck secretly choosing the activation sequence of its ships, then make an Initiative trow by a D6.&#10;&#10;First player reveal its first card and activate the corresponding ship: it will move and attack by a dice trow depending from the caliber of their guns (D6, D8, D10, D12). Then the second player will reveal its first card activating the corresponding ships and so on, until all unit will be activated.&#10;&#10;The rule book includes rules for aircraft carriers, aircraft, submarine and other special type of units and contain a section for carry out a campaign.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":40,"maxPlayTime":180,"minAge":12,"categoriesAndMechanics":["Miniatures","Nautical","Wargame","World War II","Action Points","Dice Rolling","Line of Sight","Measurement Movement","Movement Template","Scenario / Mission / Campaign Game","Stat Check Resolution","Variable Player Powers"],"rating":4,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/PpOL-AcNjVHGFa5mCM68fA__thumb/img/TAyGXDCRXJoi6JLcWlR5wkAZGCA=/fit-in/200x150/filters:strip_icc()/pic6252415.jpg","urlImage":"https://cf.geekdo-images.com/PpOL-AcNjVHGFa5mCM68fA__original/img/XHX_XquoTCrPV66r4x2gjmoTsHY=/0x0/filters:format(jpeg)/pic6252415.jpg"},{"bggId":"341213","name":"Panic Prey","description":"Panic Prey is a 1-4 player strategic board game inspired by the classic eighties film horror saga: ALIEN.&#10;&#10;Players assume the role of different crewmembers trapped aboard a spaceship with a deadly visitor: the panic predator (a.k.a., the Alien). Escape the ship, or finish off the creature!&#10;&#10;The game can be played either competitively or collaboratively, and has a sandbox nature where players have a wide range of challenges and options to modify the game&rsquo;s rules and adjust the difficulty, objective and overall experience as they wish. The board is procedurally generated, so whatever ship layout you will end up with will be unique to that game and will require you to adapt and improvise, allowing for many different possibilities and strategies.&#10; Players will have their crewmembers move across the ship avoiding the alien and must make the most out of the different tools and resources available to achieve their goal, locking doors and vents as needed, or using weapons when they have to.&#10;&#10;Keep a close eye on your enemies, but an even closer one on your friends, because no one wants to be the Panic Prey!&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Dice","Puzzle","Science Fiction","Area Movement","Cooperative Game","Dice Rolling","Modular Board","Semi-Cooperative Game","Solo / Solitaire Game","Traitor Game"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/HMRVzse-zShno48W61H7XA__thumb/img/I7wyccYvVgDCDuI0uNG5SBqwcCI=/fit-in/200x150/filters:strip_icc()/pic6263215.png","urlImage":"https://cf.geekdo-images.com/HMRVzse-zShno48W61H7XA__original/img/PRni2mQYB9kDVfZd6dE7gxG5keE=/0x0/filters:format(png)/pic6263215.png"},{"bggId":"341214","name":"Totalandrin","description":"Totalandrin offers you a selection of the shortest and most impactful holorimes through a card game that will give you a smile on any occasion.&#10;&#10;Better than an Alexandrian, each pair of cards makes it possible to reconstitute a rich rhyme which is pronounced identically over the entire length of the 2 lines.&#10;&#10;Rules:&#10;&#10;     Reconstitute the pairs by memorizing their position, face down.&#10;     Each player turns over 2 cards, in turn, and covers them again if they do not constitute a pair. If you flip a pair in the order of the sentence, you can replay.&#10;     The mystery card, containing a QR code, embellishes the part of a digital and interactive interlude. You just have to scan the map with a phone to be guided in the actions to be taken.&#10;&#10;&#10;Winning:&#10;  When there is nothing left to return, whoever has collected the most cards wins!&#10;&#10;The game can be played, with or without a phone, from 3 years old to 123 years old!&#10;  For the youngest, the association of images is enough to reconstitute the pairs.&#10;  For candidates for the French Academy, repeating the same sounds, giving a different meaning, is an excellent mnemonic means to discover associations of words while having fun.&#10;&#10;&mdash;description from the designer'&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":30,"minAge":3,"categoriesAndMechanics":["Card Game","Children's Game","Educational","Humor","Memory","Memory","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/lGLuh7cQzwe7qELNfwzzJA__thumb/img/BLddzZUcfQ06lY2DDrmE6CiElIo=/fit-in/200x150/filters:strip_icc()/pic6254207.jpg","urlImage":"https://cf.geekdo-images.com/lGLuh7cQzwe7qELNfwzzJA__original/img/eLNFdcGCqZSSSyBiRHxIr0XAh-c=/0x0/filters:format(jpeg)/pic6254207.jpg"},{"bggId":"341219","name":"Yooka-Laylee","description":"Yooka-Laylee has been treated to its very own tabletop game courtesy of Limited Run Games' Game Decks series. Race your friends to collect 3 Pagies in this official Yooka-Laylee tabletop game!&#10;&#10;This &quot;chaotic&quot; game has two to four players jumping into a new adventure with Yooka, Laylee, and a whole host of characters and collectables inspired by the video game series. It features a modular build-your-own-board system that can be different each time you play. You can even combine it with other Game Decks releases like the Mutant Mudds set.&#10;&#10;Here's what to expect:&#10;&#10;&#10;     36 Modular Level Cards.&#10;     2 Bonus Mini Games.&#10;     Powerups &amp; quills, quills, quills! Use quills to buy Glide, Reptile Roll and Honey Puddle powerups to give yourself an edge over your opponents.&#10;     Fun Ghost Writer Challenges. Have you got what it takes to beat their fiendish challenges and earn a bucket-load of points?&#10;     Characters you love (and hate)! You&rsquo;ll find Blasto, Kartos, Trowzer and TONS more sprawled across the Game Decks board, brought to life with stunning hand-painted artwork.&#10;     Combine with other Game Decks to play with more people!&#10;&#10;&#10;There are three options to choose from. A Standard Edition, a Special Edition and a Gold Edition. The Standard &amp; Special Editions come with the &quot;Standard&quot; version of the game (orange bar across top of box), whereas the Gold Edition comes with the &quot;Gold&quot; version of the game (gold foil across the top of the box). The Special &amp; Gold Editions come with additional items not included with the Standard Edition (such as a graphic novel, CD, art cards, etc.).&#10;&#10;Race your friends to collect 3 Pagies in this official Yooka-Laylee tabletop game! Players must collect Pagie Token Cards by purchasing them with points they've earned during gameplay.&#10;&#10;Designed for 2-4 players, the Yooka-Laylee board game uses a deck of cards to create a unique modular board. Players work alongside Yooka and Laylee to move around the board, using quills to buy Glide, Reptile Roll and Honey Puddle powerups to get an edge over their opponents. Points can also be earned by beating the challenges posed by The Ghost Writers. The board is covered in hand-painted by art that includes other characters, such as Blasto, Kartos, and Towzer.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":30,"minAge":14,"categoriesAndMechanics":["Card Game","Video Game Theme","Modular Board","Roll / Spin and Move"],"rating":1.25,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/UOKJXfCl3hDQMvXICteS8g__thumb/img/I_t1XpxjDB4acXkl1to8R10Gg1I=/fit-in/200x150/filters:strip_icc()/pic6254234.jpg","urlImage":"https://cf.geekdo-images.com/UOKJXfCl3hDQMvXICteS8g__original/img/n1f0x6c_1C7RxapHIVkustwfBZc=/0x0/filters:format(jpeg)/pic6254234.jpg"},{"bggId":"341223","name":"Herman Hedning: FrogWhack!","description":"The game contains a deck of 66 cards (and that is WITHOUT the sinister planned expansions). Each player gets 3 &quot;Whacking Cards&quot; which are used to win the illustrated point cards that are turned up one after the other in rapid fashion... but only if you hit the &quot;Whack Board&quot; FIRST, after you decide that the cards in the visible batch are in your favour.&#10;&#10;The different cards in the deck give you bonuses or penalty points, according to a devious system. But you have to be QUICK &ndash; and once your first Whacking Card is used, that is that and you now only have two left!&#10;&#10;After each round your points are summed up, and the next round is played in the same way... but perhaps THIS time you will react faster than your opponents, and get your hands on those desirable high-value cards!&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":3,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":10,"categoriesAndMechanics":["Card Game","Comic Book / Strip","Real-Time","Set Collection"],"rating":3.5,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/_du4TAhdk356VclXCSeItQ__thumb/img/_a7ccawPGz8M1ZyD2d8z4U2JEe4=/fit-in/200x150/filters:strip_icc()/pic6311275.jpg","urlImage":"https://cf.geekdo-images.com/_du4TAhdk356VclXCSeItQ__original/img/AcOq3olnxMSG6_h1qZDMImY-KFU=/0x0/filters:format(jpeg)/pic6311275.jpg"},{"bggId":"341226","name":"Möhrenjagd","description":"Each child is given a rabbit figurine with which to collect five carrots. The figures move across the playing field, either above ground with the result of the white die or below ground with the result of the blue die. A player has the right to collect carrots on certain fields until he is caught by another player, who then takes over this right. In addition, carrots can also be obtained with the white die. The first player to collect five carrots wins the game.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":20,"minAge":5,"categoriesAndMechanics":["Animals","Children's Game","Dice","Dice Rolling","Roll / Spin and Move","Track Movement"],"rating":3.75,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/LfVsQ5TYqsYxU01XuJd2cA__thumb/img/79Q8oUlZTPM39zbtjQrV5JE_hjY=/fit-in/200x150/filters:strip_icc()/pic6245274.jpg","urlImage":"https://cf.geekdo-images.com/LfVsQ5TYqsYxU01XuJd2cA__original/img/J9_ubR3Z7WS9QxeijC6qQCsRXCY=/0x0/filters:format(jpeg)/pic6245274.jpg"},{"bggId":"341227","name":"Test of Resolve","description":"Innovative wargame rules for the Wars of the Roses&#10;&#10;Delivering period characteristics without undue complexity&#10;&#10;High-quality rules, scenario books, PDFs, game cards &amp; digital downloads&#10;&#10;Test of Resolve requires only one twelve-sided die (D12) per side &ndash; and your figures! The game plays out with a small deck of cards representing the opposing factions. These cards are designed to introduce an innovative, realistic and exciting unpredictability to the game flow &mdash; and remind the players that commanders had little control of events when the fighting started!&#10;&#10;The historical scenarios are typically completed in 1 to 2 hours, and all are designed to be played on a 180 x 120cm (6&rsquo; x 4&rsquo;) table with 28mm (or smaller) figures.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":60,"maxPlayTime":180,"minAge":0,"categoriesAndMechanics":["Medieval","Miniatures","Wargame","Dice Rolling","Measurement Movement","Simulation"],"rating":4.25,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/o2VnHeQ4J8R6ov0vyBFD-Q__thumb/img/ysrN70WWFviOb8UYWuyqlaGA0rk=/fit-in/200x150/filters:strip_icc()/pic6249840.png","urlImage":"https://cf.geekdo-images.com/o2VnHeQ4J8R6ov0vyBFD-Q__original/img/acEvRMLyCWygIfRywVB_mAEl4r4=/0x0/filters:format(png)/pic6249840.png"},{"bggId":"341229","name":"Diesel Overlord","description":"GRAB YOUR MINIS.&#10;SET THE TABLETOP ON FIRE.&#10;RULE THE WASTELAND!&#10;&#10;Welcome to Diesel Overlord, the explosive, easy-to-start post-apocalyptic tabletop miniature skirmish game. No more 100-page rulebooks with dozens of diagrams. Everything you need to know to begin a game is written on a single playing card.&#10;&#10;Just because it&rsquo;s easy to get going doesn&rsquo;t mean it&rsquo;s simple. There are deep strategies and tactics built throughout the game on the cards you'll hold in your hands: different types of unit cards to represent your models, upgrades to make them uniquely powerful, explosively combustible terrain rules to build an interactive battlefield, and mission cards to help you achieve victory&mdash;and declare yourself Overlord.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Miniatures","Science Fiction","Wargame","Dice Rolling","Measurement Movement"],"rating":3,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/VKsKCqkvK5aD5ehNcLoZZQ__thumb/img/qBZkEHsu45SNpAjG34AXOJdJJxE=/fit-in/200x150/filters:strip_icc()/pic6249842.jpg","urlImage":"https://cf.geekdo-images.com/VKsKCqkvK5aD5ehNcLoZZQ__original/img/aIB94KDkCJHpcQ_UJ-5xoZdssj4=/0x0/filters:format(jpeg)/pic6249842.jpg"},{"bggId":"341231","name":"Honeybee Brain Hexadoug Chess","description":"A Chess game on a hexagon grid with altered movement rules for the pieces. The grid consists of hexes in 3 different colors, evenly distributed. The hoppers (6 of them for each player) are bound to the field color. There are no bishops used in the game.&#10;As in chess the object of the game is to mate the enemy king.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Abstract Strategy","Grid Movement","Hexagon Grid","Pattern Movement","Static Capture"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/wRNLW1gejhhTKnLkDmdIBg__thumb/img/nX6OxKnRK8_fvW6zmYsu4bo_H6Q=/fit-in/200x150/filters:strip_icc()/pic6245326.jpg","urlImage":"https://cf.geekdo-images.com/wRNLW1gejhhTKnLkDmdIBg__original/img/UuzqUCR_MdeAYwueplwx9eESeho=/0x0/filters:format(jpeg)/pic6245326.jpg"},{"bggId":"341234","name":"Spi-Trap","description":"You must guess the secret word before the opponents push you to the center of the board.&#10;&#10;From the back of the box:&#10;&#10;THIS MOST THRILLING GAME IS MOST FUN &#10;FOR PLAYERS OF MOST AGES!&#10;&#10;In the game you score points by discovering &#10;letters in a &quot;secret&quot; word.&#10;&#10;The points are then used to drive the opponents &#10;further and further into the spider's web &#10;towards the waiting spider in the centre.&#10;&#10;CONTENTS: Board&#10;4 markers, 20 markers in 4 colours&#10;1 special dice (1, 2, 3 x 2)&#10;rules&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Word Game"],"rating":0,"complexity":0},{"bggId":"341235","name":"Dark Syndicate","description":"Dark Syndicate is a 1 to 4 player area control game that takes place over the course of 6 rounds. Each player will control a unique Gang that represents a specific Supernatural Faction. The player will use Cash to increase their control over the City, buy resources and information, and recruit unique Criminals to protect and expand their dark empire. Each Gang will gain Reputation and the first to 40 Rep wins the game.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":240,"minAge":13,"categoriesAndMechanics":["Horror","Mafia","Territory Building","Zombies","Dice Rolling","End Game Bonuses","Events","Income","Interrupts","Modular Board","Moving Multiple Units","Victory Points as a Resource","Zone of Control"],"rating":3,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/wWTymAmCWSfIa78Iky29Xw__thumb/img/2CgP9nRZ0SBDSikPNAdweB6pLe4=/fit-in/200x150/filters:strip_icc()/pic6393531.jpg","urlImage":"https://cf.geekdo-images.com/wWTymAmCWSfIa78Iky29Xw__original/img/xvvBepmPyIJcIOyCeYJFc0_Bodw=/0x0/filters:format(jpeg)/pic6393531.jpg"},{"bggId":"341246","name":"Carte Rouge","description":"A strange, enigmatic deck of cards has fallen into your hands via the renowned Infiniti Institutes. It's an old, old artifact and they need your help uncovering the secrets contained therein.&#10;&#10;Use your wits, code-breaking, and research skills to uncover the different, mysterious chapters within this deck of playing cards and win the game!&#10;&#10;Much like the Unlock and EXIT series of puzzle games, turns aren't delineated player-by-player, but rather all players work together to solve codes and puzzles. The game ends and the players win when they have uncovered all the solutions and submitted them in the website they uncover during play.&#10;&#10;","minPlayers":1,"maxPlayers":10,"minPlayTime":120,"maxPlayTime":360,"minAge":16,"categoriesAndMechanics":["Card Game","Deduction","Murder/Mystery","Puzzle","Deduction","Solo / Solitaire Game"],"rating":3.4375,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/QgbhaCeiRtVo8yCSDgOEGQ__thumb/img/U_ed9dB2OijJxV__b_yah_k3mcg=/fit-in/200x150/filters:strip_icc()/pic6270612.jpg","urlImage":"https://cf.geekdo-images.com/QgbhaCeiRtVo8yCSDgOEGQ__original/img/G-RSsLnlqgrhlREd1u6tsyScjDE=/0x0/filters:format(jpeg)/pic6270612.jpg"},{"bggId":"341253","name":"A Song of Ice & Fire: Tabletop Miniatures Game – R'hllor Lightbringers","description":"House Baratheon is well known for equipping their troops in some of the heaviest armor found on the battlefields of Westeros. While other Houses might also do this for their frontline combat troops or heavily-barded cavalry, House Baratheon&rsquo;s zeal for heavy armor even extends to their support units. The R&rsquo;hllor Lightbringers are some of the most heavily armored archers that will take to the field. Though most enemies are more concerned with the flaming arrows they fire rather than the armor they&rsquo;re wearing.&#10;&#10;The R&rsquo;hllor Lightbringers unit box for the A Song of Ice and Fire: Tabletop Miniatures Game gives House Baratheon players a new ranged unit to add to their forces. Loyal to Stannis Baratheon, they are some of the most heavily armored ranged units in the game. And their flaming arrows are certainly to not be overlooked, either.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Expansion for Base-game","Fantasy","Miniatures","Novel-based","Wargame","Dice Rolling","Hand Management","Measurement Movement","Worker Placement"],"rating":4.1,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/ji3rQc_796sLXmxQGIFLmg__thumb/img/vqxT_6lAys4CXV0LG6oGARhouSo=/fit-in/200x150/filters:strip_icc()/pic6434407.jpg","urlImage":"https://cf.geekdo-images.com/ji3rQc_796sLXmxQGIFLmg__original/img/7Xjd86n63r6fd-bm2VmDhpzIykk=/0x0/filters:format(jpeg)/pic6434407.jpg"},{"bggId":"341258","name":"A Song of Ice & Fire: Tabletop Miniatures Game – Mormont She-Bears","description":"Most of the soldiers marching to battle in Westeros&rsquo; wars are men. Many people feel that a woman&rsquo;s place is back home, running things there. But for House Mormont, their She-Bears gladly head to war, taking up arms just like any other soldier. Drawing inspiration in armor and weaponry from legendary warrior Lady Alysane Mormont, they are a rough and rugged fighting force that will stand toe-to-toe with some of the heaviest units other Houses can field.&#10;&#10;The Mormont She-Bears Unit Box for the A Song of Ice and Fire: Tabletop Miniatures Game gives House Stark players a durable unit for their forces. These tough women are outfitted with thick leather and sturdy plate mail, making them able to turn away enemy blows with ease. Offensively, they attack mercilessly with two-handed maces, able to crush enemy armor with a single blow. The more dire the situation, the harder the She-Bears fight, often carrying on in battle past near-fatal wounds.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Expansion for Base-game","Fantasy","Miniatures","Novel-based","Wargame","Dice Rolling","Hand Management","Measurement Movement","Worker Placement"],"rating":4.25,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/i4xB9A3fuHjDa7grEJJnCg__thumb/img/qSiVrt7GSO7-cETufSeWjAZqVPY=/fit-in/200x150/filters:strip_icc()/pic6434457.jpg","urlImage":"https://cf.geekdo-images.com/i4xB9A3fuHjDa7grEJJnCg__original/img/WnwSEtmc84DGus22XVLiLVWW36U=/0x0/filters:format(jpeg)/pic6434457.jpg"},{"bggId":"341259","name":"Backfire","description":"Lose your marbles and have a blast!! In this explosive game of rolling your problems to someone else.&#10;&#10;Imagine playing a game of grenade catch with your friends... While wearing mittens and there being more grenades than you have hands.&#10;&#10;Try not to keep your balls to yourself!&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":10,"maxPlayTime":40,"minAge":12,"categoriesAndMechanics":["Card Game","Player Elimination"],"rating":3.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/AYKDU0eRiBEjcdf21vKCOQ__thumb/img/m6cQCK_MjkCwpLBqJtq9TujO57Y=/fit-in/200x150/filters:strip_icc()/pic6268028.png","urlImage":"https://cf.geekdo-images.com/AYKDU0eRiBEjcdf21vKCOQ__original/img/jeFB2xCTj3VjQlMhVSNbcxt5LMM=/0x0/filters:format(png)/pic6268028.png"},{"bggId":"341271","name":"Operation Basterds","description":"In Operation Basterds your objective is to rescue prisoners from a concentration camp where you will go through different phases or areas of the game such as the jungle or the airport, where your machine gun will be your best weapon that can lead you to victory, as well as dodging obstacles in the jungle. Several games in one that will make you feel the emotion of one of the best shooters of the 80s.&#10;A game to be played in solitaire mode or up to 5 players, in which you roll all the dice on your mission sheet. Choose and shoot all the dice on a zone of operations between MAP, ENGAGEMENT, AIR STRIKE AND PRISONERS. Soldier remember, each die you roll off the game sheet will be counted as wounds! For each wound you will lose one die for future throws, if you lose your six dice it is GAME OVER.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":20,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Dice","Print & Play","Vietnam War","Dice Rolling","Paper-and-Pencil","Push Your Luck"],"rating":3.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/htzTpAX2q3M1cDFqY5lDkQ__thumb/img/rq5wCvI1hQPTJp1VYYsPyZddF48=/fit-in/200x150/filters:strip_icc()/pic6252719.jpg","urlImage":"https://cf.geekdo-images.com/htzTpAX2q3M1cDFqY5lDkQ__original/img/I2mdfYGEFNqBuNBRHDbGT3iSFUo=/0x0/filters:format(jpeg)/pic6252719.jpg"},{"bggId":"341272","name":"Card-Z","description":"A gritty, realistic zombie survival card game set in a suburban neighborhood. Plays 1-4 players in 1-4 hours depending on the scenario. There are 8 scenarios: Home Run, Rescue 911, Survive, Civic Duty, Mission from God, Pub Run, Horde Annihilation, and Zombie Count.&#10;&#10;You start with 2 characters; each with a heroic action, loot, pawn, &amp; a backpack organized using your player mat.&#10;&#10;The neighborhood map is dealt into 1 of 3 patterns depending on the scenario.&#10;&#10;A game turn is one &quot;day&quot;. It has 3 action phases&ndash;dawn, day, night&ndash;and 1 reckoning phase when survivors must eat food or starve.&#10;&#10;Players scout locations by rolling for encounters &amp; battle them on a hex-based universal battlefield. Clear cache locations to win rewards, or win fresh food fishing, hunting, or trapping on terrain locations. Be careful, though, because if you are forced to retreat from a battle, you must clear the location you retreat to or die trying.&#10;&#10;The game ends when you meet the end condition of the scenario, or if your survivors die.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":300,"minAge":14,"categoriesAndMechanics":["Card Game","Horror","Zombies","Cooperative Game","Critical Hits and Failures","Dice Rolling","Hexagon Grid","Memory","Movement Points","Once-Per-Game Abilities","Simulation","Solo / Solitaire Game","Zone of Control"],"rating":5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/IZ1whksn6nOLKky_NoDQBg__thumb/img/nrKIiNfwVrmaWC-ZbwKOf2xa0K4=/fit-in/200x150/filters:strip_icc()/pic6257711.jpg","urlImage":"https://cf.geekdo-images.com/IZ1whksn6nOLKky_NoDQBg__original/img/BAldEmP93mhNCIAZV4XuTv0Hkvg=/0x0/filters:format(jpeg)/pic6257711.jpg"},{"bggId":"341274","name":"Haute Kuhture","description":"Every year in autumn the farmers of Kuhmatten present their cows on the catwalk trying to earn appreciation for the most beautiful ones.&#10;Each player has two small stacks of front and rump parts of the animals. And getting dressed the cows not always achieve matching front and rump clothes which would be most valuable. So, there are always different ratings. After the rating each player has to remove one card that is saved adding to his final result.&#10;These missing cards change the possible ratings for the following votes which will take place one after another recyclying used stacks until one of the stacks is totally empty.&#10;The winner is the player with the highest sum of numbers on his saved cards.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":10,"maxPlayTime":15,"minAge":8,"categoriesAndMechanics":["Card Game","Memory","Highest-Lowest Scoring","Memory","Physical Removal","Sudden Death Ending"],"rating":3,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/v8Ne7h3CWTBUzaQjhIkkGQ__thumb/img/7k6N7hxi7Rgv-EM6brxI88baf3w=/fit-in/200x150/filters:strip_icc()/pic7127346.jpg","urlImage":"https://cf.geekdo-images.com/v8Ne7h3CWTBUzaQjhIkkGQ__original/img/DzOcP_Mr2BXMPm9EB0Sz3aSTUvM=/0x0/filters:format(jpeg)/pic7127346.jpg"},{"bggId":"341276","name":"Roll Business","description":"Roll Business is a write and roll game for 1-8 players. Play is simultaneous so there is no downtime between players. Roll Business is video conference friendly too. All that is required is a printout of the game sheet and 5 six sided dice per player. If you don&rsquo;t have that many dice you can use a dice rolling app or even free random number generators. You will mark the game sheet with pencil or you can laminate the sheet and use a dry erase marker.&#10;&#10;You will compete over several rounds in the game. At the end of each round you will see how well your movie does at the box office and if you win any awards. The winner will be the player with the most prestigious career.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":8,"minPlayTime":30,"maxPlayTime":40,"minAge":12,"categoriesAndMechanics":["Dice","Movies / TV / Radio theme","Print & Play","Paper-and-Pencil","Re-rolling and Locking","Simultaneous Action Selection","Solo / Solitaire Game"],"rating":2.25,"complexity":0},{"bggId":"341278","name":"Explorers of the Lost World","description":"In Explorers of the Lost World, you lead a team of two explorers (choose from Cowboy, Movie Director, Geologist, Biologist, Archeologist, Doctor, Journalist through the island, trying to survive dinosaur and giant creature attacks (Almost everything that moves is gigantic and yes there are giant gorillas).&#10;&#10;Based on the Source of the Nile mechanics, you will map terrain and discover great and terrible things in almost every hex you visit. Gain Victory points with every time you defend against a creature. Snakes grow to unbelievable lengths and provide additional VP opportunities for their discovery. You will always be tracking at least one specific creature and gain VPs upon its discovery, then move on to another creature type. Rivers, ravines, jungle, mountains, veldt, are some of the terrain features you will face and each provides a local threat upon entering. Additionally there is a great lake that can be crossed for adventure and certain peril as well as a great mysterious mountain with caves to explore for additional treasures and VPs and certain peril.&#10;&#10;The explorer with the most victory points at the end, wins.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":120,"maxPlayTime":480,"minAge":9,"categoriesAndMechanics":["Exploration","Events","Solo / Solitaire Game","Variable Player Powers"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/eSjGT_-OBrpWdGTc8FLyUw__thumb/img/Kuc-onai1kFmgy2EHZvHKDaiT5g=/fit-in/200x150/filters:strip_icc()/pic6252862.png","urlImage":"https://cf.geekdo-images.com/eSjGT_-OBrpWdGTc8FLyUw__original/img/bY-BzWxC9VeRUlBcxhGf6FOz3CU=/0x0/filters:format(png)/pic6252862.png"},{"bggId":"341285","name":"Wardens of Wulvengrad","description":"A cooperative monster hunting boss battler for 1-4 players against AI controlled monsters set in the low fantasy kingdom of Wulvengrad.&#10;Each hunter has a unique deck of actions and abilities, with every card being split in 2 - an action which can be played during the hunter's turn, or a reaction which can be played at any time! Will you attack with everything, or hold some back to defend against a counterattack? - the choice is yours. Your cards are also your stamina, so burning through your deck too quickly means you'll have to rest to recover them.&#10;Monsters are controlled with a 3 tier AI deck, with attacks increasing in severity. The monster's health is made up of a token draw bag containing wounds, armour and counterattacks - no 2 fights will be the same! Only through teamwork and planning can you control the flow and defeat the monster before it kills you!&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":90,"minAge":14,"categoriesAndMechanics":["Adventure","Card Game","Fighting","Miniatures","Card Play Conflict Resolution","Cooperative Game","Deck Construction","Deck, Bag, and Pool Building","Grid Movement","Hand Management","Hexagon Grid","Modular Board","Solo / Solitaire Game","Variable Player Powers"],"rating":0,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/Sx2tJVnlBLHM9bJRg7VjXQ__thumb/img/8hEWA6ZkLIcmHxBuwE4Th24gCig=/fit-in/200x150/filters:strip_icc()/pic6260011.jpg","urlImage":"https://cf.geekdo-images.com/Sx2tJVnlBLHM9bJRg7VjXQ__original/img/cymhqUJ2af_nHBAjsLw6D07DLEE=/0x0/filters:format(jpeg)/pic6260011.jpg"},{"bggId":"341287","name":"Pest Control: A Conservation Race","description":"Pest Control is a map building race game for up to 5 players. Players place cards to create a map which then acts as the board for a race to collect tokens.&#10;&#10;Custom dice allow players to move other players and &quot;pest&quot; characters around the board to hinder other players.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Card Game","Children's Game","Dice","Exploration","Map Addition"],"rating":5,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/3eKWqGPGKLJJPsIKxNzFmA__thumb/img/FUy_Qgrh4cveFE8Vm9z_UOHnnLg=/fit-in/200x150/filters:strip_icc()/pic6257943.jpg","urlImage":"https://cf.geekdo-images.com/3eKWqGPGKLJJPsIKxNzFmA__original/img/uaR-khSJP8HW21oKXVYBnLiLtnU=/0x0/filters:format(jpeg)/pic6257943.jpg"},{"bggId":"341288","name":"Covid Deniers: A truly viral party game","description":"Covid Deniers is a party game that puts you at the center of the fight against fake news and conspiracy theories about the coronavirus. Become a Good Citizen and defend the public order of your village &ndash; or destroy it with cruel lies and accusations!&#10;&#10;Covid Deniers offers an exciting political spin to award winning games like Werewolf or Mafia. Intense debates, dramatic tension and fun for you and your friends are guaranteed.&#10;&#10;To start playing Covid Deniers, every player draws a secret role card. The game begins at night. All players are asleep. Only the Deniers are free to open their eyes. Now it&lsquo;s time for conspiracy. Each night, they can put one Good Citizen into quarantine. One round at night is followed a daytime round.&#10;&#10;At daytime, the Good Citizens try to find out who among them is a Covid Denier. Within an open group discussion, they decide on one player to be tested for his or her true identity. In the end, either the Good Citizens keep their majority in the group &mdash; or the Deniers take over.&#10;&#10;Additional roles, such as the Superspreader or the Virologist, come with special abilities and turn Covid Deniers into a viral experience!&#10;&#10;Covid Deniers is a social deduction game for adults, and a must have for any party game collection!&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":6,"maxPlayers":32,"minPlayTime":20,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Deduction","Humor","Movies / TV / Radio theme","Party Game","Political","Spies/Secret Agents","Deduction"],"rating":5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/MwPYSec9EhODFuIODtugZQ__thumb/img/vbth81dFo6RYx-G7E7q11V9HRcE=/fit-in/200x150/filters:strip_icc()/pic6278630.jpg","urlImage":"https://cf.geekdo-images.com/MwPYSec9EhODFuIODtugZQ__original/img/_z1GnY9-VqXE7dqVjWaFK95UTwk=/0x0/filters:format(jpeg)/pic6278630.jpg"},{"bggId":"341298","name":"In The End: Faith in Humanity","description":"In The End: Faith in Humanity is a post apocalyptic survival game. It is story driven not combat driven. The Characters you have to choose from are varied with their own stories.&#10;In The End is a 1-6 player, 3 board game. It has ten unique bosses to fight and many events to overcome.&#10;The play mechanics are simple roll a d6, move up to that number. If you land in a square with Character, Event, or Item you pull that card and resolve the card. On each board the player must complete 3 Character Cards to reveal the boss. Once the boss is revealed you must move to that square and fight the boss. &#10;This is done over all three boards. In solo play you undertake this great journey alone. When playing in a party you all must fight the boss together. In Versus mode you are in a race to beat the three bosses. &#10;After defeating the third boss you find and are granted access to Sanctuary, a city where civilization is being rebuilt. You lose by dying or in Versus by not making it to Sanctuary first.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":60,"maxPlayTime":180,"minAge":18,"categoriesAndMechanics":["Adventure","Dice","Mature / Adult","Science Fiction","Campaign / Battle Card Driven","Team-Based Game","Variable Player Powers"],"rating":0,"complexity":0},{"bggId":"341299","name":"Bodensee: 50 Rätsel mit Ausflugstipps","description":"The general idea from Black Stories of seemingly inexplicable statements or tasks that the players have to solve by asking questions is applied here to regional references. Only questions that the so-called omniscient game master can answer with yes or no are allowed; in the case of irrelevant or unanswerable questions, they can demand a reformulation and may also give hints if the questioners are completely on the wrong track. This game poses the tasks with reference to the region of Lake Constance and, with the solution, also provides information and excursion tips for the region and the exact address of the event.&#10;&#10;","minPlayers":2,"maxPlayers":99,"minPlayTime":0,"maxPlayTime":0,"minAge":12,"categoriesAndMechanics":["Educational","Exploration","Travel","Trivia"],"rating":4.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/X0V_J_HhsHIVtFhWozaOsw__thumb/img/5ScKC2dncr1PzOfmEHU8AXqZANc=/fit-in/200x150/filters:strip_icc()/pic6247120.jpg","urlImage":"https://cf.geekdo-images.com/X0V_J_HhsHIVtFhWozaOsw__original/img/4-ayB5B0zeJTsakyLs5DNOLPSko=/0x0/filters:format(jpeg)/pic6247120.jpg"},{"bggId":"341300","name":"Österreich: 50 Rätsel mit Ausflugstipps","description":"The general idea from Black Stories of seemingly inexplicable statements or tasks that the players have to solve by asking questions is applied here to regional references. Only questions that the so-called omniscient game master can answer with yes or no are allowed; in the case of irrelevant or unanswerable questions, they can demand a reformulation and may also give hints if the questioners are completely on the wrong track. This game poses the tasks with reference to the region of Austria and, with the solution, also provides information and excursion tips for the region and the exact address of the event.&#10;&#10;","minPlayers":2,"maxPlayers":99,"minPlayTime":0,"maxPlayTime":0,"minAge":12,"categoriesAndMechanics":["Educational","Travel","Trivia"],"rating":4.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/-coFJywkTZl8oRcOjzjvLA__thumb/img/bpqnr25k9UCiZzGqc2Qth5D4a90=/fit-in/200x150/filters:strip_icc()/pic6247127.jpg","urlImage":"https://cf.geekdo-images.com/-coFJywkTZl8oRcOjzjvLA__original/img/VsmFh8o8JT4vM8cGCptb5XeS2fM=/0x0/filters:format(jpeg)/pic6247127.jpg"},{"bggId":"341301","name":"Schwarzwald: 50 Rätsel mit Ausflugtipps","description":"The general idea from Black Stories of seemingly inexplicable statements or tasks that the players have to solve by asking questions is applied here to regional references. Only questions that the so-called omniscient game master can answer with yes or no are allowed; in the case of irrelevant or unanswerable questions, they can demand a reformulation and may also give hints if the questioners are completely on the wrong track. This game poses the tasks with reference to the region of Black Forest and, with the solution, also provides information and excursion tips for the region and the exact address of the event.&#10;&#10;","minPlayers":2,"maxPlayers":99,"minPlayTime":0,"maxPlayTime":0,"minAge":12,"categoriesAndMechanics":["Educational","Travel","Trivia"],"rating":4.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/DSkTpfJ2cz3-DHmJW3LvdQ__thumb/img/NTYNwGAeg2p4SaK6nL6ndFgR8s0=/fit-in/200x150/filters:strip_icc()/pic6247122.jpg","urlImage":"https://cf.geekdo-images.com/DSkTpfJ2cz3-DHmJW3LvdQ__original/img/bLVaSgDFqJqoWjqEeBDubg_fB1Q=/0x0/filters:format(jpeg)/pic6247122.jpg"},{"bggId":"341302","name":"Gregs Tagebuch Schweinehaufen","description":"Cards featuring characters from Wimpy Kid/Gregs Tagebuch are spread face-down. All play simultaneously and reveal one card after the other, using only one hand. For each card you decide if you put it face-down on your Pig Stack / Schweinehaufen or put it back, face down. A card fits the stack if it does NOT show the same person or the same color as the previous card in the stack. Cards in your own stack cannot be checked. When all cards have been collected, you win with most cards in a correct sequence.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":10,"categoriesAndMechanics":["Action / Dexterity","Card Game","Memory","Novel-based","Real-time","Memory","Pattern Building","Set Collection"],"rating":2.775,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/wV_k3HhobZU04LiA17eyHw__thumb/img/FH9oOo7OlGee_43OKQQ1arFyhqg=/fit-in/200x150/filters:strip_icc()/pic6247164.jpg","urlImage":"https://cf.geekdo-images.com/wV_k3HhobZU04LiA17eyHw__original/img/I6zFNmH25qtlNe5PsVLi2SZ13lY=/0x0/filters:format(jpeg)/pic6247164.jpg"},{"bggId":"341325","name":"Crystal Miners","description":"In the land of Arzium, the Southern Mining Guild has found a passageway that leads to a vast cavern filled with giant slugs, glowing fungi, and glittering crystals! Your task is to gather up this valuable trove for the survival of the guild members and their families.&#10;&#10;Crystal Miners is a roll-and-write game featuring one of the factions from Now or Never, the Southern Mining Guild. Each turn, you roll dice and place them on actions on your player sheet, using money to hire new miners, buy upgrades, and establish new places to mine. Gameplay is simultaneous and quick, lasting only eight turns. The player who most effectively manages their mining company is declared the winner.&#10;&#10;Crystal Miners is currently only available as a print-and-play game.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":10,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Fantasy","Print & Play","Paper-and-Pencil","Worker Placement with Dice Workers"],"rating":3.698865,"complexity":1.6667,"urlThumb":"https://cf.geekdo-images.com/OaG79e0AcghcGDwmN2L4Kg__thumb/img/g4zMSbxWM0uNBTzpDDpQVVn7qtg=/fit-in/200x150/filters:strip_icc()/pic6692401.jpg","urlImage":"https://cf.geekdo-images.com/OaG79e0AcghcGDwmN2L4Kg__original/img/qmRe8FIte1S0lsDXylrbPzDxRBQ=/0x0/filters:format(jpeg)/pic6692401.jpg"},{"bggId":"341328","name":"Guts ‘N Glory: WWII Combat System for N scale Miniatures","description":"Guts &lsquo;N Glory is a World War II skirmish rules system for N-scale Miniatures.&#10;&#10;This innovative system allows for faster game resolution taking into account troop quality, leadership, and moral. &#10;The game was designed to be a pleasing combination of playability and realism.&#10;&#10;The heart of the game system is a fairly innovative concept (at least to historical gaming) that uses different dice rather than die modifiers. In most games, one type of dice is used and the &quot;success&quot; number for hitting a target, spotting a target or passing morale is determined by adding or subtracting a number from a base number. This forces the player to go through some mathematical calculations each time and the &quot;success&quot; number always changes. In Guts 'N Glory, the &quot;success&quot; number never changes. Instead, the dice you roll changes. &#10;For example, a successful morale check is made on a roll of a 4 or less. Veteran troops usually roll a 6-sided die to check morale (66% chance), but green troops roll a 10-sided die (40% chance). Of course, things happen to make troops more or less likely to pass that morale check. In Guts 'N Glory, these factors are taken into account by the use of &quot;die higher penalties&quot; or &quot;die lower bonuses.&quot; When checking morale, you put your finger on the &quot;dice hierarchy&quot; chart and move it to the right for each penalty and to the left for each bonus. No need to add/subtract modifiers&hellip;.No need to remember a different &quot;success&quot; number for every roll you make. &#10;For example, let's say a veteran fire team needs to take a morale check. There are enemy tanks visible to the fire team, they were under fire last turn and they are in cover. The enemy tanks and being under fire are both &quot;die higher penalties.&quot; The fact that the team is in cover is a &quot;die lower bonus. This yields a net result of one &quot;die higher&quot; penalty. The veteran fire team checks for morale by rolling an 8-sided die instead of the usual 6-sided die. The &quot;success&quot; number for a morale check is always a four or less. The use of this concept really speeds up play.&#10;&#10;Guts 'N Glory only considers factors that are necessary to create a realistic simulation. We didn't deal with details that added complexity/realism at the expense of playability. For example, in Guts 'N Glory tank armor is classified as light, medium, heavy or very heavy. &#10;There are bonuses/penalties on the charts for sloped armor, side armor, rear armor and top armor. Also, if a tank is hit, you then check to see whether or not it was immobilized or put &quot;out of action.&quot; This is all any platoon commander needs to know anyway. Therefore a Tiger tank is still a tougher target than a Stuart tank, but we didn't create an overly complicated system to model this. No need to find out exactly where the round hit, exactly what systems were taken out, or which crewmember was killed.&#10;&#10;Don't think that Guts 'N Glory is a beer and pretzels game though. &#10;It plays fast, but it rewards good tactics. It also punishes the player who makes tactical mistakes. &#10;The results are very realistic when compared with historical instances. &#10;Another concept that speeds play is the use of &quot;fire teams.&quot; Infantry are grouped in teams of 2-5 men. Three fire teams make up a squad. The troops are individually based on metal stands. The fire team stands are magnetic. This allows you to tailor your fire teams to the situation at hand. You can decide which weapons go with which team and your squad leader can be attached to any team you wish. The rules allow you to detach tank hunters as well. Squads generally were divided up into teams to execute real battle tactics. It speeds up the game considerably to allow you to move your men in similar teams. All members of a fire team direct their fire at the same target (with the exception of tank hunters&hellip;They need to be free to engage armored targets.) when they fire. This speeds up play and is very reasonable when compared with accounts of actual combat.&#10;&#10;Guts 'N Glory uses an initiative system and special fire modes or orders that allow both players to exercise control over their troops at the same time. &#10;It is not an &quot;I go, you go&quot; system. &#10;This adds realism to the simulation. I must admit that it is the hardest part of the system to grasp, but the most rewarding. &#10;For example, veteran troops are easier to control than green troops. They have a better chance of gaining the initiative and have more special orders to give. This makes them more flexible to the changing battlefield environment. We believe that this is how it should be!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":60,"maxPlayTime":150,"minAge":0,"categoriesAndMechanics":["Book","Miniatures","Wargame","World War II","Dice Rolling","Measurement Movement","Simulation"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/0u_myJCuNuKml9zZAzse6Q__thumb/img/3fw5SODhCIljwoRW-3etBbW6hUk=/fit-in/200x150/filters:strip_icc()/pic6254211.jpg","urlImage":"https://cf.geekdo-images.com/0u_myJCuNuKml9zZAzse6Q__original/img/j402mnbbyM0NyaqblN50Vic-tKo=/0x0/filters:format(jpeg)/pic6254211.jpg"},{"bggId":"341331","name":"Guts 'N Glory: Hearts and Minds – Vietnam / Modern Expansion","description":"Hearts and Minds is an expansion for the fast playing Guts &lsquo;N Glory World War II skirmish rules and covers the fighting in Vietnam as well as Modern Warfare, scenarios and weapons for Iraq and Afghanistan.&#10;It also includes new rules for helicopters and other post-WW2 weapons.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":60,"maxPlayTime":150,"minAge":0,"categoriesAndMechanics":["Expansion for Base-game","Book","Miniatures","Modern Warfare","Vietnam War","Wargame","Scenario / Mission / Campaign Game","Simulation"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/K7lo1K9TYl0PUDTMN3Kp6A__thumb/img/S6N5tylsga05Tnf8ZzfYNtDC4m4=/fit-in/200x150/filters:strip_icc()/pic6257821.gif","urlImage":"https://cf.geekdo-images.com/K7lo1K9TYl0PUDTMN3Kp6A__original/img/okfH5702_6lh20_dsupjCp89QRw=/0x0/filters:format(gif)/pic6257821.gif"},{"bggId":"341334","name":"Paradise Ride: Travel Tales","description":"Travel Tales is a unique conversational card game for travellers where you share your favourite travel stories and relive your epic adventure moments. With 100 unique questions and prompts, Travel Tales takes you on a trip down memory lane. Made to feed your wanderlust, champion social connections and highlight the stories we carry with us.&#10;&#10;Perfect to bring over to your friend's house across the street or on a backpacking trip around the world. Choose your own adventure in this epic storytime for travellers with hours on hours of entertainment. Made for everyone that travelled internationally or domestically, one time or thousands of times. Remember, Retell, Relive. May your memory serve you well.&#10;&#10;","minPlayers":2,"maxPlayers":20,"minPlayTime":15,"maxPlayTime":0,"minAge":18,"categoriesAndMechanics":["Card Game","Travel","Open Drafting","Storytelling","Voting"],"rating":5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/a5sVTr_Lj2bGSDkzt76WBA__thumb/img/XnQEPiSEQxO7TYVCL_vaxV5WMIg=/fit-in/200x150/filters:strip_icc()/pic6273076.jpg","urlImage":"https://cf.geekdo-images.com/a5sVTr_Lj2bGSDkzt76WBA__original/img/ZdTNRqvy6Eown3Ahv2K21x_Jzsw=/0x0/filters:format(jpeg)/pic6273076.jpg"},{"bggId":"341335","name":"Jailbait","description":"An Educational Criminal Law Game&#10;&#10;Jailbait is an exciting simulation of the real world of crime. It is both entertaining and designed to teach the lay person about the criminal justice system. The player will be taken through the court process, starting with bail hearings and lawyer's fees through to the trial and sentencing. Players will enjoy playing the roles of police officers, lawyers and Judges (sic). The winner of the game is the player with the most amount of money, but, he must also have the least number of criminal convictions.&#10;&#10;Jailbait equipment consists of a board with crime squares, tokens for the various players, one die, Judge's dice, Jailbait money, small chips which are the players' conviction chips and 3 sets of cards&mdash;crime cards (which correspond to the various crime squares on the board), lawyer's fee/bail cards and pre-trial cards.&#10;&#10;The winner of the game is the person with the most amount of money after he purchases back all his conviction chips. The game may conclude at any time, simply purchase back the conviction chips and count your money. Alternatively, the game concludes when only two players are left playing.&#10;&#10;This game was designed to follow the actual process of the Canadian Criminal Justice system as closely as possible within the framework of a game. There are many aspects and possibilities that arise within the court system which were impossible to include: however, the pertinent section of the Criminal Code of Canada has been noted in the glossary when appropriate to enable the player to obtain further information if he or she so desires by referring to that document. The United States glossary version will follow.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":0,"minAge":12,"categoriesAndMechanics":["Educational","Dice Rolling","Player Elimination","Race","Roll / Spin and Move","Simulation","Take That"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/jx7-RhKzW4_W8UjPlF9ffQ__thumb/img/_0bVsFalMTh4tc0Eu08TEeedW4U=/fit-in/200x150/filters:strip_icc()/pic6252830.jpg","urlImage":"https://cf.geekdo-images.com/jx7-RhKzW4_W8UjPlF9ffQ__original/img/DUDzDu5bz_vvbzNQQ2GqE2_39kk=/0x0/filters:format(jpeg)/pic6252830.jpg"},{"bggId":"341336","name":"The Battle for Normandy, Deluxe Edition","description":"The Battle for Normandy, Deluxe Edition&#10;&#10;The Battle for Normandy is a game that represents the climactic campaign in Normandy from D-Day, 6 June 1944 to the first week of August 1944 at primarily battalion level. Numerous scenarios are included to play out various smaller battles in Normandy. It is intended for two players or player teams.&#10;&#10;- Campaign : 5 maps, 6 June - 10 Aug&#10;- Bloody Omaha : part of one map, 6 June - 10 June&#10;- Cobra : 2 maps (most of play on one though), 25 July - 31 July&#10;- Goodwood &amp; Cobra (combined): 4 maps, 18 July - 31 July&#10;- Operation Epsom : 1 map, 26 June - 1 July&#10;- The Battle for Cherbourg : 1 map, 18 June - 27 June&#10;&#10;Game Features&#10;    &#10;TIME SCALE    6 hours per turn&#10;MAP SCALE    1250 yards per hex&#10;UNIT SCALE    Battalion or Company&#10;&#10;     OF PLAYERS    One to Six&#10;&#10;&#10;Includes the original game and expansion combined, with a few new components.&#10;&#10;New Components:&#10;- 1 Random Events Table (8-1/2 x 11&rdquo;) card stock&#10;- 12 Interdiction level cards (2x3&rdquo;, or regular card size)&#10;&#10;It has been about twelve years since The Battle for Normandy was originally released. Since that time, new research has been made available, and the game has been played countless times by many players around the world who have provided a wealth of feedback. The game system remains basically the same, allowing players to focus on planning and strategy and not an overbearing rules system. Based on that new research and feedback, many units have been adjusted, all of the maps have minor changes, and some whole rules sections have been revamped to better represent the historical reality, while minimizing further complexity. The original expansion is included in this Deluxe Edition (while remaining optional), and there are also new scenarios.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":240,"maxPlayTime":240,"minAge":14,"categoriesAndMechanics":["Wargame","World War II","Dice Rolling","Hexagon Grid","Movement Points","Simulation"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/aVaQ5cGq6wugm2Gz1Qjgmw__thumb/img/NOxHvrq34bv0RKrEU7Q0GhEdV9Y=/fit-in/200x150/filters:strip_icc()/pic6273097.jpg","urlImage":"https://cf.geekdo-images.com/aVaQ5cGq6wugm2Gz1Qjgmw__original/img/5BVEf6puN-AXNp9uwh1EyzjoOZ0=/0x0/filters:format(jpeg)/pic6273097.jpg"},{"bggId":"341341","name":"SPACE TREK: A 1-Card Mission","description":"SPACE TREK - A 1-Card Mission is a one player space adventure game &quot;influenced by Star Trek - The Dice Game&quot; where you are responsible for the safe return of your crew and ship the &quot;Explorer&quot; to Star base 259. After getting separated from the Battle fleet during a major encounter, you find yourself deep within the neutral zone.  As you try to make your way back to the Star base, your Starship will be traveling through enemy zones and asteroid fields.  Your mission is to get your Starship back to the Safe Zone and to Star base 259 by turn 21.  If you loss too many crew due to your Starship taking too much damage, you lose the game.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":25,"maxPlayTime":40,"minAge":12,"categoriesAndMechanics":["Card Game","Dice","Print & Play","Space Exploration","Dice Rolling","Re-rolling and Locking","Solo / Solitaire Game","Worker Placement with Dice Workers"],"rating":5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/XkGVPdZ6t9mAKrrbtWesAg__thumb/img/prMEBpvjsfYCHQ1yjRpoPoOAeoI=/fit-in/200x150/filters:strip_icc()/pic6254802.jpg","urlImage":"https://cf.geekdo-images.com/XkGVPdZ6t9mAKrrbtWesAg__original/img/wuip_SFHa04m9vZCPPCoPtugOwY=/0x0/filters:format(jpeg)/pic6254802.jpg"},{"bggId":"341344","name":"Fuga Alucinante","description":"In Hallucinating Escape, players are divided between the survivors and a monster. The monster must build the board with the cards face down, using its best strategy to place the traps and well hide the keys and exit gate from the players. Once the survivors fall into the traps, the monster can capture them. The survivors must unite to be able to find the keys while escaping the monster's capture.&#10;&#10;One player is chosen to be the Monster. The others will be player on the run against the Monster The monster assembles the board with all 49 cards face up, except for the Wall, Nails and Dungeon. The board must be set up in a 7 x 7 card square. Keys must be at least two spaces apart. The Monster places players in the most extreme positions on the board.&#10;&#10;Each fleeing player can walk 02 spaces (cards) vertically and horizontally and cannot be diagonally. When stopping in space, the card is turned face up and cad&acute;s effect is applied. The Monster moves 03 spaces.&#10;&#10;Effects cards:&#10;&#10;    Ramp: walk two more spaces&#10;    Nails: in the next round walk only one space&#10;    Quicksand: gets stuck in one round&#10;    Hole: you will have to wait for a friend to come to your aid&#10;    Dungeon: when the monster captures one of the players it can freely move into one of the dungeons and trap the player. Each dungeon can only be occupied by one player.&#10;    Key: when going through one of the keys, it must be face up and considered that all players on the run have the key.&#10;    Gate by getting the three keys players can reach the gate space, open it and escape.&#10;&#10;&#10;The game ends in two cases:&#10;1. The Monster captures all fleeing players&#10;2. Did any of the players get through the gate&#10;&#10;Who wins?&#10;1. The Monster if it captures the fleeing players or else&#10;2. Any of the fleeing players who passed through the gate&#10;&#10;------------------------------------------------------------------Em Fuga Alucinante, os jogadores s&atilde;o divididos entre os sobreviventes e um monstro. O monstro deve construir o tabuleiro com as cartas viradas para baixo, usando sua melhor estrat&eacute;gia para colocar as armadilhas e esconder bem as chaves e port&atilde;o de sa&iacute;da dos jogadores. Uma vez que os sobreviventes caem nas armadilhas, o monstro pode captur&aacute;-los. Os sobreviventes devem unir-se para conseguir encontrar as chaves fugindo da captura do monstro.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":120,"minAge":7,"categoriesAndMechanics":["Children's Game","Exploration","Modular Board","Roles with Asymmetric Information","Square Grid","Team-Based Game","Tile Placement","Variable Player Powers","Variable Set-up"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/dmaw9CaFSeGhKCy8FHz6Ww__thumb/img/-f0PANEq_8mfCQnxjnjDt58Gb3U=/fit-in/200x150/filters:strip_icc()/pic6266413.jpg","urlImage":"https://cf.geekdo-images.com/dmaw9CaFSeGhKCy8FHz6Ww__original/img/Ub6QfbuqO0d3WSUS4Ohr-H2yRtI=/0x0/filters:format(jpeg)/pic6266413.jpg"},{"bggId":"341345","name":"Guerra Mitológica","description":"Mythological War is a board game that improves the development of logical thinking and strategy, while having fun. Fight the war and use your best strategy to win the game. Make allies and conquer magical portals to be the big winner.&#10;&#10;The turn is played in 03 phases:&#10;1. Portal Phase. It does not occur in the first round. Open a Portal card and apply the effect described on it.&#10;2. Planning Phase. At the same time, all players place an order token for each territory in which they have an army. Tokens are placed face down&#10;3. Action Phase.&#10;3.1 Order tokens are flipped face up. Summoning tokens are resolved. It starts with the player with the Initiative Token and goes clockwise. You can enlist new troops respecting the supply limit (the supplies are marked on the map board)&#10;3.2 The fights are carried out as described in the rules. It starts with an invasion and is resolved by comparison of combat power of the troops and the strength of your card. The combat power consists of: Soldiers force 01, Knights Force 02 and Cannons Force 03 (only for attack and 0 for defense).&#10;Order tokens have modifiers of -1, 0 and +1 that must be applied. Neighboring territories can support battle.&#10;&#10;The game ends when one of the players has control 06 portal areas.&#10;&#10;A limit of 10 turns can be established, in which whoever has the highest number of portals is the winner.&#10;&#10;Similar to Game of Thrones (2003) with changes in participating parties (instead of race families), on the board (no naval mobility), in game sequels with the introduction of a portal phase to replace the Westeros phase, in combat modifier cards and conditions of victory.&#10;&#10;&#10;Guerra mitol&oacute;gica &eacute; um jogo de tabuleiro que aprimora o desenvolvimento de racioc&iacute;nio l&oacute;gico e estrat&eacute;gia, enquanto diverte. enfrente a guerra e use sua melhor estrat&eacute;gia para ganhar o jogo. fa&ccedil;a aliados e conquiste portais m&aacute;gicos para ser o grande vencedor.","minPlayers":3,"maxPlayers":4,"minPlayTime":90,"maxPlayTime":120,"minAge":10,"categoriesAndMechanics":["Fantasy","Mythology","Area Majority / Influence","Card Play Conflict Resolution","Hand Management"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/N8ZWr3WH6I3nB9vvhSJ7Tw__thumb/img/UV-Ma1gpQ_ELFtad-cO8ZAHZEEg=/fit-in/200x150/filters:strip_icc()/pic6266415.jpg","urlImage":"https://cf.geekdo-images.com/N8ZWr3WH6I3nB9vvhSJ7Tw__original/img/UiBz04WtTfxDmwpNIs0ri5tbku8=/0x0/filters:format(jpeg)/pic6266415.jpg"},{"bggId":"341346","name":"Jornada do Herói","description":"With 6 board combinations this game will never be the same, face the villains to become a true hero.&#10;&#10;The game consists of:&#10;1. 06 modular maps representing a mythological site: a) Olympus of the Gods, b) Forests of Hera, c) Parthenon of Hera, d) Workshop of Hephaestus, e) Depths of Poseidon and f) Kingdom of Hades. Each map has a door and a space in which the deity is imprisoned.&#10;2. Deck of cards with 20 mythological figures (Cerberus, Hydra of Lerna, Minotaur, etc) with combat power defined by numbers from 1 to 6 (result to win or be defeated) and attack effect.&#10;3. 04 hero figures&#10;4. 01 Dice D6&#10;&#10;Each turn the player rolls the die and moves as many spaces as the die result across the grid towards the space in which the deity is imprisoned. Upon reaching the prison space, a card of a mythological figure is revealed where a battle takes place. In battle, you roll a die and compare it to the powers of the mythological figure. Being the winner the player receives a special effect from each deity (Athena, Hephaestus etc) and chooses a new map to be connected. Being defeated suffers the effect of the card.&#10;&#10;When all the deities are freed and all the modular maps are posted, a final battle takes place on the Olympus of the Gods.&#10;The battle is against Cronos who is imprisoning Zeus. To beat him, roll a D6 die and have the result 6.&#10;&#10;The player who beats Cronos is the winner of the game&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":120,"minAge":8,"categoriesAndMechanics":["Adventure","Children's Game","Dice Rolling","Grid Movement","Modular Board"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/Exo9QuG0zcjRxOW29_QmKQ__thumb/img/O5bXhnCHdceDueDh7MrWgspkziw=/fit-in/200x150/filters:strip_icc()/pic6266409.jpg","urlImage":"https://cf.geekdo-images.com/Exo9QuG0zcjRxOW29_QmKQ__original/img/aO7CVZ7Kfs15AcGBHzbYvNQ7TP8=/0x0/filters:format(jpeg)/pic6266409.jpg"},{"bggId":"341348","name":"Jogo da Colheita","description":"A card game that lets you cultivate a perfect harvest in the comfort of your home! Get your friends together, and start planting! To add excitement to the game, you can also use the situation cards, natural disaster cards, and even put pests on neighboring crops! A little luck and strategy, and you'll be the first to have a winning harvest!&#10;&#10;Components&#10;04 game cards&#10;20 chips&#10;100 cards (01 Champion Harvest, 05 natural disaster, 15 pests, 19 Special Situation, 60 carrot, tomato and potato plantations)&#10;&#10;In each round, the player can do only one of the actions:&#10;&#10;    Play a plantation card in one of your plantations. If you have managed to complete 03 of the same cards of a culture, you must declare yourself &quot;Harvest&quot;&#10;    Play plague card on another player's crop preventing him from completing a harvest&#10;    Play natural disaster card against a player preventing him from playing a turn&#10;    Play situation card and perform the action described on the card&#10;    Discard a card face down if you cannot do any of the above actions&#10;&#10;&#10;After playing cards, draw cards until you have 5 cards in your hand.&#10;&#10;The game ends when the player completes a crop of each type (Carrot, Tomato and Potato) plus one of any type.&#10;&#10;The first player to complete a crop of each type (Carrot, Tomato and Potato) plus one of any type&#10;&#10;&#10;Um jogo de cartas que permite cultivar uma colheita perfeita no aconchego do seu lar!&#10;Junte seus amigos, e comecem a plantar!&#10;Para dar emo&ccedil;&atilde;o ao jogo, voc&ecirc;s tamb&eacute;m podem utilizar as cartas de situa&ccedil;&atilde;o, de desastre natural, e at&eacute; colocar pragas nas planta&ccedil;&otilde;es vizinhas!&#10;Um pouco de sorte e estrat&eacute;gia, e voc&ecirc; vai ser o primeiro a ter uma colheita campe&atilde;!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":120,"minAge":7,"categoriesAndMechanics":["Children's Game","Economic","Farming","Hand Management","Open Drafting","Take That"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/ZD-kVqMUJxyEhIi4Knl5PQ__thumb/img/xgbgXrAQyjNnE-Df_RYObFnG7eU=/fit-in/200x150/filters:strip_icc()/pic6266411.jpg","urlImage":"https://cf.geekdo-images.com/ZD-kVqMUJxyEhIi4Knl5PQ__original/img/0CLdPYNDxXWiLZtYyzo0IDZCnbA=/0x0/filters:format(jpeg)/pic6266411.jpg"},{"bggId":"341349","name":"Zak Storm e a Aventura dos 7 Mares","description":"Help Zak Storm and his companions in another adventure across the seven seas. travel across the seas looking for the 7 mighty gems and help them defeat the fearsome Skullivar.&#10;&#10;The board is divided into 7 seas with a path to be followed with 12 spaces. In these spaces there are:&#10;1) 09 Spaces clear&#10;2) a space with a villain,&#10;3) a space with special effects and&#10;4) a space with a jewel at the end,&#10;&#10;Each player rolls the dice and moves according to the dice rolled in each of the 7 seas. It can reach:&#10;1) Spaces clear that can go ahead&#10;2) The space with the villain who will have to fight a battle where he declares 03 numbers. He rolls the dice if he gets it right he wins the battle and moves on and if he misses he goes back to Ship Chaos&#10;3) The Space with Gem Trap House with Special Effects&#10;4) The space with jewel where it declares even or odd. He rolls the die and if he hits he gets the treasure. If you make a mistake, go to the next player&#10;&#10;The game ends when all 07 Gems are conquered and when everyone must return to the Ship Chaos for the final battle against the Skullivar monster. To beat him, you must roll a D6 die and get a result of 6 or more, with each jewel conquered by the players being added to the result of the die.&#10;&#10;Whoever defeats the villain first wins the match.&#10;&#10;Ajude Zak Storm e seus companheiros em mais essa aventura pelos sete mares. percorra todos os mares buscando as 7 poderosas joias e ajude-os a derrotar o tem&iacute;vel Skullivar.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":60,"minAge":7,"categoriesAndMechanics":["Adventure","Children's Game","Nautical","Dice Rolling","Point to Point Movement","Roll / Spin and Move"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/buAHWNSD3_lR12ndQe3XmA__thumb/img/U8lPu8nVys19LfN58Fp97tvFSQY=/fit-in/200x150/filters:strip_icc()/pic6266408.jpg","urlImage":"https://cf.geekdo-images.com/buAHWNSD3_lR12ndQe3XmA__original/img/maWGXKupibKsOfvXJRVWWZvtDpM=/0x0/filters:format(jpeg)/pic6266408.jpg"},{"bggId":"341351","name":"Vila dos Mistérios","description":"Everything happens while players have their eyes closed! In this card game, players are given a card that represents their character, and once the game begins, with all players' eyes closed, the announcer starts calling each one to a task. By the end of the game, your character may have changed! And everyone gets into a big argument to find out who the monster is. Get ready to investigate the monsters hiding in the village!&#10;&#10;The mechanics are the same as Wolf Game&#10;https://boardgamegeek.com/boardgame/151433/wolf-game&#10;&#10;Wolf The Game is a social party game around deception, deduction and perception. Based on the traditional games of Mafia and Werewolf, Wolf offers a balanced and multifaceted approach to this beloved category.&#10;&#10;Players take on the roles of villagers, trying to cope with an influx of murderous werewolves. Some players will be villagers and must try and work out which other players are secretly werewolves before the wolves kill everyone!&#10;&#10;With 11 different roles available in the base game, Wolf offers small to large groups a great way to get to know each other and having some quality lynching time together.&#10;&#10;Party game ends after voting.&#10;&#10;Village Victory: At least one Monster dies. even if another player is not the Monster and dies, everyone will win&#10;Monster Victory: If No One Monster Dies.&#10;&#10;&#10;Tudo acontece enquanto os jogadores est&atilde;o de olhos fechados! Nesse jogo de cartas, os jogadores recebem uma carta que representa seu personagem, e assim que come&ccedil;a o jogo, com todos os jogadores de olhos fechados, o locutor come&ccedil;a a chamar cada um para uma tarefa. No fim do jogo, seu personagem pode ter mudado! E todos entram numa grande discuss&atilde;o para descobrir quem &eacute; o monstro. Preparem-se para investigar os monstros que se escondem na vila!","minPlayers":3,"maxPlayers":7,"minPlayTime":15,"maxPlayTime":30,"minAge":7,"categoriesAndMechanics":["Bluffing","Children's Game","Deduction","Deduction","Hidden Roles","Open Drafting","Roles with Asymmetric Information"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/7LXD17eohhBAZG72bXnBUw__thumb/img/05MGkbbHEti9l1AxC3KL-8XgvQ8=/fit-in/200x150/filters:strip_icc()/pic6266424.jpg","urlImage":"https://cf.geekdo-images.com/7LXD17eohhBAZG72bXnBUw__original/img/mmtngnKBWyfxgQR_KKm5IznsVt8=/0x0/filters:format(jpeg)/pic6266424.jpg"},{"bggId":"341353","name":"Netflix: Stranger Things – o Jogo","description":"Will Bayers is missing and all his friends will join forces to save him. Keep Will safe as Eleven, Dustin and their friends face this battle. Combat-themed game from the TV series Stranger Things.&#10;&#10;The player can move one of his pieces forward, backward or sideways. Special spaces (Castle Byer and Hawkins Lab) and some of its pieces cannot be occupied. When occupying a space with a piece of the opposing team, a combat occurs. In combat, the pieces are revealed and the combat powers or special conditions compared. The piece with the highest combat power removes the piece with the lowest combat power from the game. In case of a tie, both leave the game.&#10;&#10;The game ends when Will is rescued.&#10;&#10;The first team to rescue the Will that is with the opposing team wins the battle and the game.&#10;&#10;This boardgame is a thematic change from the famous and traditional Stratego.&#10;&#10;Will Bayers est&aacute; desaparecido e todos seus amigos v&atilde;o unir for&ccedil;as para salv&aacute;-lo. Deixe Will protegido enquanto Eleven, Dustin e seus amigos enfrentam esta batalha. Jogo similar ao combate com tem&aacute;tica da s&eacute;rie televisiva Stranger Things.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":60,"minAge":8,"categoriesAndMechanics":["Abstract Strategy","Bluffing","Children's Game","Deduction","Memory","Movies / TV / Radio theme","Grid Movement","Memory","Roles with Asymmetric Information","Secret Unit Deployment","Square Grid","Variable Player Powers","Variable Set-up"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/KtHqDOELfHEUWSJ2bLP1rQ__thumb/img/bfi2b6NK7ae93imuuKkWRPIsNuQ=/fit-in/200x150/filters:strip_icc()/pic6266423.jpg","urlImage":"https://cf.geekdo-images.com/KtHqDOELfHEUWSJ2bLP1rQ__original/img/Z03JwW-zA-Pw2OsZcyIJZbwZmJE=/0x0/filters:format(jpeg)/pic6266423.jpg"},{"bggId":"341354","name":"Jogo da Fama","description":"In the Jogo da Fama, accumulate points for good attitudes and lose points if your attitudes hinder you to build your fame! at the end of the game, become a big star or a world star and rock!&#10;&#10;Roll the 02 D6 and move exactly the number of spaces in the result, applying the conditions of the coloured spaces or special space. Apply what is described in space&#10;&#10;All players must go through the Evaluation Show Day space and decide if they want to be a Superstar or Biggest Star. The player trying to Biggest Star will bet on a number and roll the two D6. If the result of two D6 is correct, the player is the winner. If you make a mistake, you will lose everything and be out of the game. By choosing Superstar he will compete when all players lose their fans or the last one becomes Superstar.&#10;&#10;The first player to become Biggest Star will win.&#10;Otherwise, the Superstar with the largest number of fans.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":60,"minAge":7,"categoriesAndMechanics":["Children's Game","Action/Event","Player Elimination","Roll / Spin and Move"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/_GZd3vQir8O33qUPbzgeZQ__thumb/img/_8wEZAlgK_oFCa7TOotvNlJk8oM=/fit-in/200x150/filters:strip_icc()/pic6266417.jpg","urlImage":"https://cf.geekdo-images.com/_GZd3vQir8O33qUPbzgeZQ__original/img/7lDS7Mvvz0LixDL2XXPdWjwIIZI=/0x0/filters:format(jpeg)/pic6266417.jpg"},{"bggId":"341355","name":"Decisões A Vida É Um Jogo","description":"In this amazing board game, you will choose the best DECISIONS to walk your life! Players must choose goals and reach their goals, following paths full of possibilities. A real life simulation in a playful and fun way.&#10;&#10;Who here is already dying to play the Game Decisions, Life is a Game?&#10;&#10;The player can move horizontally, vertically and diagonally only 01 space&#10;When entering an instance, the player must draw a card (from the location) and read its contents. He will gain or lose attribute tokens as described on the card. If the card requires him to lose an attribute he doesn't have, he discards the card.&#10;Each turn the player must move to a different location.&#10;Only one player can occupy the same site.&#10;&#10;The game ends when a player gets 08 tokens in two attributes of his choice.&#10;&#10;The first player got her 08 tokens in two different attributes of her choice.&#10;&#10;Similar to The Game of Life: Fame Edition with some changes in victory conditions.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":60,"minAge":8,"categoriesAndMechanics":["Children's Game","Educational","Grid Movement","Open Drafting"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/yEzxwpXL0W62TaTo2JfMGg__thumb/img/9mzkYon_vgB9eYf2mHh1uXM_DDI=/fit-in/200x150/filters:strip_icc()/pic6266416.jpg","urlImage":"https://cf.geekdo-images.com/yEzxwpXL0W62TaTo2JfMGg__original/img/HdXY7DuF59TSr37rQkNaEbDM-XE=/0x0/filters:format(jpeg)/pic6266416.jpg"},{"bggId":"341360","name":"Bataille de purée à la cantine","description":"Everyone sends the food they have in their deck in order to get rid of all their cards, but be careful not to be caught in the hand&hellip; in the mash!&#10;&#10;Using a match mechanic similar to UNO, players match colors or numbers to meet one of 3 win conditions. The goal is to discard all your cards, get a particular set of cards, or have the highest number of points.&#10;&#10;&#10;&#10;Chacun envoie les aliments qu&rsquo;il a dans son jeu afin de se d&eacute;barrasser de toutes ses cartes, mais gare &agrave; ne pas &ecirc;tre pris la main&hellip; dans la pur&eacute;e !","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":0,"minAge":5,"categoriesAndMechanics":["Card Game","Children's Game","Matching"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/CICStzxI8X1lWT2Ixn0EEg__thumb/img/I2ywNNOiSUwFDZSvLk0Z35K3W9w=/fit-in/200x150/filters:strip_icc()/pic6266397.jpg","urlImage":"https://cf.geekdo-images.com/CICStzxI8X1lWT2Ixn0EEg__original/img/gOkChgfBGDJLLexVv1z0buD043A=/0x0/filters:format(jpeg)/pic6266397.jpg"},{"bggId":"341363","name":"¡Ataco al Dragón!","description":"This is a deduction microgame with a fantasy theme, in which each card represents a typical RPG class. On a turn, with two cards in hand players draw a thrid card, and play one card, trying to expose others and knock them from the game. After a victory, the winner takes a die, and having two or more mini dices may choose to roll. If he or she gets a result of 10 or more, that players is the winner of the game.&#10;&#10;&#10;&#10;From the publisher: Ataco al drag&oacute;n es un juego de mesa de cartas y dados de tipo party game, competitivo. Los jugadores toman turnos para competir y ganar mini dados de seis caras. Una vez colecciones m&aacute;s de dos dados puedes decir &iexcl;Ataco al drag&oacute;n! Y lanzar los dados que hayas ganado, si obtienes una suma de 10 o m&aacute;s eres el ganador del juego.","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":40,"minAge":8,"categoriesAndMechanics":["Card Game","Deduction","Dice","Fantasy","Deduction","Dice Rolling","Hand Management","Player Elimination"],"rating":3.613635,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/XgyTx8NCidA4F6AlCnuYGQ__thumb/img/q7O3xH0h38DoMNBSiZ6gNhrSf1E=/fit-in/200x150/filters:strip_icc()/pic6253068.jpg","urlImage":"https://cf.geekdo-images.com/XgyTx8NCidA4F6AlCnuYGQ__original/img/cDhAj7bNJctzWIMSJ9XCWZRNOk0=/0x0/filters:format(jpeg)/pic6253068.jpg"},{"bggId":"341366","name":"Romp Thru The Swamp","description":"[From the rules] Be the first to navigate your way out of the swamp to safety and victory! But be quick or Swampy the monster will drag you back in! Can you escape Swampy's clutches?&#10;[From the box] Danger! Swampy doesn't like children in his swamp! Don't disturb his sleep or he might come to get you! Try getting out of his swamp and onto the jetty... but you're not safe yet! Can you escape... Swampy's last grasp?&#10;&#10;A battery powered motorized monster moves up and down a track in the middle of the board potentially dragging player pawns back after the end of each round of turn. Players roll and move a standard D6 die to progress through the board, with the goal of getting to the jetty by exact count to be safe from the monsters claws.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":0,"minAge":4,"categoriesAndMechanics":["Children's Game","Electronic","Horror","Roll / Spin and Move","Track Movement"],"rating":2.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/yeES8GHBa45JLfPQxZFG0Q__thumb/img/mFcb60KGZ-73qx8AqnvcHd6vg1Y=/fit-in/200x150/filters:strip_icc()/pic6252867.jpg","urlImage":"https://cf.geekdo-images.com/yeES8GHBa45JLfPQxZFG0Q__original/img/IlHVKfLl5m0tgwHfvJlxvsGqZDY=/0x0/filters:format(jpeg)/pic6252867.jpg"},{"bggId":"341367","name":"Vikings: Ascent","description":"King Ragnar Lothbrok is dead! He is survived by his sons, each with competing claims to the throne. In Vikings: Ascent the enemy in front of you is less of a threat than the friend at your back.&#10;&#10;On a player's turn they move through the following three phases:&#10;1) Draw: draw up to 8 cards.&#10;2) Recruit: recruit freemen (including: warriors, farmsteaders, and skalds) to their house.&#10;3) Fate: take actions by exerting their freemen and/or playing cards from their hand to increase their bid for the throne.&#10;The game ends when a player attains 100 Fate points (victory points)&#10;&#10;A player increases (or decreases) fate points during the fate phases of each players' turn. The first to ascend the Wheel of Fate and attains 100 fate points wins the game.&#10;&#10;","minPlayers":3,"maxPlayers":5,"minPlayTime":75,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Card Game","Medieval","Negotiation","Political","Card Play Conflict Resolution","Open Drafting"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/UBmqXRRYoL0jGgKWfYnm_w__thumb/img/mNCee8enLo6X96LWstjYZ5GT8AA=/fit-in/200x150/filters:strip_icc()/pic7686710.jpg","urlImage":"https://cf.geekdo-images.com/UBmqXRRYoL0jGgKWfYnm_w__original/img/FEIR3VGj5BM9fh55e74oReOwMUk=/0x0/filters:format(jpeg)/pic7686710.jpg"},{"bggId":"341369","name":"红桃四 (4 Hearts)","description":"In this traditional Chinese card game for four players using a standard 52 card deck, players aim to get rid of their cards as soon as possible. The players are dealt five cards with the first player receiving six. The person with the Heart 4 begins the game, and must first play a single number, at least two identical numbers, or at least three ascending numbers that include the Heart 4. Below are the general rules for the cards that can be played.&#10;&#10;1. Single number (2 is biggest, 3 is smallest, Jokers are sometimes used).&#10;2. At least two same numbers of differing suits. Example: Heart 3 and Spade 3.&#10;3. At least three numbers in ascending order, the suit does not matter. Example: Heart 3, Spade 4 and Club 5. Note that playing 2 (the biggest card) followed by the 3 (which is the smallest) is invalid in this case since it is not ascending.&#10;&#10;Notes: &#10;1. The combination 4-4-5-5-6-6 can also be played, and the same suits do not apply.&#10;2. Occasionally players can be extremely lucky and have six sequential cards, such as 4-5-6-7-8-9.&#10;&#10;","minPlayers":4,"maxPlayers":4,"minPlayTime":5,"maxPlayTime":10,"minAge":8,"categoriesAndMechanics":["Card Game","Matching","Set Collection"],"rating":3,"complexity":1},{"bggId":"341385","name":"SARAJEVO: 28th June 1914","description":"Sarajevo 28th June 1914  A solitaire roll &amp; write game.&#10;&#10;June 1914. A plot to assassinate the Franz Ferdinand, heir of the Austro-Hungarian Empire during his visit at Sarajevo is readied by Serbian nationalists (the player). Will you ignite the First World War or will the course of history change? The game has also rules in Italian!&#10;&#10;Play is relatively simple &ndash; there are key places on the route of the Archduke&rsquo;s motorcade where either assassins&rsquo; lurk or there is a good opportunity due to the road network to attempt the assassination.  At each possible point you cross index where the motorcade is with the game chart to see if an attempt is made or the assassin decides this is not a good spot &ndash; or gets cold feet and flees!&#10;&#10;Event cards the rolling for the fanatic killer might allow you to achieve your mission or allow for a different result in WW 1 &ndash; the fate of Eastern Europe is in your hands!&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":90,"minAge":12,"categoriesAndMechanics":["World War I","Dice Rolling","Events"],"rating":3.5,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/icxEXZOq3HPpJmEsvOiU-g__thumb/img/bsDkJW-EdyXb9-tiImVqi0VUSuE=/fit-in/200x150/filters:strip_icc()/pic6255233.jpg","urlImage":"https://cf.geekdo-images.com/icxEXZOq3HPpJmEsvOiU-g__original/img/YO8KyaDGhXyzDdJR6t9WTFjoq28=/0x0/filters:format(jpeg)/pic6255233.jpg"},{"bggId":"341387","name":"Triomatt","description":"On a 10x8 playing field, 2 players start from the baseline with their 15 number tiles ranging in value from 1 to 16 (13 is missing). The goal is to reach the opponent's baseline with 3 stones, or to hit so many of the opponent's stones that he becomes unable to move. The number stones may be moved one square at a time. The special feature of the game is to arrange your number stones on the board in such a way that valid arithmetic operations (addition, subtraction, multiplication, division) are created. Example: with the number tiles 2, 14, 16 in a row, the arithmetic operation 2+14=16 can be represented. The first number piece of the calculation may skip the result of the calculation. If the reached field is occupied by a foreign number piece, this is beaten.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":10,"categoriesAndMechanics":["Abstract Strategy","Math","Pattern Recognition","Static Capture"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/A6C0xdEHv_o2OPIwh0_fLg__thumb/img/rbTeTe3ojJxDNRMIpebSKa4U9vk=/fit-in/200x150/filters:strip_icc()/pic6249647.jpg","urlImage":"https://cf.geekdo-images.com/A6C0xdEHv_o2OPIwh0_fLg__original/img/2gWVlIFPT9-AjyRx-gvhcQpGDsA=/0x0/filters:format(jpeg)/pic6249647.jpg"},{"bggId":"341388","name":"Micro Monster Factory","description":"You are one of two mad scientists who started a lab in the sewers. Send your Minion to buy body parts and do the dastardly deed to create the most hideously cute monster your evil genius mind comes up with.&#10;&#10;Use your Minion to buy Monster parts by moving to adjacent spaces on the parts shop and paying for that part using your funds. Bribe, take advantage and create a Monster on the action space on the parts shop. Use your Monster's ability to manipulate part's prices. &#10;The game ends when a player creates 4 Monsters, each player will then reveal their agenda to score points. Players will also receive bonus points for completing objectives.&#10;&#10;Originally made for the 2021 1-card contest. The players share 1 card in which they get to fill in their monster parts, creations and abilities.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Dice","Print & Play","Area Movement","End Game Bonuses","Worker Placement"],"rating":2.166665,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/A14-tl3D85OL2dnnnu5pJg__thumb/img/aUBQcR1KKijoapkJRpIsdF9wRt0=/fit-in/200x150/filters:strip_icc()/pic6256065.jpg","urlImage":"https://cf.geekdo-images.com/A14-tl3D85OL2dnnnu5pJg__original/img/8_jei5R4lazu_WBFqFb_cPbLUoQ=/0x0/filters:format(jpeg)/pic6256065.jpg"},{"bggId":"341390","name":"El Tesoro","description":"Sixteen island tiles are laid out as a circle. The players roll a color and number die and move the corresponding ship by the corresponding number of islands, look at the treasure on the back of the island tile and may reveal another island. If this shows the same treasure, they may take one of the 25 gold talers. The player who has collected the most gold coins wins the game.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":4,"categoriesAndMechanics":["Children's Game","Pirates","Memory","Roll / Spin and Move"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/xELa1ahkqikL3qKVOuRr8w__thumb/img/uUjEZvy0PQxH2nkozS1RoPngV4U=/fit-in/200x150/filters:strip_icc()/pic6249709.jpg","urlImage":"https://cf.geekdo-images.com/xELa1ahkqikL3qKVOuRr8w__original/img/sh1SaAc22-pQhx0msFxLOqvyqfA=/0x0/filters:format(jpeg)/pic6249709.jpg"},{"bggId":"341393","name":"Oregon","description":"Oregon is a solitaire poker game, great for learning and internalizing the various poker hands and their ranked value.&#10;&#10;From the rulebook: &quot;For Oregon you need a normal Poker deck of 52 cards: thirteen values from 2 to Ace, in the four suits: Spades, Hearts, Diamonds and Clubs. Simply shuffle and start. Your aim is to build the most powerful Poker combinations - same values, same suit, or consecutive values.&quot;&#10;&#10;The first five cards of the deck are turned over to form a row. Then, the player draws from the deck and decides to add the new card on top of a card in the pre-existing row or use the new card to begin a new row, then draw four more cards to complete the new row of 5. This choice is repeated until the deck runs outs. The better the poker hands created in each row of cards, the better the score.&#10;&#10;Played with a standard deck of cards, published in Reiner Knizia's book Blazing Aces!: A Fistful of Family Card Games.&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":10,"maxPlayTime":20,"minAge":8,"categoriesAndMechanics":["Card Game","Set Collection","Solo / Solitaire Game"],"rating":2.75,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/W7JE7gEDl2mjYCsBbOGdiw__thumb/img/bKwJeQibbDjk0TqMS9oa5Ku5P_g=/fit-in/200x150/filters:strip_icc()/pic6418661.png","urlImage":"https://cf.geekdo-images.com/W7JE7gEDl2mjYCsBbOGdiw__original/img/MWyF-Nn6tqTLEnM43FCNvy2mnoE=/0x0/filters:format(png)/pic6418661.png"},{"bggId":"341397","name":"Prehistoric Settlement","description":"Set about 50,000 years B.C. in an age of hunter gathers, and the last of the strange large mammals, such as Woolly Mammoths, Sabre-tooth Tigers and Giant Birds, the game is a mixture of board games and wargames Using a mixture of Metal Miniatures, Resin Buildings, Cards and Counters.&#10;&#10;At the beginning of the game, all the players start with the same amount of pieces and the basic idea of the game is to grow your settlement faster than the other players, buying Figures and Buildings with game tokens as you go along, hopefully avoiding Natural Disasters and other unforeseen incidents.&#10;&#10;The game can be played by 2 or 4 players and is for Ages 14 and up and is fun for families as well as boardgamers &amp; wargamers.&#10;A great deal of time and effort was put into the design of the game pieces, which are very detailed. The same figures are used for each different tribe, which are just painted differently. Spears &amp; Shields are cast separately, but come with the figures that they are intended for.&#10;&#10;The rules are well printed complete with a color cover, and are packed with black &amp; white illustrations. &#10;The game tokens are printed in color, on white card.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":120,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Adventure","Miniatures","Prehistoric","Wargame","Dice Rolling","Measurement Movement"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/wztSNlQWHp6l_o7myYrMaw__thumb/img/nStYrLiJ-Ac5fhDCNM8wSsGIWMM=/fit-in/200x150/filters:strip_icc()/pic6257816.jpg","urlImage":"https://cf.geekdo-images.com/wztSNlQWHp6l_o7myYrMaw__original/img/SRmx7oClcXPMuOOQ8qjFw0ED--s=/0x0/filters:format(jpeg)/pic6257816.jpg"},{"bggId":"341398","name":"Männer: Das Spiel.","description":"Party game for up to 5 men (or brave women), where you collect certificates in 5 categories to win.&#10;&#10;The 5 categories are: &#10;&#10;     Guess correct number of teammates for whom a given fact is true.&#10;     Quiz question&#10;     Solve riddle&#10;     Assessment by fellow players to a personal question (yes / rather yes / rather no / no)&#10;     Good Luck (guess the value of the next card drawn)&#10;&#10;&#10;For each solved task you get a status card, 3 of them can be exchanged for a certificate of the same category.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":0,"maxPlayTime":0,"minAge":18,"categoriesAndMechanics":["Mature / Adult","Party Game","Trivia","Roll / Spin and Move","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/8TeBMQxbxzo2QcvoUBVnfQ__thumb/img/PWqmdBpiM0JWsxfE-2aGlguMu6E=/fit-in/200x150/filters:strip_icc()/pic6250078.jpg","urlImage":"https://cf.geekdo-images.com/8TeBMQxbxzo2QcvoUBVnfQ__original/img/lia0E9l-V1h915QwbVQhHyR1Jmg=/0x0/filters:format(jpeg)/pic6250078.jpg"},{"bggId":"341399","name":"Komm mit!","description":"On the game board of a fictitious city, each player has a clubhouse to which he should bring 3 guests (opponents cars).  Each player owns 3 cars with which he can drive around the city and capture the other cars (form a tower). With various rules to change the direction of travel and take over a tower the game is completed.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":15,"maxPlayTime":60,"minAge":8,"categoriesAndMechanics":["Dice","Racing","Dice Rolling","Roll / Spin and Move"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/0ismz_19gc2kwSHMadZj3Q__thumb/img/dVu0FXcqj86rIQMi-mGcBFgpll0=/fit-in/200x150/filters:strip_icc()/pic6250171.jpg","urlImage":"https://cf.geekdo-images.com/0ismz_19gc2kwSHMadZj3Q__original/img/r7adEBvRDbKDSZTtOAgR7CS9xJ0=/0x0/filters:format(jpeg)/pic6250171.jpg"},{"bggId":"341400","name":"Ein Loch ist im Eimer","description":"In Ein Loch ist im Eimer (&quot;There is a hole in the bucket&quot;), players are filling a bucket with marbles (representing water drops). The bucket is hanging from a water tap, and it has a hole in the bottom, which is initially blocked by a ping-pong ball. However, the marbles will displace the ball, which will make it possible for the marbles to &quot;leak&quot; out of the bucket.&#10;&#10;Each player must predict how many of their balls they will put in without them falling out. Whoever gets the predicted amount of balls into the bucket is the winner.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":99,"minPlayTime":0,"maxPlayTime":0,"minAge":4,"categoriesAndMechanics":["Action / Dexterity","Children's Game","Predictive Bid"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/uViFm5Ry-iDGGJem2y-P_A__thumb/img/GuAXjC_LD52VYOisNvRKE-H5l4Y=/fit-in/200x150/filters:strip_icc()/pic6250214.jpg","urlImage":"https://cf.geekdo-images.com/uViFm5Ry-iDGGJem2y-P_A__original/img/pC51dmDGGQNDMZ9b-lDWYNKdoVs=/0x0/filters:format(jpeg)/pic6250214.jpg"},{"bggId":"341404","name":"Magyar népmesék: A kártyajáték","description":"The card game of Hungarian folk tales can be played on two levels of difficulty. With the help of the starting game, even the very little ones can easily learn the rules, while the advanced version is made more exciting by the action cards for the older age group. The card game features well-known characters that are guaranteed to get cloudless minutes for the whole family.&#10;&#10;Get the most points by collecting the heroes of folk tales and the tools that help them! But watch out! Dangerous companions of witches and devils can get in your way, but if you are skillful enough, you can trick them. The card game is a 120-card deck that you can use to deftly tactically cheat your fellow players.&#10;&#10;A Magyar n&eacute;pmes&eacute;k k&aacute;rtyaj&aacute;t&eacute;ka k&eacute;tf&eacute;le neh&eacute;zs&eacute;gi szinten j&aacute;tszhat&oacute;. A kezd&#197;&#145;j&aacute;t&eacute;k seg&iacute;ts&eacute;g&eacute;vel m&aacute;r az eg&eacute;szen kicsik is k&ouml;nnyed&eacute;n megtanulhatj&aacute;k a szab&aacute;lyokat, m&iacute;g a halad&oacute; v&aacute;ltozatot az akci&oacute; k&aacute;rty&aacute;k teszik izgalmasabb&aacute; az id&#197;&#145;sebb koroszt&aacute;ly sz&aacute;m&aacute;ra. A k&aacute;rtyaj&aacute;t&eacute;k j&oacute;l ismert karaktereket tartalmaz, mely garant&aacute;ltan az eg&eacute;sz csal&aacute;d sz&aacute;m&aacute;ra felh&#197;&#145;tlen perceket szerez majd.&#10;&#10;Szerezd Te a legt&ouml;bb pontot a n&eacute;pmes&eacute;k h&#197;&#145;seinek &eacute;s az &#197;&#145;ket seg&iacute;t&#197;&#145; eszk&ouml;z&ouml;k &ouml;sszegy&#197;&#177;jt&eacute;s&eacute;vel! De vigy&aacute;zz! A boszork&aacute;nyok &eacute;s az &ouml;rd&ouml;g&ouml;k vesz&eacute;lyes t&aacute;rsai az utadba &aacute;llhatnak, de ha el&eacute;g &uuml;gyes vagy, akkor kicselezheted &#197;&#145;ket. A k&aacute;rtyaj&aacute;t&eacute;k egy 120 lapos pakli, amivel &uuml;gyesen taktik&aacute;zva kicselezheted a j&aacute;t&eacute;kos t&aacute;rsaid.&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":20,"maxPlayTime":30,"minAge":5,"categoriesAndMechanics":["Card Game","Fantasy","Set Collection"],"rating":3.11,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/tbpsmnOXPtNY83Go9VQhWg__thumb/img/m6BPt4B0Xm1twmqYtSUwyW08dVQ=/fit-in/200x150/filters:strip_icc()/pic6254023.jpg","urlImage":"https://cf.geekdo-images.com/tbpsmnOXPtNY83Go9VQhWg__original/img/PmnkQr4TMvYOuZIGwDWLOiHhh_0=/0x0/filters:format(jpeg)/pic6254023.jpg"},{"bggId":"341409","name":"E gewinnt","description":"E gewinnt is a game about learning and understanding e mobility.&#10;&#10;E gewinnt is at its core a roll and move game with the goal of being the fastest to race a across a map of Germany and parts of its neighbors.&#10;&#10;Players take turns driving across the map by rolling a fast red die showing higher numbers or a slow blue die with lower numbers, both of which consume different amounts of power from the car's batteries.&#10;&#10;Players need to manage the different power consumption in order to preserve precious battery power. Fast and slow charging stations for the vehicles are placed randomly on the map as players advance towards their target. Event cards are drawn each time you make charging stop.&#10;&#10;While playing, the game tries to educate the players about electronic mobility.&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":0,"minAge":10,"categoriesAndMechanics":["Educational","Transportation","Point to Point Movement","Race","Roll / Spin and Move","Track Movement"],"rating":1.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/OVNVTkgNU0WXtkqMxyGifA__thumb/img/5dAFoLC1SOxtNo0X7YInmxso1fc=/fit-in/200x150/filters:strip_icc()/pic6254354.jpg","urlImage":"https://cf.geekdo-images.com/OVNVTkgNU0WXtkqMxyGifA__original/img/899gHqKfNdpoubY85IScW3Jsfu4=/0x0/filters:format(jpeg)/pic6254354.jpg"},{"bggId":"341410","name":"PEZ Click & Play: Jurassic World","description":"Roaring into your collection the Jurassic World Click and Play Gift Tin!&#10;&#10;Each Gift Tin includes four interactive Click and Play dispensers (Blue the Raptor, T-Rex, Triceratops, and Mosasaurus). Twist the top of the dispenser off and it becomes an interactive game piece. Game board, spinner and directions included!&#10;&#10;The game is chutes and ladders with PEZ and a pasted dinosaur theme.&#10;&#10;The player spins a dial on their turn which results in a colored space to move to or a special candy space to jump to or a dinosaur space to go backwards to.&#10;&#10;Game ends when a player reaches the finish line and escapes the island.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":5,"maxPlayTime":15,"minAge":4,"categoriesAndMechanics":["Children's Game","Movies / TV / Radio theme","Roll / Spin and Move"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/CsH1cBmUsXEVEOPfv-jjwA__thumb/img/aPuYxc9G_uFqRm4mpo2SQKM0v28=/fit-in/200x150/filters:strip_icc()/pic6253831.jpg","urlImage":"https://cf.geekdo-images.com/CsH1cBmUsXEVEOPfv-jjwA__original/img/-8JDeCc2uEiCcJrnR6UCeWcLy5Q=/0x0/filters:format(jpeg)/pic6253831.jpg"},{"bggId":"341412","name":"Al Masjid","description":"Unlike other business games, this game does not reward players for stacking wealth, but rather for the accumulation of good deeds.&#10;&#10;The winner of this game is the first player to build a mosque, which requires a lot of donations.&#10;The victory is celebrated by all when the winner builds the mosque in his place.&#10;In the midst of all this goodness, players walk through the places implicitly and explicitly mentioned in the Quran.&#10;&#10;This game is a fun way for children and adults to learn about the history of the places mentioned in the Quran.&#10;&#10;Goal of the game&#10;The object of the game is to build a mosque. The first player to complete the construction of his mosque on one of his places wins.&#10;&#10;&ndash; Translated description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":55,"maxPlayTime":55,"minAge":7,"categoriesAndMechanics":["Children's Game","Economic","Educational","Negotiation","Religious","Events","Roll / Spin and Move"],"rating":5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/NS7QQiQur7sDC3-vnmaFBg__thumb/img/KJHGPhEgF3TH_BQc0J_feoJIy7k=/fit-in/200x150/filters:strip_icc()/pic6252122.jpg","urlImage":"https://cf.geekdo-images.com/NS7QQiQur7sDC3-vnmaFBg__original/img/w2JXft8MaylwvWdV2n7Y4qycx5w=/0x0/filters:format(jpeg)/pic6252122.jpg"},{"bggId":"341414","name":"Catholic Trivia: Traditional Version","description":"Two decks of trivia questions focusing on traditional aspects of Catholicism.&#10;&#10;Contains 500 cards - 1,500 questions in total - in six categories:&#10;&bull; The Baltimore Catechism (C)&#10;&bull;&nbsp;The Latin Mass (M)&#10;&bull; History and the Liturgical Calendar (H)&#10;&bull; Popes, Patron Saints and Other Pious People (P)&#10;&bull;&nbsp;Ritual, Symbol, and Doctrine (R)&#10;&bull; Et Cetera (E)&#10;&#10;","minPlayers":2,"maxPlayers":20,"minPlayTime":30,"maxPlayTime":0,"minAge":8,"categoriesAndMechanics":["Party Game","Religious","Trivia"],"rating":5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/JfGq1Ca6KQhnIAd1dnFPNw__thumb/img/lBl3O8QJaY2veH6Yvx3F5JqriAY=/fit-in/200x150/filters:strip_icc()/pic6256036.jpg","urlImage":"https://cf.geekdo-images.com/JfGq1Ca6KQhnIAd1dnFPNw__original/img/bzEpjoquET7lGZXv56lc86x-kpw=/0x0/filters:format(jpeg)/pic6256036.jpg"},{"bggId":"341418","name":"Sira Box: La Biographie du Prophète Muhammad","description":"Prophet Muhammad holds a unique place in the consciousness and life of Muslims.&#10;He is the one who received and transmitted the Koran, the revealed Text which recalls the eminent place of the Messenger of God, at the same time Prophet, model and guide.&#10;&#10;The SIRA Box game is an exciting game to introduce children and adults to the life of the Prophet&#10;Muhammad, from his birth in Mecca until his death in Medina. Educational, this game calls on memory, encourages players to read the Sira and holds many surprises.&#10;Over 400 questions and answers will test your knowledge, and not necessarily the most learned will win.&#10;&#10;The winner is the first player (or team) to reach the finishing box on one of the 2 boards for 2 modes of play . The game also offers 2 levels of knowledge, for the kids and the experts.&#10;Each card contains 2 questions with 4 answers each. You move on the ladder based on the number of correct answers given (0-2)&#10;&#10;&ndash; Translated description from the publisher + user info&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":35,"maxPlayTime":35,"minAge":7,"categoriesAndMechanics":["Educational","Religious","Trivia","Cooperative Game"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/no26BTQJcH4QE9PR0eCbDA__thumb/img/gFMSp_iE3Np-WGXRs04SJ1zaeaA=/fit-in/200x150/filters:strip_icc()/pic6252118.jpg","urlImage":"https://cf.geekdo-images.com/no26BTQJcH4QE9PR0eCbDA__original/img/MyNiQ6s5xi1nCVDnj3KraptJYqA=/0x0/filters:format(jpeg)/pic6252118.jpg"},{"bggId":"341419","name":"The Combat of the Thirty","description":"&quot;The Combat of the Thirty&quot;&#10;A Chivalric tactical table top wargame set in the Hundred Years War&#10;&#10;It is March 26th, in the year of our Lord, 1351, and 60 men march to their death on a muddy field in France, under an ancient oak tree. The House of Blois, led by Jean de Beaumanoir meets Robert Pembroke and The house of Montfort, in what is the the most famous act of Chivalry in history - The Combat of the Thirty! Play as either faction in this tactical table top wargame of fierce fight and battle to determine once and for all who will carry the day!&#10;&#10;Game play alternates between players, each controlling 30 knights, on a 24x36&quot; grid board. Each player commands 6 different types of unique combat units, and three special characters,one at a time, and will battle to kill or take prisoners for ransom. With every turn a player draws and plays a new Action Card, which grants special abilities or game-changing actions. The game ends when one player has killed all of the opponent's pieces, or the opponent has yielded.&#10;&#10;The Combat of the Thirty's game play and rule book are focused on the history and lore of the 14th century, and the famous Hundred Years War. Each force of 30 knights features  the heraldry and names of the men who actually fought that day, as well as several pages of lore and explanation of this historic battle. This is a tactical table top wargame steeped in the history and story of one of the most celebrated feats of Chivalry in history.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Medieval","Miniatures","Wargame","Action Drafting","Campaign / Battle Card Driven","Command Cards","Dice Rolling","Grid Coverage","Highest-Lowest Scoring","Moving Multiple Units","Simulation","Turn Order: Pass Order"],"rating":3.5,"complexity":3}]