[{"bggId":"233670","name":"The Caster Chronicles","description":"A mysterious academy hides a dark secret. Girls form magical contracts and participate in magical battles using enchanted cards in this exciting new card game from the creators of Force of Will. Assemble your Casters and call Servants in this exciting and engaging new card game system. The Caster Chronicles is sure to push your strategy, will, and magic to the absolute limit!&#10;&#10;The Caster Chronicles is a Japanese trading card game created by the Force of Will game company.&#10;&#10;Play caster cards to generate aether, which you then use to play servants, conjures, and barriers to attack your enemy.&#10;&#10;In this turn based game, players trade off amassing the game&rsquo;s resource, called aether. They then use that aether to summon servants, use conjures and barriers for support. By using your forces you can attack your opponent. Destroy all seven of your opponent&rsquo;s orbs and then attack your opponent one final time to win the game!&#10;&#10;From the publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Card Game","Collectible Components"],"rating":3,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/V77c-EySdlgquuJCCp8yKg__thumb/img/CqWuxRMeBZ8yfqrlOWUx7LKFb64=/fit-in/200x150/filters:strip_icc()/pic3874070.png","urlImage":"https://cf.geekdo-images.com/V77c-EySdlgquuJCCp8yKg__original/img/nahbWNXPZlnXGBYiEQkRIHWUIC4=/0x0/filters:format(png)/pic3874070.png"},{"bggId":"233721","name":"Flucht aus der Piratenbucht","description":"Anyone who thinks that ghost ships and the fearsome ghost of Capt'n Whitebeard are just spooky seaman's stories is wrong. To retrieve the legendary gold treasure from dangerous Pirate Cove, the crew must work together. Skillful strategy and a little luck will allow you to escape from Capt'n Whitebeard, defeat all the ghost ships and fight your way out of the cove to freedom!&#10;Contents: 1 Pirate Cove game board, 1 ghost of Capt'n Whitebeard figure, 30 ocean tiles, 1 fortune coin, 4 treasure chest layouts, 1 die.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":15,"minAge":5,"categoriesAndMechanics":["Children's Game","Pirates","Cooperative Game","Dice Rolling","Memory"],"rating":3.354165,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/MxCzgS-zLyY4D0EiAe3stg__thumb/img/w0Ov0W1Ru38sfJ_Aa6IbYcs5RtA=/fit-in/200x150/filters:strip_icc()/pic3858205.jpg","urlImage":"https://cf.geekdo-images.com/MxCzgS-zLyY4D0EiAe3stg__original/img/-eZ-p6b24j3SF7_OyTbU5tF_684=/0x0/filters:format(jpeg)/pic3858205.jpg"},{"bggId":"233739","name":"Shape Whiz","description":"Description from the publisher:&#10;&#10;Race your opponent to find the shape that fits the geometry clue. Everyone must agree the shape is a match or flip the card to check the facts. So fun, you won't even realize you're learning all about geometry.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":10,"maxPlayTime":15,"minAge":10,"categoriesAndMechanics":["Educational"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/k_DpFM3FGU1qSdHluP2Wrw__thumb/img/ryk9CJFXenaSSTxAcLprc_MvNU4=/fit-in/200x150/filters:strip_icc()/pic4693057.jpg","urlImage":"https://cf.geekdo-images.com/k_DpFM3FGU1qSdHluP2Wrw__original/img/9E_tqasDqq-O1oo0fbfkObmhDyo=/0x0/filters:format(jpeg)/pic4693057.jpg"},{"bggId":"233743","name":"The Climbing Knights","description":"Description from the publisher:&#10;&#10;To win the King's tournament, you must be the fastest knight to climb the castle. But watch out! The guards are watching to stop your progress, so you must be strategic in how you move up the castle wall. The first knight to reach the top twice and retrieve their coat of arms wins the title of King&rsquo;s Climber. (From Publisher's Website.)&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":45,"minAge":8,"categoriesAndMechanics":["Children's Game","Medieval"],"rating":3.2375,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/UUBlIX5xru7w382jbUL3XA__thumb/img/zbST_m90z-DXMig0EfgSXwJ6Kd4=/fit-in/200x150/filters:strip_icc()/pic6134408.jpg","urlImage":"https://cf.geekdo-images.com/UUBlIX5xru7w382jbUL3XA__original/img/lpLkcPsbzLSWmaMg_-qWI0xu-gY=/0x0/filters:format(jpeg)/pic6134408.jpg"},{"bggId":"233747","name":"Gumball Words","description":"Description from the rulebook:&#10;&#10;How many points are your &quot;Words&quot; worth?&#10;&#10;Players move around the gameboard by following the directions found on the letter tiles, and collect those tiles as they go. The player who uses those letter tiles to build the best words wins! (From Publisher's Website)&#10;&#10;Collect as many letter titles as you can before you must remove your coin pawn from the gameboard.  Use the instructions on the title to plan where you will move to next.  At the end of the game, the player who can build the highest-scoring words will win.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":45,"minAge":8,"categoriesAndMechanics":["Educational"],"rating":3.083335,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/SknDh5fiODKLA62SrODDyA__thumb/img/dxHkdmGpX4N85lq0PD1ZWy1wYb0=/fit-in/200x150/filters:strip_icc()/pic3993558.jpg","urlImage":"https://cf.geekdo-images.com/SknDh5fiODKLA62SrODDyA__original/img/BVZtt0F6QJfalRPkHMDlqVhOOu8=/0x0/filters:format(jpeg)/pic3993558.jpg"},{"bggId":"233758","name":"Junk Race","description":"Description from the designer:&#10;&#10;In Junk Race you play the driver of a car that is constantly falling apart in the middle of the most important race of your life. Thankfully, this is happening to all the other drivers too.&#10;&#10;Junk Race is a destruction management racing game for 2-5 players set in a creative, but perhaps mechanically challenged world. Players will face the constant breakage of parts of their cars, and will have to spend their limited Wrench resources between repairs, attacking other players, and simply driving their car.&#10;&#10;The hazardous and varied terrain of the Junk Race will push your car to its limits, and will send you careening off a cliff or into a tree if your car isn't equipped to handle the challenges of the land. But, wait! Do I see an upgrade station ahead?&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":30,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Dice","Racing","Science Fiction","Action Points","Dice Rolling","Modular Board","Open Drafting","Point to Point Movement","Simultaneous Action Selection","Take That"],"rating":0,"complexity":0},{"bggId":"233772","name":"Meeple Heist","description":"Description from the publisher:&#10;&#10;Meeple Heist is a game inspired by the so called &quot;Heist Movies&quot;, in which something of value has to be stolen by highly skilled individuals, with smart ideas, infiltration and great team work, usually not resorting to guns or violence.&#10;&#10;In the game, a brave team of meeple specialists will take the challenge to perform a great robbery in the Meeple Castle, a Casino controlled by the organized crime. Coincidently, though, more than one team is trying to pull this off at the same time - and maybe even with the same specialists!&#10;&#10;Yes, the meeples are not trustworthy and might be working for other parties (also know as other players). So, while trying to advance their own plan, players must take the challenge to discover which meeple works for whom, utilizing cunning, deduction and a bit of luck (yes, this is a dice game after all). The idea is to control your team with maximum efficiency, positioning them at the right place at the right time to execute your big plan and get away with as much money as possible from the Casino.&#10;&#10;You will lead a charming but unreliable team of specialists: The Brain, The Face, The Muscle, The Eye, The Feet and The Fingers. In the end will you grab just a few coins or can ou pull off the most ambitious heist of all time?&#10;&#10;In any case, just remember: don't trust the meeples!&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":45,"minAge":14,"categoriesAndMechanics":["Deduction","Dice","Spies/Secret Agents","Area Majority / Influence","Dice Rolling"],"rating":3.22619,"complexity":2.3333,"urlThumb":"https://cf.geekdo-images.com/KapHUw8Lm6ncADI31l2U9A__thumb/img/okHBf4WY6o2rSxBj_tDLk3-Q8bg=/fit-in/200x150/filters:strip_icc()/pic3706988.png","urlImage":"https://cf.geekdo-images.com/KapHUw8Lm6ncADI31l2U9A__original/img/4dYgICR8DZPc9FFlQUT4tv4xI4c=/0x0/filters:format(png)/pic3706988.png"},{"bggId":"233774","name":"Conquer the Kings","description":"Description from the designer:&#10;&#10;WELCOME TO CONQUER THE KINGS!&#10;&#10;This game was created with two purposes in mind: first, for those of you who already play chess, Conquer the Kings is a fresh, exciting take on the classic game while maintaining the principles of movement and strategy that made the original so beloved.&#10;&#10;And second, for those of you that may have been intimidated by the original game, Conquer the Kings presents an interesting variance to the original that allows for learning to be had in a friendlier, perhaps more easily digestible manner.&#10;&#10;What's most intriguing is that neophytes and experts alike can sit at the same table and, at times and when necessary, join forces to reach the ultimate goal: Conquer the Kings!&#10;&#10;WHAT MAKES CONQUER THE KINGS SO SPECIAL?&#10;&#10;&#10;     2, 3 or 4 players battle at a time (individually or in teams) - You get to talk about your moves too!!! Work together in teams to discuss strategy, or to help out a weaker player.&#10;     Unlimited openings, strategies and styles of play are available&#10;     Pawn Movement arrow - Allows you to move your pawns as a unit;&#10;&#10;&#10;Either Forward, Left/Right Flank or Retreat&#10;&#10;     Each player has complete discretion on the initial setup of his/her pieces&#10;     Alliances between players are allowed, and sometimes necessary&#10;     Friendly banter between players is anticipated (but keep it clean!)&#10;&#10;&#10;So, who amongst you will be the last one standing? Who amongst you will Conquer the Kings?&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Abstract Strategy","Grid Movement"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/tDXsSHAe0cdDpWp-IbfQWA__thumb/img/CS_N6a8d002QG-k2Syrkn-IyJPA=/fit-in/200x150/filters:strip_icc()/pic3720341.jpg","urlImage":"https://cf.geekdo-images.com/tDXsSHAe0cdDpWp-IbfQWA__original/img/BQSkouXXr9P9aubJ45iUa3t7jUM=/0x0/filters:format(jpeg)/pic3720341.jpg"},{"bggId":"233775","name":"Duchess","description":"Description from the designer:&#10;&#10;Duchess is a multi-player Chess variant for two to six players.&#10;&#10;In addition to the King, Queen, Bishop, Knight and Rook there are two combination pieces, called the Duchess (bishop + knight) and the Fortress (rook + knight), as well as the Wizard, which moves like a King and also enables pieces next to it to move `by teleportation'.&#10;&#10;Pawns can move forward, backwards or sideways and take on any diagonal. They promote by moving to the central &quot;square&quot; (which is really hexagonal).&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Abstract Strategy","Grid Movement"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/bIUEBvO-6hfBl6ph8_TBBA__thumb/img/2O3ACxfDX-Ck-6s2yvcfYrdjhIo=/fit-in/200x150/filters:strip_icc()/pic3720695.jpg","urlImage":"https://cf.geekdo-images.com/bIUEBvO-6hfBl6ph8_TBBA__original/img/7hrSjADiwRJT7I2FrLgtvzLvSHs=/0x0/filters:format(jpeg)/pic3720695.jpg"},{"bggId":"233777","name":"Samurai Dice","description":"A fast-paced, easy-to-learn but strategic game of honor and vengeance. Samurai Dice lets you play as heroic bushi, charismatic courtiers, wise ascetics and stealthy ninja.&#10;&#10;Grab your four Hero character cards, one for each of the four elements of Earth, Fire, Water and Wind, line them up against the Enemy cards and get rolling.&#10;&#10;Nominate one Hero to attack one Enemy, and roll the five dice. Three dice are white, one is blue and one is red. The Blue Die represents your hero; each White Die that rolls below or equal to the Blue Die does one damage to the Enemy. The White Dice that roll above the Blue Die do damage to your hero.&#10;&#10;If the Red Die rolls over the Blue Die then the Enemy you're attacking gets to activate their ability. This can be anything from an energy shield that protects the Enemy to a devastating counterattack or more.&#10;&#10;When you defeat an Enemy the Hero that you used gets to level up and heal, get stronger or gain powerful loot. Each Hero has two abilities that they can use to increase the chances of success. The only thing is that you have to choose which ability you want to activate, and you can only activate it once per game.&#10;&#10;The goal of the game is to take out all of the Enemies before your opponent takes out all of theirs. You can play solo, too!&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":10,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Fighting","Dice Rolling"],"rating":4.25,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/4cxIW3tEwzjmdltEvzgRQg__thumb/img/TR1N2C2lt2kLjgDPjhJcP3V8q0k=/fit-in/200x150/filters:strip_icc()/pic3757326.jpg","urlImage":"https://cf.geekdo-images.com/4cxIW3tEwzjmdltEvzgRQg__original/img/1Dp_yQ-fJpfqPlJoim7gHDz7UUI=/0x0/filters:format(jpeg)/pic3757326.jpg"},{"bggId":"233778","name":"FAB: Crusader","description":"Welcome to North Afrika November 1941 and Operation Crusader, which was part of the Western Dessert Campaign fought during World War 2.&#10;&#10;After the Allied defeat in Operation Battleaxe in June, a lull settled in North Africa, and the Axis siege of Tobruk continued. The Allies used this time to build up their strength and the 8th Army was formed. Before dawn on 18 November, the 8th Army was ready to strike and the Allies launched a sweeping offensive into the Axis controlled Cyrenaica (Eastern Libya) in order to relieve the besieged fortress of Tobruk. After a series of swirling battles, the Axis had to withdraw and the siege was lifted.&#10;&#10;Michael Gustavsson, co-designer of FAB: Golan&rsquo;73 is back with volume IV in the Fast Action Battle series. In this game, as the Allied player, you control the XXX and XIII corps, Tobruk Garrison and the Strategic Reserve force of the 8th Army. As the Axis player, you control the DAK (Deutsches Afrika Korps), the Italian XXI corps and the Corpo d&rsquo; Armata di Manovra (CAM) of the Panzergruppe Afrika commanded by the famous Erwin Rommel. Units in the game represents regiments/brigades and some battalions, while assets are mostly battalion size and turns are 1-2 days in time.&#10;&#10;In FAB: Crusader you will see features like Motorized Infantry units, higher stacking limits, Tank Refit, Italian Trieste Reserve Division, Ghost Units, Fortified areas, Realistic Armor treatment, Special Reconnaissance Unit Capabilities, movement points to trace Supply and Divisional Integrity rules, a new Combat Matrix and other rules for transferring the system to desert warfare.&#10;&#10;Assets include Machine Gun Battalions, Allied &quot;I&quot; Tanks, Powerful German 88&rsquo;s (AT) and more. Various events are included such as Air Missions, Allied Rapid Response, The Beta Convoy, British LRDG Commando Raid, Naval Bombardment and German Auftragstaktik, Command Confusion among others. The game also have optional rules to enhance realism such as Allied Armor Doctrine, Probe Attacks, Italian SNAFU Check and German Momentum.&#10;&#10;This battle will provide interesting challenges to both sides: Will the Allies try a risky breakout from Tobruk, and will it be relieved, will Rommel go for a dash to the wire, will Allied replacements outlast Axis fuel and supply, will the Italians crumble or hold? Now, it is up to YOU to find out&hellip;&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":120,"maxPlayTime":240,"minAge":12,"categoriesAndMechanics":["Wargame","World War II","Action Points","Area Movement","Chit-Pull System","Dice Rolling","Secret Unit Deployment","Simulation"],"rating":3.166665,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/YNk8ZwOPSneqjRganGoEbA__thumb/img/6B74zJgWQttGWoQxxiROF9oFi4U=/fit-in/200x150/filters:strip_icc()/pic3721709.jpg","urlImage":"https://cf.geekdo-images.com/YNk8ZwOPSneqjRganGoEbA__original/img/Ek4STZ0KqUjajyUu_vuWhBrxDgU=/0x0/filters:format(jpeg)/pic3721709.jpg"},{"bggId":"233780","name":"Grit & Gold","description":"Grit &amp; Gold is a lone player's mine crawling, tile laying, old west adventure.&#10;&#10;You play a desperate prospector facing off against a horde of bandits - searching their goldmine hideout, relieving it of gold, and potentially escaping with your life.&#10;&#10;A tile laying and movement puzzle game with a bunch of luck and dice chucking mixed in.&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":10,"maxPlayTime":25,"minAge":12,"categoriesAndMechanics":["American West","Print & Play","Puzzle","Dice Rolling","Push Your Luck","Tile Placement"],"rating":3.06111,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/fg1IMWjgtF2Z-WYhgeJ_iQ__thumb/img/8Xup753SqstSD7I3njx3SPe_PDY=/fit-in/200x150/filters:strip_icc()/pic3722580.jpg","urlImage":"https://cf.geekdo-images.com/fg1IMWjgtF2Z-WYhgeJ_iQ__original/img/OP4KIu8ziWmmDqHPiGYypmVOSgU=/0x0/filters:format(jpeg)/pic3722580.jpg"},{"bggId":"233781","name":"Six Sided Stout","description":"Six Sided Stout is a print and play, solo roll-and-write game that won an honourable mention in the 2017 GenCant Roll and Write contest.&#10;&#10;You are a home brewer, preparing for the local home brew contest! Having decided to make your favourite type of beer, stout, you&rsquo;ll spend up to 10 days, visiting the market, trying to find the best ingredients you can to make your the best beer you can. But you&rsquo;ll never know how much will be available, as all the local brewers scramble for ingredients.&#10;You have some help, but will it be enough?&#10;&#10;Every day will you roast the malt you already have or go to the market to search out more ingredients? At the market will you buy malt, hops or yeast? Roll the dice to see how many of that ingredient you get, before adding them to your recipe!&#10;&#10;Build your recipe by filling in the grid making sure the ingredients meet the requirements to score you the best points possible. Be careful though, you only have 10 days (turns) to make the best beer possible by scoring the highest points with the judges.&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":10,"maxPlayTime":30,"minAge":18,"categoriesAndMechanics":["Dice","Print & Play","Area Majority / Influence","Dice Rolling","Paper-and-Pencil"],"rating":2.857145,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/6ZrXKrSjOJjC6S6vHF7KIA__thumb/img/Aa2tieBs2a4YSuywmI5FwcfacHk=/fit-in/200x150/filters:strip_icc()/pic3774993.png","urlImage":"https://cf.geekdo-images.com/6ZrXKrSjOJjC6S6vHF7KIA__original/img/crGCzuQeScRTubu_W621ZmUvofs=/0x0/filters:format(png)/pic3774993.png"},{"bggId":"233782","name":"Brooke","description":"In the middle of the 19th century, in Sarawak, in the north of Borneo, two fierce opponents are facing each other. The Iban-People, known and feared for their head hunting and piracy, and James Brooke, an English adventurer and vassal of the sultan of Brunei, who recently became the ruler of Sarawak.&#10;&#10;In this strategy game 2 players wrangle with their dice for the predominance in different areas, which are represented by cards. In 4 battles are fought three areas each.&#10;&#10;Alternately, the counterparties put dice with different values on the cards. But the waters off the coast are treacherous, so the dice change their positions and valence again and again. Anyone who holds the majority on one card after the betting of all the dices, assures the supremacy in this area.&#10;&#10;Only those who are planning ahead, take advantage of the water's vagaries, and use their limited resources clever, will claim the rule in Sarawak.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":15,"maxPlayTime":25,"minAge":10,"categoriesAndMechanics":["Abstract Strategy","Card Game","Dice","Area Majority / Influence","Worker Placement"],"rating":3.083335,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/29yIxlPVkkydTLU4-idAjQ__thumb/img/LFqWUWT6D-mXAx_3tAuIVA0Z0mc=/fit-in/200x150/filters:strip_icc()/pic3710137.jpg","urlImage":"https://cf.geekdo-images.com/29yIxlPVkkydTLU4-idAjQ__original/img/gmoiZGLoGaxRGfoEN1Ptz59_kbA=/0x0/filters:format(jpeg)/pic3710137.jpg"},{"bggId":"233786","name":"Story Bowl","description":"Story Bowl is a multi-round party game where you get your team to guess 3-word micro-stories by speaking, acting, and squeaking.&#10;&#10;Players use the reusable cards to quickly turn prompts (like &ldquo;a nightmare you&rsquo;ve had recently&rdquo;) into 3-word micro-stories (like &ldquo;underwear speech school&rdquo;) based on their own experiences.&#10;&#10;Then you take turns getting your team to guess as many micro-stories as possible. Once all the micro-stories have been guessed you move onto the next round. With each round clue-giving becomes more restricted, but you&rsquo;ll develop new inside jokes together that will help make guessing easier. &#10;&#10;     Round 1: SPEAK: Say anything you want (except one of the 3 words) &#10;     Round 2: ACT: No more talking, only charades. &#10;     Round 3: SQUEAK: You are only allowed to say one word (and it can&rsquo;t be one of the 3 in the micro-story)! &#10;&#10;&#10;After the last round, everyone can share the hidden stories behind their micro-stories!&#10;&#10;Based on the public domain game known as Celebrities.&#10;&#10;","minPlayers":4,"maxPlayers":16,"minPlayTime":30,"maxPlayTime":45,"minAge":8,"categoriesAndMechanics":["Humor","Memory","Party Game","Acting","Memory","Paper-and-Pencil","Team-Based Game"],"rating":4.291665,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/Ej3-AgNB5s34jWh2fyXt-A__thumb/img/KrBTfvEIZ3cngcC2pKSFocXRPDs=/fit-in/200x150/filters:strip_icc()/pic3707479.png","urlImage":"https://cf.geekdo-images.com/Ej3-AgNB5s34jWh2fyXt-A__original/img/FIUAt8NE2iwKP20u-Do0EVswHP4=/0x0/filters:format(png)/pic3707479.png"},{"bggId":"233792","name":"Dice of the Dead: Tokyo Armageddon","description":"A board game based on the tabletop RPG &quot;Dice of the Dead&quot; by SNE/Cosaic.  It is based on the same world however it takes place about 6 months after the RPG timeline, just before a nuclear bomb is going to be dropped on zombie dominated Tokyo.  It is here that the half-zombie players must throw themselves, as the last hope of saving Tokyo, into stopping the nuclear missle from being detinated, while fighitng zombies.  It is a cooperative story game in which  your companions one after another fall into the horde of zombies while trying the accomplish the mission.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":60,"maxPlayTime":90,"minAge":12,"categoriesAndMechanics":["Dice","Zombies","Action Points","Cooperative Game","Dice Rolling","Storytelling"],"rating":3.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/kl-MQSnSs-GOsWDbJGUDqw__thumb/img/VlRJLGaIX9FntNHkI4bLjcqCOQo=/fit-in/200x150/filters:strip_icc()/pic3724192.jpg","urlImage":"https://cf.geekdo-images.com/kl-MQSnSs-GOsWDbJGUDqw__original/img/CVozpUCAjVv-A0yc0BAGtyQTaz0=/0x0/filters:format(jpeg)/pic3724192.jpg"},{"bggId":"233807","name":"The Bloody Triangle: Drive on Dubno, 1941","description":"Issue game in Command Magazine Japan #120&#10;&#10;On June 22nd 1941, the German army began operation Barbarossa, the biggest ground operation ever in history, and overran the western Soviet armies immediately. Soviet troops withdrew after fighting back, and their mechanized corps counterattacked in front of Dubno.&#10;&#10;The Bloody Triangle: Drive on Dubno, 1941 is a two-player game on the capture of Dubno by the German 48th armored corps and the Soviet army counterattack.&#10;&#10;Based on the &quot;Panzer korps&quot; system, this game reproduces the clash between the Soviet mechanized corps relying on heavy tanks and numbers, and the skilled German Army superior in combined arms. Which side will be victorious in one of history's biggest tank battle?&#10;&#10;Components:&#10;rulebook (12 pages)&#10;map (A1 size)&#10;counters&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["World War II","Hexagon Grid"],"rating":3.75,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/TRc_MWgKD21ikn1sknIRVQ__thumb/img/dOkCMgY07PQDrMCwPUxszYLbHMc=/fit-in/200x150/filters:strip_icc()/pic3742060.jpg","urlImage":"https://cf.geekdo-images.com/TRc_MWgKD21ikn1sknIRVQ__original/img/Px2smFetK4OxVWWq977wsmhtxRQ=/0x0/filters:format(jpeg)/pic3742060.jpg"},{"bggId":"233810","name":"Ferret Card Game","description":"Ferret is a fun, energetic, card game. The object of the game is to find the elusive Ferret and then give, take and trade your way down to one card. If you've managed to hold onto the Ferret, you win!&#10;There are 4 animals in the game: The Ferret, The Fox, The Hound and the Weasel. These little rascals love to chase each other. The other cards are number cards (0-6) and action cards (Give Left, Take Right, Trade Anyone, etc).&#10;The cards are shuffled into an Number card pile and an Action card pile. The Animals are considered Action cards. Players draw cards and perform the actions on the cards. Play shifts to the left and the next player does the same. Play continues until someone finds the Ferret.&#10;&#10;","minPlayers":3,"maxPlayers":6,"minPlayTime":5,"maxPlayTime":60,"minAge":6,"categoriesAndMechanics":["Animals","Card Game","Children's Game","Deduction","Humor","Party Game","Trading"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/0BQ8wGGi-vJj87f8MOhhZQ__thumb/img/pJRDqaT_vWwOmZbjjItmQxWL154=/fit-in/200x150/filters:strip_icc()/pic3721506.jpg","urlImage":"https://cf.geekdo-images.com/0BQ8wGGi-vJj87f8MOhhZQ__original/img/T2TsvBA77CBaqn_QcYs-FZBwsvM=/0x0/filters:format(jpeg)/pic3721506.jpg"},{"bggId":"233812","name":"New World Magischola House Rivalry","description":"Description from the publisher:&#10;&#10;Embrace your dream of going to wizard school, as you enroll in strange classes and clubs, study to improve your grade and accelerate your learning, and use magical spells and artifacts to cause mayhem as you race to win the First House Cup.&#10;&#10;House Rivalry is a competitive card game that transports 2-5 players to the beginning of the semester at New World Magischola, North America&rsquo;s premiere college of wizardry. Start your journey by selecting a unique character and house, then set out to complete your studies, where you&rsquo;ll attend class, cast spells, fight monsters, and compete against rival students for the glory of the First House Cup!&#10;&#10;But beware &hellip; like mundane schools, your success at New World Magischola will not only depend on how well you perform in your classes, but also how well you negotiate the social landscape. Will your popularity prevent other players from hexing you? Or will your overconfidence sow distrust and lead to your demise?&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":40,"maxPlayTime":90,"minAge":10,"categoriesAndMechanics":["Card Game","Fantasy","Hand Management","Simultaneous Action Selection","Take That","Variable Player Powers"],"rating":3.82143,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/jCi8i0WS7qCC-1qnU_nX4w__thumb/img/yYEZxhXAuXipPM6Ns-JGkrAw_Yg=/fit-in/200x150/filters:strip_icc()/pic3706938.png","urlImage":"https://cf.geekdo-images.com/jCi8i0WS7qCC-1qnU_nX4w__original/img/eZN3TB31VBdUOWMcAKkwtNsF5qs=/0x0/filters:format(png)/pic3706938.png"},{"bggId":"233816","name":"Kung Pao Chicken","description":"Kung Pao Chicken is a 3 to 5 player 15 min social deduction party game. A fun filler for everyone from age 8 and up.&#10;&#10;Each game is played in three rounds. In every round, each player needs to figure out if they are a chicken or a fox. End of the round, players will score 1 vp for guessing their identity correctly AND additional points from team objective. If you are a chicken, your team of chickens will score based on number of saved chickens. Foxes will score based on number of captured chickens. At the end of three rounds, the player with most vp wins the game.&#10;&#10;Please note: There are only three animals in this 18 card game. Plus, in the beginning of each round, you should already have the information on more than half of the 18 card deck. If you use some probability and information from other players, perhaps you can figure it out.&#10;&#10;","minPlayers":3,"maxPlayers":5,"minPlayTime":10,"maxPlayTime":15,"minAge":8,"categoriesAndMechanics":["Animals","Card Game","Deduction","Party Game","Closed Drafting","Deduction","Secret Unit Deployment","Simultaneous Action Selection"],"rating":3.204165,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/CxrHHFHHiGdUo9YhI3yWaw__thumb/img/LIcciSNBeraPMKV1VPdzBJD70pw=/fit-in/200x150/filters:strip_icc()/pic7228105.jpg","urlImage":"https://cf.geekdo-images.com/CxrHHFHHiGdUo9YhI3yWaw__original/img/O9G3TUlPpbA4tsiSylVKva5StCM=/0x0/filters:format(jpeg)/pic7228105.jpg"},{"bggId":"233834","name":"Bacon, Letters and Tomatoes","description":"Description from the designer:&#10;&#10;The word-building, burger-stacking card game!&#10;&#10;It's the lunch rush at Elisabeth's Diner! Tables are waiting for their food and it's up to you to feed those hungry customers! Use letter Ingredient Cards to build word burgers, fulfill tables, and collect tips. Be quick: if your fellow chefs feed more people than you, your shift might end before you realize!&#10;&#10;Two to four players use Ingredient Cards to build word burgers, fulfilling the Guest Checks. The first player to fulfill 3 Guest Checks ends the game, and the player who has earned the most money at the end of the day is the winner.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Word Game","Contracts","Hand Management"],"rating":3.75,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/bjR9EwURw3Ub-1uYqfdV1A__thumb/img/sYnRBCVvAKY4AG5JLSjqK4CmKA8=/fit-in/200x150/filters:strip_icc()/pic3718621.jpg","urlImage":"https://cf.geekdo-images.com/bjR9EwURw3Ub-1uYqfdV1A__original/img/7EEZG4f4J2ueQSx3nq8W7T5vUN0=/0x0/filters:format(jpeg)/pic3718621.jpg"},{"bggId":"233841","name":"Food Facts","description":"Description from the publisher:&#10;&#10;Which nutrients do we consume daily in our food? Food Facts offers a playful and entertaining introduction into this topic, and also sparks an interest among people who may normally not care about the subject.&#10;&#10;In the game the players have to guess and compare nutritional values &#226;&#128;&#139;&#226;&#128;&#139;of different kinds of food. For example the following questions have to be answered:&#10;&#10;Do hazelnuts or chocolate have a higher fat content? Are there more carbohydrates in rice or potatoes? Does a trout or a pork tenderloin contain more protein? Are cherries or ketchup more sugary? Is there a higher amount of fiber in peas or bananas? Do almonds or honey contain more calories? Is the water content higher in mushrooms or apples?&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":10,"maxPlayTime":20,"minAge":10,"categoriesAndMechanics":["Card Game","Educational","Trivia","Betting and Bluffing"],"rating":3.433335,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/mApoEXS3N-jsnUSlPBDhrg__thumb/img/qex6ot4gSWdbvCwJYocEZ9ggiVw=/fit-in/200x150/filters:strip_icc()/pic3710443.jpg","urlImage":"https://cf.geekdo-images.com/mApoEXS3N-jsnUSlPBDhrg__original/img/Ab7J99WPh8-JBDhUyE7WEhTS3tk=/0x0/filters:format(jpeg)/pic3710443.jpg"},{"bggId":"233844","name":"Naturvetarna: Skogen","description":"The main title of the Naturvetarna series translates roughly to &quot;those who know about nature&quot;, each individual entry covering a Swedish biome. For instance, the Skogen (&quot;The Forest&quot;) box deals with species of plants, animals, mushrooms and lichen that can be found in various Swedish forests.&#10;&#10;The game consists of a deck of 82 cards, with two cards to a species. One of these has an illustration on the front, the other a few sentences written in the first person listing characteristic traits or related facts; both have the name of the species on the back.&#10;&#10;Several ways to use the cards are suggested, such as employing them in group exercises (e.g. sorting cards by categories or shared traits) or for a scoreless solo matching game. When played competitively, the rules suggest dividing an arbitrary number of participants (like a class of pupils) into two teams, potentially with a moderator (like a teacher) to read out clues from the text cards. The teams then try to collect pairs of cards either by identifying the species on a given picture card, gaining an additional point if they don't need any clues to do so, or by selecting the right picture card based on the clues from the corresponding text card.&#10;&#10;In addition to Skogen, the series includes the entries Insj&ouml;n (The Lake), &Auml;ngen (The Meadow), Havet (The Sea), Fj&auml;llet (The Fell), and Staden (The City).&#10;&#10;","minPlayers":2,"maxPlayers":99,"minPlayTime":0,"maxPlayTime":0,"minAge":8,"categoriesAndMechanics":["Children's Game","Educational","Trivia"],"rating":1,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/Vqhd_VW85BjBwXMpSJxLYA__thumb/img/Df7WLz_pU-ZzVX8poh0Gz7fT25k=/fit-in/200x150/filters:strip_icc()/pic3707936.jpg","urlImage":"https://cf.geekdo-images.com/Vqhd_VW85BjBwXMpSJxLYA__original/img/8ZXk6XwBd4biXcsKDxhatPqTRUw=/0x0/filters:format(jpeg)/pic3707936.jpg"},{"bggId":"233846","name":"Parang","description":"Parang is a card game from Borneo, with a theme of headhunting shown through the artwork. The aim is to collect the most head trophies from victory cards. These are separated into three piles with 1, 2 and 3 skulls (Antu Pala) respectively. Players have identical hands of 9 cards and bid simultaneously on each of the three piles; a complete round thus consists of three mini-rounds. Generally speaking the highest valued card wins, but identical cards cancel each other, and there are some other special cases. Ties are broken through a rock-paper-scissors mechanism based on the cards in the tie.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":10,"maxPlayTime":20,"minAge":8,"categoriesAndMechanics":["Bluffing","Card Game","Rock-Paper-Scissors","Simultaneous Action Selection"],"rating":3.166665,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/fJfyIXrnZQp1ifQwcLCd9Q__thumb/img/hOQ2OKaqjeeK2rC5VBpFvplr8Sg=/fit-in/200x150/filters:strip_icc()/pic3706983.jpg","urlImage":"https://cf.geekdo-images.com/fJfyIXrnZQp1ifQwcLCd9Q__original/img/lYjcE2BNaEmKB86eD1rAD_F3FXE=/0x0/filters:format(jpeg)/pic3706983.jpg"},{"bggId":"233850","name":"King Fu: Guerreros Shaolín","description":"King Fu, Guerreros Shaol&iacute;n is a 2 to 6 player&acute;s game that represents kung fu combats between expert fighters who mix styles and martial movements along with supernatural abilities and powers. Alone or by teams, the winner will become the new masters of the shaolin temple.&#10;The goal of the game is to defeat all the oponents, each player starts with 4 health tokens and 3 Qi tokens, once a player have no healt tokens left, he's automatically knocked out, losing 3 Jade points (Victory points).&#10;The Qi tokens can be used to activate special cards, based on Kung Fu styles.&#10;The fighters move around the board using cards like &quot;jump&quot; or &quot;run&quot;, hit their opponents using &quot;blow&quot;, &quot;Tiger&acute;s claw&quot; or &quot;Leopard&acute;s assault&quot; or defend themselves using &quot;defense&quot; or &quot;Crane's valance&quot;&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":15,"maxPlayTime":60,"minAge":6,"categoriesAndMechanics":["Fighting","Action Queue","Area Movement"],"rating":5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/TgzamuyYYQd7e-KuviawGA__thumb/img/CeobMjA1ObkGFOx9XG8Z3BnAuig=/fit-in/200x150/filters:strip_icc()/pic3861467.jpg","urlImage":"https://cf.geekdo-images.com/TgzamuyYYQd7e-KuviawGA__original/img/TOpZQFgTOnVAT41VJpnwSqwFPqk=/0x0/filters:format(jpeg)/pic3861467.jpg"},{"bggId":"233853","name":"Puck Luck Hockey Game","description":"This is a two-player magnetic hockey game. The board is an ice rink, with a clear plastic cover, and a magnetic puck underneath. Each player has a plastic hockey stick with a magnet in the end. The players use their hockey stick to shoot the magnetic puck into each other's nets.&#10;&#10;The first player to score 10 goals wins.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Children's Game","Sports"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/rk2_vqQ2O6Br2JlpwMtJsg__thumb/img/nxpIDx6ip2yCTjycpjDdfOF4t_A=/fit-in/200x150/filters:strip_icc()/pic3722833.jpg","urlImage":"https://cf.geekdo-images.com/rk2_vqQ2O6Br2JlpwMtJsg__original/img/KNjEcfPtxM8z09nkQuV26p0Oppw=/0x0/filters:format(jpeg)/pic3722833.jpg"},{"bggId":"233861","name":"BraveGuard","description":"BraveGuard is a rpg-inspired strategy game that captures the spirit of high-adventure in a fantasy world. Players control a Hero with unique abilities as they explore the open-world map, defeating Encounters and gaining Treasure on their quest for victory. A core set of simple rules that make it quick to get started, but multiple Scenarios to choose from allow players to either work together in a cooperative game, or go head-to-head for victory in a competitive game. This variety of scenarios provides the option of either a lighter game or one with more depth.&#10;&#10;Each game starts with the Heroes in central town, from there players choose their own path. The map is divided into several areas with their own types of increasingly difficult Encounters - beginning to the relative ease of the Plains, into the dense Forests further out, then giving way to the dangers of the ancient Ruins. In the furthest reaches, players will find a variety of unique points of interest, like the Great Tree or Eternal Volcano, which will be their goal for many of the unique Quests. There are also the Fallen Palaces, home to the great Fiends - the most challenging Encounter for any Hero.&#10;&#10;The Encounter system is the heart of most turns in every Scenario. After moving, players draw an Encounter card matching the type of space they are in. There are two options for how to approach each Encounter, each corresponding to one of the 4 stats - Combat, Agility, Magic, or Intelligence. Players must use try to determine which stat they think each option is and evaluate their various bonuses to determine which option is best for them. After deciding, you'll flip the card over to see the required stat and target number, then roll the die and add your bonuses. Win and you get a Treasure, lose and you're down a Heart. Lose all your Hearts and you must spend the next turn healing up at the nearest Camp. At any point during your turn you can choose to use one of your Hero's unique powers to help you in a number of ways.&#10;&#10;BraveGuard was developed with the goal of being a game that offers seasoned gamers a quick &amp; compelling adventure, but also offers enough clarity and lighter options to be welcoming to new gamers...young or old! At it's core the game offers choice every turn, character development, and serves as an introduction to the core concepts to help create the next generation of serious gamers!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":90,"minAge":8,"categoriesAndMechanics":["Fantasy"],"rating":5,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/1OW4ncAEyI-8jimH8nUpFA__thumb/img/x3-szE_YaEWr1OJsmhAOg9gRPzY=/fit-in/200x150/filters:strip_icc()/pic4548016.jpg","urlImage":"https://cf.geekdo-images.com/1OW4ncAEyI-8jimH8nUpFA__original/img/SH_V5YMD8sTw2B3WoLFLsxRNe_Q=/0x0/filters:format(jpeg)/pic4548016.jpg"},{"bggId":"233870","name":"Fuel Tycoons","description":"Fuel Tycoons is a microgame for 3 gambling industrial magnates whose trust controls the global oil and gas reserves.&#10;&#10;Anyone who fulfills best the self-negotiated agreements of the trust sells the fossil raw materials most successfully and receives economic power. &#10;The cards indicate the amount of different fuel types (oil or gas)in this turn and whether the raw material should be sold cheap or expensive. Based on this information the players have to decide whether to sell a small or big quantity at a high or low price. The agreement is made jointly, but usually only one player profits from it, the others go empty.&#10;&#10;Bluffing and clever tactics are the keys to profit &amp; power in this fast and elegant microgame.&#10;&#10;","minPlayers":3,"maxPlayers":3,"minPlayTime":12,"maxPlayTime":20,"minAge":10,"categoriesAndMechanics":["Bluffing","Card Game","Economic","Commodity Speculation","Hand Management","Set Collection"],"rating":0,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/r_9g0AG4D7azg3lXKbDTtQ__thumb/img/3gD8jf6eDIpWUuG9ekYZ7Pj7zUo=/fit-in/200x150/filters:strip_icc()/pic3874260.jpg","urlImage":"https://cf.geekdo-images.com/r_9g0AG4D7azg3lXKbDTtQ__original/img/F39n2K9bf2aPZIHloeWU82ywZ3A=/0x0/filters:format(jpeg)/pic3874260.jpg"},{"bggId":"233872","name":"Le Tour de France","description":"Description from the publisher:&#10;&#10;A strategic cycling parlor game for 2-4 players, 8 years and above and takes about 60 minutes to play.&#10;&#10;Will your team win the tour?&#10;Going for the yellow jersey or do you choose for the team? Climbing the hills or pushing it on a flat stage?&#10;Keep in mind you&rsquo;re not the only one cycling the road&hellip; A small steering error, misjudgment or a &lsquo;cycling strategy&rsquo; can cause a sensational collision.&#10;Let your cycling team ride as fast as possible and win the bike race!&#10;&#10;Introduction&#10;In this parlor game you play within the stages as a cycling team. A team consists of three riders and is played with 2 to 4 players. The duration of a one stage game with 4 players is 1 hour. The results of your team and players standings are recorded. A Tour consists of several stages, with the fastest rider over several stages wearing the yellow jersey. You decide for how long and which stages you want to play.&#10;The game is played with cards. By placing a card on the table you decide how fast you are moving your riders on the trail. You try taking tactical moves and benefit from wind advantage by letting your opponent do the hard work. Cast or save your good cards to d&eacute;marrage when you feel that your opponent cannot.&#10;&#10;Side information&#10;The Tour de France board game is published by Just Games but created by Hulst Games. The game is almost identical to the board game &quot;Linkeballen&quot; but had some minor adjustments to increase gameplay.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":90,"minAge":8,"categoriesAndMechanics":["Racing","Sports","Area Movement","Hand Management"],"rating":3.07143,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/hiUCXx7Qk8hEGWKmf305mw__thumb/img/zQ3vikFEnlo0FL5e71G6EQAA8wc=/fit-in/200x150/filters:strip_icc()/pic3706920.png","urlImage":"https://cf.geekdo-images.com/hiUCXx7Qk8hEGWKmf305mw__original/img/aYO7WJmgLDaxX1gMcvcL2BwF_Kk=/0x0/filters:format(png)/pic3706920.png"},{"bggId":"233874","name":"Rückenmaler","description":"R&uuml;ckenmaler translates as 'Back drawer' and is a shape recognition game for children aged 3 and up. The game consists of 12 wooden tiles with a basic shape engraved in them. Player one picks a tile from the stack, follows the line of the engraving with his finger, then draws that line on the back of player two. If player two guesses the shape right, he gets to keep the tile. If not, the tile goes back into the stack.&#10;The game ends when all tiles have been collected. The player with most tiles wins the game.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":3,"categoriesAndMechanics":["Action / Dexterity","Children's Game","Educational","Pattern Recognition"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/mBKikixd3hggonLZsY4-Bw__thumb/img/uv66upWYQyT8MlbwEFDm62UqMPo=/fit-in/200x150/filters:strip_icc()/pic3732091.jpg","urlImage":"https://cf.geekdo-images.com/mBKikixd3hggonLZsY4-Bw__original/img/MsmVXXfBvyW9ShGimKdROKNr0JQ=/0x0/filters:format(jpeg)/pic3732091.jpg"},{"bggId":"233878","name":"Karrewiet","description":"A Karrewiet champion! A board game full of questions and funny facts about animals, showbizz, sports, school, the world and nature &amp; science. Surprise your opponent with your knowledge about stuff that's happening on our planet. Gather all the pieces of the different categories while moving around on the board using direction stones. While collecting your pieces, you build a small cube. When the cube is complete, rush to the finish to be the first one to enter and win the game.&#10;&#10;Karrewiet is named after the Belgium television program about the news. The game can be played with 2 to 4 players and is recommended for kids older than 8 years old.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":45,"minAge":8,"categoriesAndMechanics":["Children's Game","Educational","Trivia","Action Queue"],"rating":3.083335,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/_q9nJSJdq1c64ZmBjDITuQ__thumb/img/Bb5tERvCAGZr-AUbni44Ue66gcw=/fit-in/200x150/filters:strip_icc()/pic3722410.png","urlImage":"https://cf.geekdo-images.com/_q9nJSJdq1c64ZmBjDITuQ__original/img/AN0WV2GpYcEeNftYU49MSudhxFY=/0x0/filters:format(png)/pic3722410.png"},{"bggId":"233883","name":"Egyptian Architects","description":"Gather your idols and prepare your workers, it&rsquo;s time to construct a monument to your Pharaoh!&#10;&#10;In Egyptian Architects players compete to prove who is the greatest architect in the Nile valley by playing cards to construct holy shrines and lay the bricks of the mighty pyramids. But only one will rise triumphant and receive the blessings of the gods.&#10;&#10;Egyptian Architects is a card drafting game over 3 rounds.  Each round players picks cards, and then take turns playing them to build pyramids and score points.  The player with the most points at the end of the 3rd round wins!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Card Game","Open Drafting"],"rating":2.5625,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/G2ArK3KuH7TJc0TzIlIy5Q__thumb/img/H2ULOdHWoF18O1S9smhi_UtKfT0=/fit-in/200x150/filters:strip_icc()/pic6624434.png","urlImage":"https://cf.geekdo-images.com/G2ArK3KuH7TJc0TzIlIy5Q__original/img/2T0mUCSJc3-sYui2DddZoL7A-p8=/0x0/filters:format(png)/pic6624434.png"},{"bggId":"233902","name":"Entdecke die Welt","description":"Description from the publisher (Translated):&#10;&#10;Where do the zebras or the elephants live? Who knows the Statue of Liberty and where the pyramids stand? Many pictures invite the children to discover the earth and to assign the animals to their continents.&#10;&#10;The children have to compare their tiles with the game plan and have to find the places of the pictured motifs (which consists of two tiles). When the children complete the picture of an animal or a sight, they receive the accompanying motif card and thus gain points. &#10; Without text for a first orientation of the world map or with additional information on the backs of the motif cards, the game is getting older with the children.&#10;&#10;Description from the publisher (German):&#10;&#10;Wo leben Zebra und Elefant? Wer kennt die Freiheitsstatue und wer wei&szlig;, wo die Pyramiden stehen? Viele Bilder laden die Kinder ein, die Erde zu entdecken und die Tiere den Kontinenten zuzuordnen.&#10;&#10;Sie vergleichen die K&auml;rtchen mit dem Spielplan und finden die Orte der abgebildeten Motive. Anschlie&szlig;end vervollst&auml;ndigen die Kinder diese Bilder von Tieren oder Sehensw&uuml;rdigkeiten und gewinnen so die meisten Punkte. Dabei wiederholen sie ihre Zuordnung und pr&auml;gen sich das Wissen &uuml;ber Geographie oder die Heimat der Tiere ein.&#10;&#10;Ganz ohne Text f&uuml;r eine erste Orientierung auf der Weltkarte oder mit zus&auml;tzlichen Informationen auf den R&uuml;ckseiten der Motivkarten w&auml;chst das Spiel mit den Kindern mit.&#10;&#10;Content:&#10;30 Cards&#10;42 Cardboard Tiles&#10;4 Map Parts&#10;6 Continent Counter&#10;1 Dice&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":30,"minAge":5,"categoriesAndMechanics":["Children's Game","Educational","Travel","Set Collection"],"rating":2.377275,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/-jyXn_OCvkuoENdYlLG48A__thumb/img/LFPv2f9InkY6AbHY7CVQYrgRKbY=/fit-in/200x150/filters:strip_icc()/pic3753976.jpg","urlImage":"https://cf.geekdo-images.com/-jyXn_OCvkuoENdYlLG48A__original/img/LPL7yVFNTtI1L3xTk30WQkPUrks=/0x0/filters:format(jpeg)/pic3753976.jpg"},{"bggId":"233912","name":"Fwends","description":"Description from the designer:&#10;&#10;The Fwends Game is as simple of a card game as it gets which makes it great for all ages to play.&#10;&#10;You are dealt 7 cards. The first card is flipped over from the top of the deck. Each card has at least one Fwend on it. If the colored dots in the corner match the Fwend card in your hand, you can play it.&#10;&#10;There are three types of action cards: Toss 2 (throw away 2 Fwends), Take 2 (the player who plays this card must draw 2 Fwend cards), and Give 2 (give any two Fwend cards to another player).&#10;&#10;Each player takes turns putting their Fwend cards down. The last person with Fwends in their hand loses.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":10,"maxPlayTime":20,"minAge":6,"categoriesAndMechanics":["Card Game","Children's Game","Humor","Take That"],"rating":0,"complexity":0},{"bggId":"233920","name":"Svarta Korpen","description":"Description from the publisher:&#10;&#10;Svarta Korpen (&quot;Black Raven&quot;) is a Swedish historic miniature skirmish game set in the Viking Age. From the cover (translated from Swedish):&#10;&#10;The year is 835 AD, the location southern England. A mighty viking fleet is approaching the long beaches of Kent. For more than 200 years the threat from the sea will be ever present for the inhabitants of the British Isles.&#10;&#10;Svarta Korpen is a game that allows you to re-create the countless small battles between Vikings and Saxons during the &quot;dark ages&quot; in Scandinavia and Britannia. The game contain rules for movement, combat, character development and more.&#10;&#10;In order to play Svarta Korpen you will need (in addition to the rule book) 25 mm miniature figures and dice.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Fighting","Miniatures","Wargame","Dice Rolling","Simulation"],"rating":5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/wAEFTqoO8_08K2TBuStgBA__thumb/img/SuX6HbpyRjlivlVAEIL-MSaP9WI=/fit-in/200x150/filters:strip_icc()/pic3744674.jpg","urlImage":"https://cf.geekdo-images.com/wAEFTqoO8_08K2TBuStgBA__original/img/fsVqSoXpWTkULPjqyMgE-3oQaUI=/0x0/filters:format(jpeg)/pic3744674.jpg"},{"bggId":"233945","name":"Party People: Holiday Edition","description":"All Party People name tags can be combined to make larger sets. Each set includes a game for 2 or more players. All name tags and beads are plastic. Holiday Edition is a game of improv where players try to win rounds against other players by talking in character about the scenario a judge describes. The first player to win 3 rounds wins the game.&#10;&#10;","minPlayers":2,"maxPlayers":20,"minPlayTime":2,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Party Game"],"rating":3,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/e3BZrxz4-mlMWhhecB9QrA__thumb/img/KugKAEPmd49XVMYAdfn7hves2ig=/fit-in/200x150/filters:strip_icc()/pic3721469.jpg","urlImage":"https://cf.geekdo-images.com/e3BZrxz4-mlMWhhecB9QrA__original/img/-p2Ur0v-COAg-_WkhD-37ulXI5k=/0x0/filters:format(jpeg)/pic3721469.jpg"},{"bggId":"233949","name":"EverSquad","description":"Description from the designer:&#10;&#10;The First Game in the EverSquad Series follows 4 unlikely heroes attempting to save their city, New Meepleton, from an alien invasion brought about by a 5th grader's science project gone wrong.&#10;&#10;EverSquad is a solitaire game of Area Control with variable character powers, and a simple point-buy-based dice-combat system, played in turns of 3 repeated phases.&#10;&#10;Spawn Phase - Where new alien threats are added to the 6 different sectors of the modular board.&#10;&#10;Heroic Action Phase - Where the heroes are activated in succession, taking the fight to the alien threat.&#10;&#10;Alien Attack Phase - Where each of the 4 unique alien types attacks your heroes.&#10;&#10;EverSquad also comes with 4 hero-based mini missions to help players learn the game.&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":30,"maxPlayTime":45,"minAge":13,"categoriesAndMechanics":["Adventure","Science Fiction","Wargame","Area Majority / Influence","Dice Rolling","Grid Movement","Modular Board","Solo / Solitaire Game","Variable Player Powers"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/3fTXG3QrsWXkeQA31RctRQ__thumb/img/WUPQn0VWAmKMIrERckPw5nPXp-o=/fit-in/200x150/filters:strip_icc()/pic3730023.png","urlImage":"https://cf.geekdo-images.com/3fTXG3QrsWXkeQA31RctRQ__original/img/jyY8iYGLji1lBNVJ1DDm1l5RTfA=/0x0/filters:format(png)/pic3730023.png"},{"bggId":"233964","name":"Kaalu","description":"Description from the designer:&#10;&#10;Kaalu is an abstract strategy game about balance.&#10;&#10;The game consists of 63 stones -- 21 in each of two player colors (referred to as black and white), and a third neutral color.  At the start of the game, seven piles are placed on the surface, each consisting of three neutral stones, and two of each player colors, for a total of seven stones in each pile, with each player maintaining the remaining seven stones in their color in front of them to form their stock.&#10;&#10;Play consists of players taking alternating turns starting with black.  Each move is either the placement of a stone from their stock into a pile on the board, or moving any number of neutral stones and/or stones of their color from one pile to another, in order to create a number piles with 'primacy' in their player color.  There are a few small restrictions on moves that can be used by cunning players to strategically limit their opponent's viable options.  The first player to reach the target number of piles with primacy in their color wins.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Abstract Strategy","Area Majority / Influence","Pick-up and Deliver"],"rating":0,"complexity":0},{"bggId":"233986","name":"Elgom: Master Of The Elements","description":"Description from the designer:&#10;&#10;2-6 player card game which was inspired by poker, chess and pokemon.  In Elgom - MOTE players are trying to draw special cards from the shared deck and with their wits overcome opponents to become MASTER OF THE ELEMENTS.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":15,"maxPlayTime":60,"minAge":8,"categoriesAndMechanics":["Card Game","Fantasy","Party Game","Word Game","Hand Management","Memory","Player Elimination","Rock-Paper-Scissors"],"rating":0,"complexity":0},{"bggId":"233988","name":"Into the Dark","description":"Description from the designer:&#10;&#10;Into the dark is the third part of a series of solitaire games that use a very simple core concept &ndash; travelling from point a to point b &ndash; to explore 3dimensional spaces in which those journeys take place.&#10;&#10;After &quot;layers behind each other&quot; (into the woods) and &quot;holes on top of each other&quot; (Infiltrate: into the bear cave) now the shadows cast by 3dimensional scenery influence the movement possibilities on the board. &#10;Therefore the game that has to be played by the light of a single candle.&#10;&#10;what it is about: &#10;In this game you will enter a strange land to find a certain secret site and hopefully return to the exit. &#10;To find out where this site is, you will have to venture &quot;into the dark&quot; - which in this game is the bottom of the board. &#10;Here you can find information about the possible secret sites to visit and how that strange land will react to you entering them.&#10;&#10;Apart from you there is one local inhabitant roaming the land. &#10;It will try to reach you. If it does the game is over.&#10;&#10;How it works: &#10;The land is a landscape of dark (shadow) and light (no shadow) spaces. &#10;You can move freely as long as you do not use a dark connection (dotted line between spaces in shadow) or enter a dark space. &#10;In the last case you would become scared and have to add a despair cube to your cup of action cubes.&#10;&#10;These cubes are drawn during the game and placed onto an action display. &#10;9 cubes arranged into 3 by 3 grid define what might happen:&#10;Each round you will choose one column or row of cubes in that display. The cubes chosen will define whose turn it is: Yours (white cube), a tower&acute;s (yellow cube) or the Inhabitant&acute;s (black cube). &#10;In your turns you can either move from light space to light space or modify the board by pushing towers to the left or right. &#10;This will change the distribution of shadows on the board an through that your movement possibilities.&#10;&#10;3 x 6 &quot;end game rule tokens&quot; provide 216  possible different end game scenarios you will have to prepare for in the first half of the game.&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":20,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Adventure","Maze","Print & Play","Chit-Pull System","Modular Board","Pattern Recognition","Point to Point Movement","Variable Phase Order"],"rating":3.25,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/axGhEBdhrZuedUgkPAeByw__thumb/img/ZHmSSWwyp_VFNXCnA0F7_MKeuNA=/fit-in/200x150/filters:strip_icc()/pic3725925.jpg","urlImage":"https://cf.geekdo-images.com/axGhEBdhrZuedUgkPAeByw__original/img/A1T2ksRoxUkleNYnT_IKeKoReXA=/0x0/filters:format(jpeg)/pic3725925.jpg"},{"bggId":"233990","name":"Vanagard","description":"Vanagard is a collaborative story telling game that utilizes some role-playing and board-game elements. At its core, it's a game of exploration, teamwork and adventure.&#10;&#10;2-6 players will take turns revealing story cards and weaving a continuous story that will take their Vanfolk on an unforgettable adventure. While one player weaves a tale inspired by the story card, the others will play their Vanfolk, overcoming the challenges presented. Each player at the table will get a chance to reveal a story card and will get to spin their portion of the story. If you like the stories of Narnia and Red Wall, this game is for you.&#10;&#10;The simple core mechanics ensure that Vanagard is playable by a wide range of player, from age 7 to 77. There are 6 talents in the game, and they appear on both Nature cards and Talent cards. These talents are used to overcome the challenges presented in the scene. Runes are drawn to set type and difficulty of the challenge.&#10;&#10;Players may create their Vanfolk characters as they play, ensuring that you can jump right into the action from the moment you open up the box.&#10;&#10;EXTEND the game with new card decks. As the Vanfolk increase their level, add-on decks present a natural evolution to the rules. These add-on decks include magic items (relics), spells, profession cards and other goodies that evolve the Vanfolk as they embark on a series of adventures.&#10;&#10;Add-on decks will also include new tools for the story-teller, in the form of challenge decks, story plots and many more interesting features. All of these are optional add-ons allowing you to tailor the game experience to your personal taste.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":90,"minAge":7,"categoriesAndMechanics":["Adventure","Animals","Children's Game","Exploration","Mythology","Cooperative Game","Deck, Bag, and Pool Building","Modular Board","Role Playing","Storytelling"],"rating":3.22222,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/fwPSD-M5WkGI1IycscPkow__thumb/img/rNmAtLbU3J_trrvpTd5cFQDMePA=/fit-in/200x150/filters:strip_icc()/pic3715421.jpg","urlImage":"https://cf.geekdo-images.com/fwPSD-M5WkGI1IycscPkow__original/img/OasTo_OnCf-0WIy-pSKfWD35z_s=/0x0/filters:format(jpeg)/pic3715421.jpg"},{"bggId":"233991","name":"Microtopia","description":"Description from the designer:&#10;&#10;Microtopia is a round-based board and card game that has players controlling their own colony of bugs; all competing to collect the most resources from a rotating selection of habitat tiles by the end of the game. Players can spawn a variety of bugs for the purposes of collecting resources, hunting opponents bugs, or protecting their own hive.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Abstract Strategy","Animals","Educational","Environmental","Farming","Area Majority / Influence","Chit-Pull System","Modular Board","Variable Phase Order"],"rating":0,"complexity":0},{"bggId":"233995","name":"What's the Time, Mr. Wolf?","description":"Two ways to practice how to translate written and digital time into analogue time.&#10;&#10;Set Up: For inexperienced players, each take an animal piece and a matching player board with empty spaces face up. Each player places their piece on the matching spot on the woodland board. Spread the time tiles with the written and digital time face up. Put the big analogue clock within reach.&#10;&#10;Play: Each player in turn rolls the die, moving the number of spaces clockwise around the track. If you land on a clock with a question mark, everyone calls out 'What's the time Mr. Wolf?', and you pick up a tile. Read the phrase and digital clock, then move the hands on the big analogue clock to represent what was read on the tile. Turn over the tile to the analogue image, if it matches the big clock, place the tile on one of your player board spaces. If the image and analogue clock does not match, return the tile back to the pile. In both cases it is the next players turn, going clockwise.&#10;&#10;If you land on the wolf picture, 'feed' one of your clock tiles on your player board to Mr. Wolf, if you have one. Again it will be the next players turn.&#10;&#10;Continue until one player has filled in their player board (if you run out of tiles to draw, return the tiles from behind Mr. Wolf).&#10;&#10;Second way to play if experienced is to play with only the player boards showing analogue clock faces. Set up is only making a stack with the tiles, again with the written and digital time face up.&#10;&#10;Each player in turn draws the top tile to see if it will match any of the analogue times showing on their board. Turn over the tile to see if they match, if so place it on the matching image on your board, if not return it with written and digital time face up. In both cases play passes to the left.&#10;&#10;Continue until one player has filled in their board.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":5,"categoriesAndMechanics":["Animals","Children's Game","Educational","Math","Memory","Dice Rolling","Memory"],"rating":2.77143,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/AVVFbx8_rT93GT2ef37tHQ__thumb/img/oMyjzbSSSAna1Fobj2-camL2740=/fit-in/200x150/filters:strip_icc()/pic3725290.jpg","urlImage":"https://cf.geekdo-images.com/AVVFbx8_rT93GT2ef37tHQ__original/img/pkkk8QK7XIVfO7Sigk3VKkIsnyU=/0x0/filters:format(jpeg)/pic3725290.jpg"},{"bggId":"234010","name":"Ars Combinatoria","description":"Ars Combinatoria is a collection of five games designed around the themes of time and human interaction.&#10;&#10;&#10;         &#230;&#153;&#130;&#227;&#129;&#174;&#231;&#165;&#173;&#229;&#163;&#135; (Toki no Saidan)&#10;             Altar Of Time - manipulate your schedule to keep it 24 hours long, and increase your hand value to win.&#10;        &#10;         &#229;&#185;&#184;&#227;&#129;&#155;&#227;&#129;&#170;&#230;&#153;&#130;&#233;&#150;&#147; (Shiawase na Jikan)&#10;             Time Of Happiness - think of good or very good things in your past, present and future, according to cards you hold. The other players question you and win if they choose the correct cards you hold.&#10;        &#10;         &#229;&#134;&#141;&#228;&#188;&#154;&#227;&#129;&#174;&#231;&#180;&#132;&#230;&#157;&#159; (Saikai no Yakusoku)&#10;             Promise Of Reunion - seal a promise to meet again at a time and place. The players that keep the promise are the winners.&#10;        &#10;         &#233;&#129;&#139;&#229;&#145;&#189;&#227;&#129;&#174;&#228;&#186;&#186; (Unmei no Hito)&#10;             Soulmates Destiny - Get to 4 of a kind in your hand by using another player's revealed hand.&#10;        &#10;         &#231;&#167;&#152;&#229;&#175;&#134;&#227;&#129;&#174;&#227;&#130;&#181;&#227;&#130;&#164;&#227;&#131;&#179; (Himitsu no Sain)&#10;             Secret Signs - a partnership game with players using secret signals to alter their hand value to be 30.&#10;        &#10;    &#10;&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":10,"maxPlayTime":1576800,"minAge":0,"categoriesAndMechanics":["Card Game","Party Game","Cooperative Game"],"rating":3.083335,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/uNsZKhXFyeMYwfhesano1g__thumb/img/FynptptUN4hI_5Q6G1TZ96EXWm8=/fit-in/200x150/filters:strip_icc()/pic3709789.jpg","urlImage":"https://cf.geekdo-images.com/uNsZKhXFyeMYwfhesano1g__original/img/kiJfM5ho0Om3XBa6Ut4BVm-JWkw=/0x0/filters:format(jpeg)/pic3709789.jpg"},{"bggId":"234011","name":"Wing Spirits","description":"Wing Spirits (&#227;&#130;&#166;&#227;&#130;&#164;&#227;&#131;&#179;&#227;&#130;&#176;&#227;&#130;&#185;&#227;&#131;&#148;&#227;&#131;&#170;&#227;&#131;&#131;&#227;&#131;&#132;) is an action-packed tabletop game with five different rulesets for you to enjoy!&#10;&#10;Burst &#227;&#131;&#187;&#227;&#131;&#187;&#227;&#131;&#187;&#227;&#131;&#187;A real-time action game in which players compete to knock as many coins as possible into their opponent&rsquo;s area within the given time limit.&#10;Tower Battle&#227;&#131;&#187;&#227;&#131;&#187;&#227;&#131;&#187;&#227;&#131;&#187;A thrilling competition in which players battle to collect coins from the tower without destroying it.&#10;Chicken&#227;&#131;&#187;&#227;&#131;&#187;A game of chicken in which players compete to see how far they can backspin a ping-pong ball within the boundaries of the game area. &#10;Dare&#227;&#131;&#187;&#227;&#131;&#187;A party game spin-off of Chicken. Instead of competing for coins, players must complete dares.&#10;Challenge&#227;&#131;&#187;&#227;&#131;&#187;&#227;&#131;&#187;&#227;&#131;&#187;A golf-like game in which players attempt to launch ping-pong balls into a set goal.&#10;&#10;There are unlimited ways to spin a ping-pong ball. Come up with creative new ways to play this game in addition to the five rulesets described above!&#10;&#10;Note: Do not throw the ping-pong balls while playing this game. There are many ways to shoot the ball, such as by placing your fingers on top of it and pressing down slightly to launch it forward.&#10;&#10;---&#10;&darr;First Edition text&darr;&#10;Wing Spirits (&#227;&#130;&#166;&#227;&#130;&#164;&#227;&#131;&#179;&#227;&#130;&#176;&#227;&#130;&#185;&#227;&#131;&#148;&#227;&#131;&#170;&#227;&#131;&#131;&#227;&#131;&#132;) is a dexterity game of chicken in which players attempt to place backspin on a ping-pong ball so that they can shoot it across the table deep into their opponent's territory before having the ball return. The deeper a player goes, the more they can score &mdash; but hitting the back line could prove fatal!&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":1,"maxPlayTime":15,"minAge":8,"categoriesAndMechanics":["Action / Dexterity","Exploration"],"rating":2.871,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/P8lwrwoteQqHuy8xfgbMFg__thumb/img/dF-mkiLsWbxvlJk31UJcowaoIVg=/fit-in/200x150/filters:strip_icc()/pic4327301.png","urlImage":"https://cf.geekdo-images.com/P8lwrwoteQqHuy8xfgbMFg__original/img/ngIEHTo8-GbMt8K58oPxWHJsIp4=/0x0/filters:format(png)/pic4327301.png"},{"bggId":"234012","name":"Black Sheep","description":"Black Sheep is a fast family card game in which players attempt to rescue all three members of the farmer's family. Tied closely with the nursery rhyme, this game is very quick and easy to learn.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":30,"minAge":6,"categoriesAndMechanics":["Card Game","Children's Game","Hand Management"],"rating":2.75,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/arqgktr3fiDRzqih6m65tA__thumb/img/ng3wOQTRKBIq_6CTri4y9BJEOsY=/fit-in/200x150/filters:strip_icc()/pic3711059.jpg","urlImage":"https://cf.geekdo-images.com/arqgktr3fiDRzqih6m65tA__original/img/qOg3Acqz0cHSrTyay8zKSAiCKdI=/0x0/filters:format(jpeg)/pic3711059.jpg"},{"bggId":"234013","name":"Weeeooo Weeeooo","description":"Description from the publisher:&#10;&#10;Small childrens game, where you play a fireman on a mission. Rescue cats with a ladder, kill fires with water or use the boat to rescue people from the water.&#10;However... Your firetruck isn't big enough to take all the equipment with you. Choose wisely and add a little luck.&#10;&#10;Competitive push your luck game for the youngest kids, 4 and up.&#10;Easy rules, short rounds and with components that invite for some free role playing as well.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":20,"maxPlayTime":20,"minAge":4,"categoriesAndMechanics":["Children's Game","Push Your Luck"],"rating":2.1,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/Sx2cVhP05BMx5UEjr6yGRA__thumb/img/GitAY7yaDuO_KOsV10q_NJNptI8=/fit-in/200x150/filters:strip_icc()/pic4044133.jpg","urlImage":"https://cf.geekdo-images.com/Sx2cVhP05BMx5UEjr6yGRA__original/img/Kl3agOJf1jX6UO5HzLNE-MNKQag=/0x0/filters:format(jpeg)/pic4044133.jpg"},{"bggId":"234014","name":"Treasures of the Seven Seas","description":"Description from the publisher:&#10;&#10;Treasures have been scattered over lands across the seven seas. Time has come to pick them up, but where to go? Other pirates have the maps to your treasures, as you in return have theirs...&#10;In a frantic race to be fast and clever and make use of each others' boats, you try to outrun the other pirates and find your treasures first. &#10;But be careful, a tornado might spoil your plans and move your boat...&#10;&#10;A competitive game for 2-4 players&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":30,"minAge":6,"categoriesAndMechanics":["Pirates"],"rating":5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/a8zCw2g4CfTe5DSJVMmgFQ__thumb/img/-4KZ1NuDWfPIIiQbTJ7rQFngslA=/fit-in/200x150/filters:strip_icc()/pic3756069.jpg","urlImage":"https://cf.geekdo-images.com/a8zCw2g4CfTe5DSJVMmgFQ__original/img/Feu4a8LmNVrMNjDzL-RLFgxHIIM=/0x0/filters:format(jpeg)/pic3756069.jpg"},{"bggId":"234034","name":"Going Places in Africa and South America","description":"Description from the publisher:&#10;&#10;Explore Africa and South America!&#10;&#10;Visit 76 cities in 52 countries and explore 8 points of interest across the continents.&#10;&#10;Each player receives one Destination card to determine their starting position, or hometown. Another 12 Destination cards are then dealt to each player. The goal is to plan a round trip from your hometown via the 12 destinations. The first person to complete a round trip wins!&#10;&#10;To aid the traveler, train stations, airports and harbors are available as a quick travel option if a player has a corresponding Compass card. The Compass cards can help or stall your trip in a number of ways, including changing the outcome of the game. A comfortable lead can change into a frenzied contest!&#10;&#10;Designed for 2-4 players and takes you on a different path around the continents each round!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":10,"maxPlayTime":20,"minAge":8,"categoriesAndMechanics":["Educational","Racing","Travel","Dice Rolling"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/7_daNaae4-4OQPxIX6SUjA__thumb/img/EjG69ijK6h_HbcLKL7vHgqKjYwg=/fit-in/200x150/filters:strip_icc()/pic3749960.png","urlImage":"https://cf.geekdo-images.com/7_daNaae4-4OQPxIX6SUjA__original/img/_VaE8fVxQMFyEQZ1JY_5nYjOr_0=/0x0/filters:format(png)/pic3749960.png"}]