[{"bggId":"224517","name":"Brass: Birmingham","description":"Brass: Birmingham is an economic strategy game sequel to Martin Wallace' 2007 masterpiece, Brass. Brass: Birmingham tells the story of competing entrepreneurs in Birmingham during the industrial revolution, between the years of 1770-1870.&#10;&#10;It offers a very different story arc and experience from its predecessor. As in its predecessor, you must develop, build, and establish your industries and network, in an effort to exploit low or high market demands. The game is played over two halves: the canal era (years 1770-1830) and the rail era (years 1830-1870). To win the game, score the most VPs. VPs are counted at the end of each half for the canals, rails and established (flipped) industry tiles.&#10;&#10;Each round, players take turns according to the turn order track, receiving two actions to perform any of the following actions (found in the original game):&#10;&#10;1) Build - Pay required resources and place an industry tile.&#10;2) Network - Add a rail / canal link, expanding your network.&#10;3) Develop - Increase the VP value of an industry.&#10;4) Sell - Sell your cotton, manufactured goods and pottery.&#10;5) Loan - Take a &pound;30 loan and reduce your income.&#10;&#10;Brass: Birmingham also features a new sixth action:&#10;&#10;6) Scout - Discard three cards and take a wild location and wild industry card. (This action replaces Double Action Build in original Brass.)&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Age of Reason","Economic","Industry / Manufacturing","Post-Napoleonic","Trains","Transportation","Hand Management","Income","Loans","Market","Network and Route Building","Tags","Tech Trees / Tech Tracks","Turn Order: Stat-Based","Variable Set-up"],"rating":4.300065,"complexity":3.8841,"urlThumb":"https://cf.geekdo-images.com/x3zxjr-Vw5iU4yDPg70Jgw__thumb/img/o18rjEemoWaVru9Y2TyPwuIaRfE=/fit-in/200x150/filters:strip_icc()/pic3490053.jpg","urlImage":"https://cf.geekdo-images.com/x3zxjr-Vw5iU4yDPg70Jgw__original/img/FpyxH41Y6_ROoePAilPNEhXnzO8=/0x0/filters:format(jpeg)/pic3490053.jpg"},{"bggId":"161936","name":"Pandemic Legacy: Season 1","description":"Pandemic Legacy is a co-operative campaign game, with an overarching story-arc played through 12-24 sessions, depending on how well your group does at the game. At the beginning, the game starts very similar to basic Pandemic, in which your team of disease-fighting specialists races against the clock to travel around the world, treating disease hotspots while researching cures for each of four plagues before they get out of hand.&#10;&#10;During a player's turn, they have four actions available, with which they may travel around in the world in various ways (sometimes needing to discard a card), build structures like research stations, treat diseases (removing one cube from the board; if all cubes of a color have been removed, the disease has been eradicated), trade cards with other players, or find a cure for a disease (requiring five cards of the same color to be discarded while at a research station). Each player has a unique role with special abilities to help them at these actions.&#10;&#10;After a player has taken their actions, they draw two cards. These cards can include epidemic cards, which will place new disease cubes on the board, and can lead to an outbreak, spreading disease cubes even further. Outbreaks additionally increase the panic level of a city, making that city more expensive to travel to.&#10;&#10;Each month in the game, you have two chances to achieve that month's objectives. If you succeed, you win and immediately move on to the next month. If you fail, you have a second chance, with more funding for beneficial event cards.&#10;&#10;During the campaign, new rules and components will be introduced. These will sometimes require you to permanently alter the components of the game; this includes writing on cards, ripping up cards, and placing permanent stickers on components. Your characters can gain new skills, or detrimental effects. A character can even be lost entirely, at which point it's no longer available for play.&#10;&#10;Part of the Pandemic series&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":60,"minAge":13,"categoriesAndMechanics":["Environmental","Medical","Action Points","Cooperative Game","Hand Management","Legacy Game","Point to Point Movement","Scenario / Mission / Campaign Game","Set Collection","Tags","Trading","Variable Player Powers"],"rating":4.265315,"complexity":2.8323,"urlThumb":"https://cf.geekdo-images.com/-Qer2BBPG7qGGDu6KcVDIw__thumb/img/NQQcjS31TO0DE246N9rpt0hd9eo=/fit-in/200x150/filters:strip_icc()/pic2452831.png","urlImage":"https://cf.geekdo-images.com/-Qer2BBPG7qGGDu6KcVDIw__original/img/PlzAH7swN1nsFxOXbfUvE3TkE5w=/0x0/filters:format(png)/pic2452831.png"},{"bggId":"174430","name":"Gloomhaven","description":"Gloomhaven  is a game of Euro-inspired tactical combat in a persistent world of shifting motives. Players will take on the role of a wandering adventurer with their own special set of skills and their own reasons for traveling to this dark corner of the world. Players must work together out of necessity to clear out menacing dungeons and forgotten ruins. In the process, they will enhance their abilities with experience and loot, discover new locations to explore and plunder, and expand an ever-branching story fueled by the decisions they make.&#10;&#10;This is a game with a persistent and changing world that is ideally played over many game sessions. After a scenario, players will make decisions on what to do, which will determine how the story continues, kind of like a &ldquo;Choose Your Own Adventure&rdquo; book. Playing through a scenario is a cooperative affair where players will fight against automated monsters using an innovative card system to determine the order of play and what a player does on their turn.&#10;&#10;Each turn, a player chooses two cards to play out of their hand. The number on the top card determines their initiative for the round. Each card also has a top and bottom power, and when it is a player&rsquo;s turn in the initiative order, they determine whether to use the top power of one card and the bottom power of the other, or vice-versa. Players must be careful, though, because over time they will permanently lose cards from their hands. If they take too long to clear a dungeon, they may end up exhausted and be forced to retreat.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Adventure","Exploration","Fantasy","Fighting","Miniatures","Action Queue","Action Retrieval","Campaign / Battle Card Driven","Card Play Conflict Resolution","Communication Limits","Cooperative Game","Critical Hits and Failures","Deck Construction","Grid Movement","Hand Management","Hexagon Grid","Legacy Game","Line of Sight","Modular Board","Multi-Use Cards","Once-Per-Game Abilities","Role Playing","Scenario / Mission / Campaign Game","Simultaneous Action Selection","Solo / Solitaire Game","Tags","Variable Player Powers"],"rating":4.298935,"complexity":3.907,"urlThumb":"https://cf.geekdo-images.com/sZYp_3BTDGjh2unaZfZmuA__thumb/img/veqFeP4d_3zNhFc3GNBkV95rBEQ=/fit-in/200x150/filters:strip_icc()/pic2437871.jpg","urlImage":"https://cf.geekdo-images.com/sZYp_3BTDGjh2unaZfZmuA__original/img/7d-lj5Gd1e8PFnD97LYFah2c45M=/0x0/filters:format(jpeg)/pic2437871.jpg"},{"bggId":"342942","name":"Ark Nova","description":"In Ark Nova, you will plan and design a modern, scientifically managed zoo. With the ultimate goal of owning the most successful zoological establishment, you will build enclosures, accommodate animals, and support conservation projects all over the world. Specialists and unique buildings will help you in achieving this goal.&#10;&#10;Each player has a set of five action cards to manage their gameplay, and the power of an action is determined by the slot the card currently occupies. The cards in question are:&#10;&#10;&#10;    CARDS: Allows you to gain new zoo cards (animals, sponsors, and conservation project cards).&#10;    BUILD: Allows you to build standard or special enclosures, kiosks, and pavilions.&#10;    ANIMALS: Allows you to accommodate animals in your zoo.&#10;    ASSOCIATION: Allows your association workers to carry out different tasks.&#10;    SPONSORS: Allows you to play a sponsor card in your zoo or to raise money.&#10;&#10;&#10;255 cards featuring animals, specialists, special enclosures, and conservation projects, each with a special ability, are at the heart of Ark Nova. Use them to increase the appeal and scientific reputation of your zoo and collect conservation points.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":90,"maxPlayTime":150,"minAge":14,"categoriesAndMechanics":["Animals","Economic","Environmental","End Game Bonuses","Hand Management","Hexagon Grid","Income","Increase Value of Unchosen Resources","Open Drafting","Set Collection","Solo / Solitaire Game","Tags","Tile Placement","Variable Player Powers","Variable Set-up"],"rating":4.269105,"complexity":3.7485,"urlThumb":"https://cf.geekdo-images.com/SoU8p28Sk1s8MSvoM4N8pQ__thumb/img/4KuHNTWSMPf8vTNDKSRMMI3oOv8=/fit-in/200x150/filters:strip_icc()/pic6293412.jpg","urlImage":"https://cf.geekdo-images.com/SoU8p28Sk1s8MSvoM4N8pQ__original/img/g4S18szTdrXCdIwVKzMKrZrYAcM=/0x0/filters:format(jpeg)/pic6293412.jpg"},{"bggId":"233078","name":"Twilight Imperium: Fourth Edition","description":"Twilight Imperium (Fourth Edition) is a game of galactic conquest in which three to six players take on the role of one of seventeen factions vying for galactic domination through military might, political maneuvering, and economic bargaining. Every faction offers a completely different play experience, from the wormhole-hopping Ghosts of Creuss to the Emirates of Hacan, masters of trade and economics. These seventeen races are offered many paths to victory, but only one may sit upon the throne of Mecatol Rex as the new masters of the galaxy.&#10;&#10;No two games of Twilight Imperium are ever identical. At the start of each galactic age, the game board is uniquely and strategically constructed using 51 galaxy tiles that feature everything from lush new planets and supernovas to asteroid fields and gravity rifts. Players are dealt a hand of these tiles and take turns creating the galaxy around Mecatol Rex, the capital planet seated in the center of the board. An ion storm may block your race from progressing through the galaxy while a fortuitously placed gravity rift may protect you from your closest foes. The galaxy is yours to both craft and dominate.&#10;&#10;A round of Twilight Imperium begins with players selecting one of eight strategy cards that both determine player order and give their owner a unique strategic action for that round. These may do anything from providing additional command tokens to allowing a player to control trade throughout the galaxy. After these roles are selected, players take turns moving their fleets from system to system, claiming new planets for their empire, and engaging in warfare and trade with other factions. At the end of a turn, players gather in a grand council to pass new laws and agendas, shaking up the game in unpredictable ways.&#10;&#10;After every player has passed their turn, players move up the victory track by checking to see whether they have completed any objectives throughout the turn and scoring them. Objectives are determined by setting up ten public objective cards at the start of each game, then gradually revealing them with every round. Every player also chooses between two random secret objectives at the start of the game, providing victory points achievable only by the holder of that objective. These objectives can be anything from researching new technologies to taking your neighbor's home system. At the end of every turn, a player can claim one public objective and one secret objective. As play continues, more of these objectives are revealed and more secret objectives are dealt out, giving players dynamically changing goals throughout the game. Play continues until a player reaches ten victory points.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":3,"maxPlayers":6,"minPlayTime":240,"maxPlayTime":480,"minAge":14,"categoriesAndMechanics":["Civilization","Economic","Exploration","Negotiation","Political","Science Fiction","Space Exploration","Wargame","Action Drafting","Area-Impulse","Dice Rolling","Follow","Grid Movement","Hexagon Grid","Increase Value of Unchosen Resources","King of the Hill","Modular Board","Race","Tech Trees / Tech Tracks","Trading","Variable Phase Order","Variable Player Powers","Variable Set-up","Voting"],"rating":4.302945,"complexity":4.3172,"urlThumb":"https://cf.geekdo-images.com/_Ppn5lssO5OaildSE-FgFA__thumb/img/lfEukJE0JsoZZObaF9K9YnFp62E=/fit-in/200x150/filters:strip_icc()/pic3727516.jpg","urlImage":"https://cf.geekdo-images.com/_Ppn5lssO5OaildSE-FgFA__original/img/kVpZ0Maa_LeQGWxOqsYKP3N4KUY=/0x0/filters:format(jpeg)/pic3727516.jpg"},{"bggId":"316554","name":"Dune: Imperium","description":"Dune: Imperium is a game that uses deck-building to add a hidden-information angle to traditional worker placement. It finds inspiration in elements and characters from the Dune legacy, both the new film from Legendary Pictures and the seminal literary series from Frank Herbert, Brian Herbert, and Kevin J. Anderson.&#10;&#10;As a leader of one of the Great Houses of the Landsraad, raise your banner and marshal your forces and spies. War is coming, and at the center of the conflict is Arrakis &ndash; Dune, the desert planet.&#10;&#10;You start with a unique leader card, as well as a deck identical to those of your opponents.  As you acquire cards and build your deck, your choices will define your strengths and weaknesses. Cards allow you to send your Agents to certain spaces on the game board, so how your deck evolves affects your strategy. You might become more powerful militarily, able to deploy more troops than your opponents. Or you might acquire cards that give you an edge with the four political factions represented in the game: the Emperor, the Spacing Guild, the Bene Gesserit, and the Fremen.&#10;&#10;Unlike many deck-building games, you don&rsquo;t play your entire hand in one turn. Instead, you draw a hand of cards at the start of every round and alternate with other players, taking one Agent turn at a time (playing one card to send one of your Agents to the game board). When it&rsquo;s your turn and you have no more Agents to place, you&rsquo;ll take a Reveal turn, revealing the rest of your cards, which will provide Persuasion and Swords. Persuasion is used to acquire more cards, and Swords help your troops fight for the current round&rsquo;s rewards as shown on the revealed Conflict card.&#10;&#10;Defeat your rivals in combat, shrewdly navigate the political factions, and acquire precious cards. The Spice must flow to lead your House to victory!&#10;&#10;Some important links: The Official FAQ, the Unofficial FAQ, and an Automa (solo and 2p) Overview&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Movies / TV / Radio theme","Novel-based","Political","Science Fiction","Card Play Conflict Resolution","Deck, Bag, and Pool Building","Delayed Purchase","Force Commitment","Increase Value of Unchosen Resources","Multi-Use Cards","Open Drafting","Race","Solo / Solitaire Game","Tags","Take That","Turn Order: Progressive","Variable Player Powers","Worker Placement"],"rating":4.21586,"complexity":3.0432,"urlThumb":"https://cf.geekdo-images.com/PhjygpWSo-0labGrPBMyyg__thumb/img/JGgY-nBmkyB8WRp8vcoBLlNMQ5U=/fit-in/200x150/filters:strip_icc()/pic5666597.jpg","urlImage":"https://cf.geekdo-images.com/PhjygpWSo-0labGrPBMyyg__original/img/mZzaBAEEJpMlHWWmC0R6Su0OibQ=/0x0/filters:format(jpeg)/pic5666597.jpg"},{"bggId":"167791","name":"Terraforming Mars","description":"In the 2400s, mankind begins to terraform the planet Mars. Giant corporations, sponsored by the World Government on Earth, initiate huge projects to raise the temperature, the oxygen level, and the ocean coverage until the environment is habitable. In Terraforming Mars, you play one of those corporations and work together in the terraforming process, but compete for getting victory points that are awarded not only for your contribution to the terraforming, but also for advancing human infrastructure throughout the solar system, and doing other commendable things.&#10;&#10;The players acquire unique project cards (from over two hundred different ones) by buying them to their hand. The cards can give you immediate bonuses, as well as increasing your production of different resources. Many cards also have requirements and they become playable when the temperature, oxygen, or ocean coverage increases enough. Buying cards is costly, so there is a balance between buying cards and actually playing them. Standard Projects are always available to complement your cards. Your basic income, as well as your basic score, is based on your Terraform Rating. However, your income is complemented with your production, and you also get VPs from many other sources.&#10;&#10;Each player keeps track of their production and resources on their player boards, and the game uses six types of resources: MegaCredits, Steel, Titanium, Plants, Energy, and Heat. On the game board, you compete for the best places for your city tiles, ocean tiles, and greenery tiles. You also compete for different Milestones and Awards worth many VPs. Each round is called a generation and consists of the following phases:&#10;&#10;1) Player order shifts clockwise.&#10;2) Research phase: All players buy cards from four privately drawn.&#10;3) Action phase: Players take turns doing 1-2 actions from these options: Playing a card, claiming a Milestone, funding an Award, using a Standard project, converting plant into greenery tiles (and raising oxygen), converting heat into a temperature raise, and using the action of a card in play. The turn continues around the table (sometimes several laps) until all players have passed.&#10;4) Production phase: Players get resources according to their terraform rating and production parameters.&#10;&#10;When the three global parameters (temperature, oxygen, ocean) have all reached their goal, the terraforming is complete, and the game ends after that generation. Count your Terraform Rating and other VPs to determine the winning corporation!&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":120,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Economic","Environmental","Industry / Manufacturing","Science Fiction","Space Exploration","Territory Building","Closed Drafting","Contracts","Enclosure","End Game Bonuses","Hand Management","Hexagon Grid","Income","Set Collection","Solo / Solitaire Game","Tags","Take That","Tech Trees / Tech Tracks","Tile Placement","Turn Order: Progressive","Variable Player Powers","Variable Set-up","Victory Points as a Resource"],"rating":4.181745,"complexity":3.2598,"urlThumb":"https://cf.geekdo-images.com/wg9oOLcsKvDesSUdZQ4rxw__thumb/img/BTxqxgYay5tHJfVoJ2NF5g43_gA=/fit-in/200x150/filters:strip_icc()/pic3536616.jpg","urlImage":"https://cf.geekdo-images.com/wg9oOLcsKvDesSUdZQ4rxw__original/img/thIqWDnH9utKuoKVEUqveDixprI=/0x0/filters:format(jpeg)/pic3536616.jpg"},{"bggId":"115746","name":"War of the Ring: Second Edition","description":"In War of the Ring, one player takes control of the Free Peoples (FP), the other player controls Shadow Armies (SA). Initially, the Free People Nations are reluctant to take arms against Sauron, so they must be attacked by Sauron or persuaded by Gandalf or other Companions, before they start to fight properly: this is represented by the Political Track, which shows if a Nation is ready to fight in the War of the Ring or not.&#10;&#10;The game can be won by a military victory, if Sauron conquers a certain number of Free People cities and strongholds or vice versa. But the true hope of the Free Peoples lies with the quest of the Ringbearer: while the armies clash across Middle-earth, the Fellowship of the Ring is trying to get secretly to Mount Doom to destroy the One Ring. Sauron is not aware of the real intention of his enemies but is looking across Middle-earth for the precious Ring, so that the Fellowship is going to face numerous dangers, represented by the rules of The Hunt for the Ring. But the Companions can spur the Free Peoples to the fight against Sauron, so the Free People player must balance the need to protect the Ringbearer from harm, against the attempt to raise a proper defense against the armies of the Shadow, so that they do not overrun Middle-earth before the Ringbearer completes his quest.&#10;&#10;Each game turn revolves around the roll of Action Dice: each die corresponds to an action that a player can do during a turn. Depending on the face rolled on each die, different actions are possible (moving armies, characters, recruiting troops, advancing a Political Track).&#10;&#10;Action Dice can also be used to draw or play Event Cards. Event Cards are played to represent specific events from the story (or events that could possibly have happened) that cannot be portrayed through normal game-play. Each Event Card can also create an unexpected turn in the game, allowing special actions or altering the course of a battle.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":150,"maxPlayTime":180,"minAge":13,"categoriesAndMechanics":["Fantasy","Fighting","Miniatures","Novel-based","Territory Building","Wargame","Action Drafting","Area Majority / Influence","Area Movement","Campaign / Battle Card Driven","Card Play Conflict Resolution","Dice Rolling","Events","Hand Management","Movement Points","Team-Based Game","Variable Set-up"],"rating":4.26814,"complexity":4.2164,"urlThumb":"https://cf.geekdo-images.com/ImPgGag98W6gpV1KV812aA__thumb/img/X-lBBdG4uO6LT0y1vXxCN4jdR4M=/fit-in/200x150/filters:strip_icc()/pic1215633.jpg","urlImage":"https://cf.geekdo-images.com/ImPgGag98W6gpV1KV812aA__original/img/38jB7fN07DwlrGKYAf-J0vsNdgs=/0x0/filters:format(jpeg)/pic1215633.jpg"},{"bggId":"291457","name":"Gloomhaven: Jaws of the Lion","description":"Gloomhaven: Jaws of the Lion is a standalone game that takes place before the events of Gloomhaven. The game includes four new characters &mdash; Valrath Red Guard (tank, crowd control), Inox Hatchet (ranged damage), Human Voidwarden (support, mind-control), and Quatryl Demolitionist (melee damage, obstacle manipulation) &mdash; that can also be used in the original Gloomhaven game.&#10;&#10;The game also includes 16 monster types (including seven new standard monsters and three new bosses) and a new campaign with 25 scenarios that invites the heroes to investigate a case of mysterious disappearances within the city. Is it the work of Vermlings, or is something far more sinister going on?&#10;&#10;Gloomhaven: Jaws of the Lion is aimed at a more casual audience to get people into the gameplay more quickly. All of the hard-to-organize cardboard map tiles have been removed, and instead players will play on the scenario book itself, which features new artwork unique to each scenario. The last barrier to entry &mdash; i.e., learning the game &mdash; has also been lowered through a simplified rule set and a five-scenario tutorial that will ease new players into the experience.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Adventure","Exploration","Fantasy","Fighting","Miniatures","Action Queue","Action Retrieval","Campaign / Battle Card Driven","Communication Limits","Cooperative Game","Critical Hits and Failures","Deck Construction","Grid Movement","Hand Management","Hexagon Grid","Legacy Game","Line of Sight","Multi-Use Cards","Once-Per-Game Abilities","Scenario / Mission / Campaign Game","Simultaneous Action Selection","Solo / Solitaire Game","Variable Player Powers"],"rating":4.22677,"complexity":3.6368,"urlThumb":"https://cf.geekdo-images.com/_HhIdavYW-hid20Iq3hhmg__thumb/img/OMkN_E5eyWrkID_cHCnQEbIixGM=/fit-in/200x150/filters:strip_icc()/pic5055631.jpg","urlImage":"https://cf.geekdo-images.com/_HhIdavYW-hid20Iq3hhmg__original/img/PBzsLRqNKQKJxGnzpb7o3qLWPQM=/0x0/filters:format(jpeg)/pic5055631.jpg"},{"bggId":"187645","name":"Star Wars: Rebellion","description":"Star Wars: Rebellion is a board game of epic conflict between the Galactic Empire and Rebel Alliance for two to four players.&#10;&#10;Experience the Galactic Civil War like never before. In Rebellion, you control the entire Galactic Empire or the fledgling Rebel Alliance. You must command starships, account for troop movements, and rally systems to your cause. Given the differences between the Empire and Rebel Alliance, each side has different win conditions, and you'll need to adjust your play style depending on who you represent:&#10;&#10;     As the Imperial player, you can command legions of Stormtroopers, swarms of TIEs, Star Destroyers, and even the Death Star. You rule the galaxy by fear, relying on the power of your massive military to enforce your will. To win the game, you need to snuff out the budding Rebel Alliance by finding its base and obliterating it. Along the way, you can subjugate worlds or even destroy them.&#10;     As the Rebel player, you can command dozens of troopers, T-47 airspeeders, Corellian corvettes, and fighter squadrons. However, these forces are no match for the Imperial military. In terms of raw strength, you'll find yourself clearly overmatched from the very outset, so you'll need to rally the planets to join your cause and execute targeted military strikes to sabotage Imperial build yards and steal valuable intelligence. To win the Galactic Civil War, you'll need to sway the galaxy's citizens to your cause. If you survive long enough and strengthen your reputation, you inspire the galaxy to a full-scale revolt, and you win.&#10;&#10;&#10;Featuring more than 150 plastic miniatures and two game boards that account for thirty-two of the Star Wars galaxy's most notable systems, Rebellion features a scope that is as large and sweeping as any Star Wars game before it.&#10;&#10;Yet for all its grandiosity, Rebellion remains intensely personal, cinematic, and heroic. As much as your success depends upon the strength of your starships, vehicles, and troops, it depends upon the individual efforts of such notable characters as Leia Organa, Mon Mothma, Grand Moff Tarkin, and Emperor Palpatine. As civil war spreads throughout the galaxy, these leaders are invaluable to your efforts, and the secret missions they attempt will evoke many of the most inspiring moments from the classic trilogy. You might send Luke Skywalker to receive Jedi training on Dagobah or have Darth Vader spring a trap that freezes Han Solo in carbonite!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":180,"maxPlayTime":240,"minAge":14,"categoriesAndMechanics":["Civil War","Miniatures","Movies / TV / Radio theme","Science Fiction","Space Exploration","Wargame","Area Majority / Influence","Area Movement","Area-Impulse","Card Play Conflict Resolution","Contracts","Delayed Purchase","Dice Rolling","Die Icon Resolution","Events","Hand Management","Hidden Movement","Income","Once-Per-Game Abilities","Tags","Take That","Team-Based Game","Variable Player Powers","Variable Set-up","Worker Placement, Different Worker Types"],"rating":4.209445,"complexity":3.7416,"urlThumb":"https://cf.geekdo-images.com/7SrPNGBKg9IIsP4UQpOi8g__thumb/img/gAxzddRVQiRdjZHYFUZ2xc5Jlbw=/fit-in/200x150/filters:strip_icc()/pic4325841.jpg","urlImage":"https://cf.geekdo-images.com/7SrPNGBKg9IIsP4UQpOi8g__original/img/GKueTbkCk2Ramf6ai8mDj-BP6cI=/0x0/filters:format(jpeg)/pic4325841.jpg"},{"bggId":"162886","name":"Spirit Island","description":"In the most distant reaches of the world, magic still exists, embodied by spirits of the land, of the sky, and of every natural thing. As the great powers of Europe stretch their colonial empires further and further, they will inevitably lay claim to a place where spirits still hold power - and when they do, the land itself will fight back alongside the islanders who live there.&#10;&#10;Spirit Island is a complex and thematic cooperative game about defending your island home from colonizing Invaders. Players are different spirits of the land, each with its own unique elemental powers. Every turn, players simultaneously choose which of their power cards to play, paying energy to do so. Using combinations of power cards that match a spirit's elemental affinities can grant free bonus effects. Faster powers take effect immediately, before the Invaders spread and ravage, but other magics are slower, requiring forethought and planning to use effectively. In the Spirit phase, spirits gain energy, and choose how / whether to Grow: to reclaim used power cards, to seek for new power, or to spread presence into new areas of the island.&#10;&#10;The Invaders expand across the island map in a semi-predictable fashion. Each turn they explore into some lands (portions of the island); the next turn, they build in those lands, forming settlements and cities. The turn after that, they ravage there, bringing blight to the land and attacking any native islanders present. The islanders fight back against the Invaders when attacked, and lend the spirits some other aid, but may not always do so exactly as you'd hoped. Some Powers work through the islanders, helping them (eg) drive out the Invaders or clean the land of blight.&#10;&#10;The game escalates as it progresses: spirits spread their presence to new parts of the island and seek out new and more potent powers, while the Invaders step up their colonization efforts. Each turn represents 1-3 years of alternate-history. At game start, winning requires destroying every last settlement and city on the board - but as you frighten the Invaders more and more, victory becomes easier: they'll run away even if some number of settlements or cities remain. Defeat comes if any spirit is destroyed, if the island is overrun by blight, or if the Invader deck is depleted before achieving victory.&#10;&#10;The game includes different adversaries to fight against (eg: a Swedish Mining Colony, or a Remote British Colony). Each changes play in different ways, and offers a different path of difficulty boosts to keep the game challenging as you gain skill.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":90,"maxPlayTime":120,"minAge":13,"categoriesAndMechanics":["Environmental","Fantasy","Fighting","Mythology","Territory Building","Action Retrieval","Area Majority / Influence","Automatic Resource Growth","Campaign / Battle Card Driven","Cooperative Game","Hand Management","Modular Board","Set Collection","Simultaneous Action Selection","Solo / Solitaire Game","Tags","Variable Player Powers","Variable Set-up"],"rating":4.173415,"complexity":4.0652,"urlThumb":"https://cf.geekdo-images.com/kjCm4ZvPjIZxS-mYgSPy1g__thumb/img/aUlIih2_R7P8IYKeyNl2heLQbu8=/fit-in/200x150/filters:strip_icc()/pic7013651.jpg","urlImage":"https://cf.geekdo-images.com/kjCm4ZvPjIZxS-mYgSPy1g__original/img/9uLd9C3XAvInLCLhAoXqKVk56zs=/0x0/filters:format(jpeg)/pic7013651.jpg"},{"bggId":"220308","name":"Gaia Project","description":"Gaia Project is a new game in the line of Terra Mystica. As in the original Terra Mystica, fourteen different factions live on seven different kinds of planets, and each faction is bound to their own home planets, so to develop and grow, they must terraform neighboring planets into their home environments in competition with the other groups. In addition, Gaia planets can be used by all factions for colonization, and Transdimensional planets can be changed into Gaia planets.&#10;&#10;All factions can improve their skills in six different areas of development &mdash; Terraforming, Navigation, Artificial Intelligence, Gaiaforming, Economy, Research &mdash; leading to advanced technology and special bonuses. To do all of that, each group has special skills and abilities.&#10;&#10;The playing area is made of ten sectors, allowing a variable set-up and thus an even bigger replay value than its predecessor Terra Mystica. A two-player game is hosted on seven sectors.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":150,"minAge":12,"categoriesAndMechanics":["Civilization","Economic","Miniatures","Science Fiction","Space Exploration","Territory Building","End Game Bonuses","Hexagon Grid","Income","Modular Board","Network and Route Building","Solo / Solitaire Game","Tags","Tech Trees / Tech Tracks","Turn Order: Pass Order","Variable Player Powers","Variable Set-up","Victory Points as a Resource"],"rating":4.19239,"complexity":4.3938,"urlThumb":"https://cf.geekdo-images.com/hGWFm3hbMlCDsfCsauOQ4g__thumb/img/NNG7Ijyx4evp5gcVReis9i0koas=/fit-in/200x150/filters:strip_icc()/pic5375625.png","urlImage":"https://cf.geekdo-images.com/hGWFm3hbMlCDsfCsauOQ4g__original/img/tjlflQtUPFiTpLpwk1NCVCS29Ic=/0x0/filters:format(png)/pic5375625.png"},{"bggId":"12333","name":"Twilight Struggle","description":"&quot;Now the trumpet summons us again, not as a call to bear arms, though arms we need; not as a call to battle, though embattled we are &ndash; but a call to bear the burden of a long twilight struggle...&quot;&#10;&ndash; John F. Kennedy&#10;&#10;In 1945, unlikely allies toppled Hitler's war machine, while humanity's most devastating weapons forced the Japanese Empire to its knees in a storm of fire. Where once there stood many great powers, there then stood only two. The world had scant months to sigh its collective relief before a new conflict threatened. Unlike the titanic struggles of the preceding decades, this conflict would be waged not primarily by soldiers and tanks, but by spies and politicians, scientists and intellectuals, artists and traitors. Twilight Struggle is a two-player game simulating the forty-five year  dance of intrigue, prestige, and occasional flares of warfare between the Soviet Union and the United States. The entire world is the stage on which these two titans fight to make the world safe for their own ideologies and ways of life. The game begins amidst the ruins of Europe as the two new &quot;superpowers&quot; scramble over the wreckage of the Second World War, and ends in 1989, when only the United States remained standing.&#10;&#10;Twilight Struggle inherits its fundamental systems from the card-driven classics We the People and Hannibal: Rome vs. Carthage. It is a quick-playing, low-complexity game in that tradition. The game map is a world map of the period, whereon players move units and exert influence in attempts to gain allies and control for their superpower. As with GMT's other card-driven games, decision-making is a challenge; how to best use one's cards and units given consistently limited resources?&#10;&#10;Twilight Struggle's Event cards add detail and flavor to the game. They cover a vast array of historical happenings, from the Arab-Israeli conflicts of 1948 and 1967, to Vietnam and the U.S. peace movement, to the Cuban Missile Crisis and other such incidents that brought the world to the brink of nuclear annihilation. Subsystems capture the prestige-laden Space Race as well as nuclear tensions, with the possibility of game-ending nuclear war.&#10;&#10;Components (original edition):&#10;&#10;&#10;     228 full colour counters &#10;     22&quot;x34&quot; full colour map &#10;     103 event cards &#10;     2 six-sided dice&#10;     1 24-page rulebook&#10;     2 full colour player aid cards&#10;&#10;&#10;Components (2009 Deluxe edition and after)&#10;&#10;     260 full colour counters &#10;     22&quot;x34&quot; mounted map with revised graphics&#10;     110 event cards&#10;     2 six-sided dice&#10;     1 24-page rulebook&#10;     2 full colour player aid cards&#10;&#10;&#10;TIME SCALE:     approx. 3-5 years per turn&#10;MAP SCALE:     Point-to-point system&#10;UNIT SCALE:     Influence markers&#10;NUMBER OF PLAYERS:     2&#10;&#10;DESIGNER: Ananda Gupta &amp; Jason Matthews&#10;MAP, CARD, &amp; COUNTER ART: Mark Simonitch&#10;&#10;&#10;A deluxe edition, published in 2009 includes the following changes from the basic game:&#10;&#10;     Mounted map with revised graphics&#10;     Two double-thick counter sheets with 260 counters&#10;     Deck of 110 event cards (increased from 103)&#10;     Revised rules and player aid cards&#10;     Revised at start setup and text change for card #98 Aldrich Ames&#10;&#10;&#10;Upgrade kit for the owners of the previous version includes the following:&#10;&#10;     Mounted Map with revised graphics&#10;     New card decks&#10;     Updated Rules &amp; Charts&#10;&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":120,"maxPlayTime":180,"minAge":13,"categoriesAndMechanics":["Modern Warfare","Political","Wargame","Action/Event","Advantage Token","Area Majority / Influence","Campaign / Battle Card Driven","Dice Rolling","Events","Hand Management","Simulation","Simultaneous Action Selection","Sudden Death Ending","Tug of War","Variable Set-up"],"rating":4.123745,"complexity":3.6075,"urlThumb":"https://cf.geekdo-images.com/pNCiUUphnoeWOYfsWq0kng__thumb/img/p7alNkNy8Avm8UISmhYHCiMz5bE=/fit-in/200x150/filters:strip_icc()/pic3530661.jpg","urlImage":"https://cf.geekdo-images.com/pNCiUUphnoeWOYfsWq0kng__original/img/Iae47UtAd_RXVd5tJ3YzbDHOv4E=/0x0/filters:format(jpeg)/pic3530661.jpg"},{"bggId":"182028","name":"Through the Ages: A New Story of Civilization","description":"Through the Ages: A New Story of Civilization is the new edition of Through the Ages: A Story of Civilization, with many changes small and large to the game's cards over its three ages and extensive changes to how military works.&#10;&#10;Through the Ages is a civilization building game. Each player attempts to build the best civilization through careful resource management, discovering new technologies, electing the right leaders, building wonders and maintaining a strong military. Weakness in any area can be exploited by your opponents. The game takes place throughout the ages beginning in the age of antiquity and ending in the modern age.&#10;&#10;One of the primary mechanisms in TTA is card drafting. Technologies, wonders, and leaders come into play and become easier to draft the longer they are in play. In order to use a technology you will need enough science to discover it, enough food to create a population to man it and enough resources (ore) to build the building to use it. While balancing the resources needed to advance your technology you also need to build a military. Military is built in the same way as civilian buildings. Players that have a weak military will be preyed upon by other players. There is no map in the game so you cannot lose territory, but players with higher military will steal resources, science, kill leaders, take population or culture. It is very difficult to win with a large military, but it is very easy to lose because of a weak one.&#10;&#10;Victory is achieved by the player whose nation has the most culture at the end of the modern age.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":120,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Card Game","Civilization","Economic","Action Points","Auction: Dutch","Auction/Bidding","Events","Income","Open Drafting","Tags","Take That"],"rating":4.14769,"complexity":4.4364,"urlThumb":"https://cf.geekdo-images.com/fVwPntkJKgaEo0rIC0RwpA__thumb/img/31usGlzlBReEFf60bcgbvDTjwCg=/fit-in/200x150/filters:strip_icc()/pic2663291.jpg","urlImage":"https://cf.geekdo-images.com/fVwPntkJKgaEo0rIC0RwpA__original/img/1jawNpljTXwnT4km_2CjGwoUPR8=/0x0/filters:format(jpeg)/pic2663291.jpg"},{"bggId":"193738","name":"Great Western Trail","description":"America in the 19th century: You are a rancher and repeatedly herd your cattle from Texas to Kansas City, where you send them off by train. This earns you money and victory points. Needless to say, each time you arrive in Kansas City, you want to have your most valuable cattle in tow. However, the &quot;Great Western Trail&quot; not only requires that you keep your herd in good shape, but also that you wisely use the various buildings along the trail. Also, it might be a good idea to hire capable staff: cowboys to improve your herd, craftsmen to build your very own buildings, or engineers for the important railroad line.&#10;&#10;If you cleverly manage your herd and navigate the opportunities and pitfalls of Great Western Trail, you surely will gain the most victory points and win the game.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":75,"maxPlayTime":150,"minAge":12,"categoriesAndMechanics":["American West","Animals","Economic","Deck, Bag, and Pool Building","Hand Management","Ownership","Set Collection","Track Movement","Variable Set-up"],"rating":4.10176,"complexity":3.7011,"urlThumb":"https://cf.geekdo-images.com/u1l0gH7sb_vnvDvoO_QHqA__thumb/img/9lxFidyDb8j6D1vobx4e3UwZ-FI=/fit-in/200x150/filters:strip_icc()/pic4887376.jpg","urlImage":"https://cf.geekdo-images.com/u1l0gH7sb_vnvDvoO_QHqA__original/img/2zv_XMQoPFWk9Dn0oS4JY1IeFzw=/0x0/filters:format(jpeg)/pic4887376.jpg"},{"bggId":"84876","name":"The Castles of Burgundy","description":"The game is set in the Burgundy region of High Medieval France. Each player takes on the role of an aristocrat, originally controlling a small princedom. While playing they aim to build settlements and powerful castles, practice trade along the river, exploit silver mines, and use the knowledge of travelers.&#10;&#10;The game is about players taking settlement tiles from the game board and placing them into their princedom which is represented by the player board. Every tile has a function that starts when the tile is placed in the princedom. The princedom itself consists of several regions, each of which demands its own type of settlement tile.&#10;&#10;The game is played in five phases, each consisting of five rounds.  Each phase begins with the game board stocked with settlement tiles and goods tiles.  At the beginning of each round all players roll their two dice, and the player who is currently first in turn order rolls a goods placement die.  A goods tile is made available on the game board according to the roll of the goods die.  During each round players take their turns in the current turn order.  During his turn, a player may perform any two of the four possible types of actions: 1) take a settlement tile from the numbered depot on the game board corresponding to one of his dice and place it in the staging area on his player board, 2) take a settlement tile from the staging area of his player board to a space on his player board with a number matching one of his dice in the corresponding region for the type of tile and adjacent to a previously placed settlement tile, 3) deliver goods with a number matching one of his dice, or 4) take worker tokens which allow the player to adjust the roll of his dice.  In addition to these actions a player may buy a settlement tile from the central depot on the game board and place it in the staging area on his player board.  If an action triggers the award of victory points, those points are immediately recorded.  Each settlement tile offers a benefit, additional actions, additional money, advancement on the turn order track, more goods tiles, die roll adjustment or victory points.  Bonus victory points are awarded for filling a region with settlement tiles.&#10;&#10;The game ends after the fifth phase is played to completion.  Victory points are awarded for unused money and workers, and undelivered goods.  Bonus victory points from certain settlement tiles are awarded at the end of the game.&#10;&#10;The player with the most victory points wins.&#10;&#10;The rules include basic and advanced versions.&#10;&#10;This game is #14 in the Alea big box series.&#10;&#10;There is a separate BGG entry for the 2019 edition: The Castles of Burgundy.  The 2019 edition includes, alongside the base game, eight expansions, seven of which had already been released separately as promotional items and one new to the 2019 release.&#10;&#10;UPC 4005556812431&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":90,"minAge":12,"categoriesAndMechanics":["Dice","Medieval","Territory Building","Dice Rolling","End Game Bonuses","Grid Coverage","Hexagon Grid","Open Drafting","Pattern Building","Tile Placement","Turn Order: Stat-Based","Variable Set-up"],"rating":4.0691,"complexity":2.9827,"urlThumb":"https://cf.geekdo-images.com/5CFwjd8zTcGYVUnkXh04hw__thumb/img/0AG_6zsfYQjqlUHG0-_8lcjp8rc=/fit-in/200x150/filters:strip_icc()/pic1176894.jpg","urlImage":"https://cf.geekdo-images.com/5CFwjd8zTcGYVUnkXh04hw__original/img/N8btACZrnEYK1amBNk26VBdcGwc=/0x0/filters:format(jpeg)/pic1176894.jpg"},{"bggId":"169786","name":"Scythe","description":"It is a time of unrest in 1920s Europa. The ashes from the first great war still darken the snow. The capitalistic city-state known simply as &ldquo;The Factory&rdquo;, which fueled the war with heavily armored mechs, has closed its doors, drawing the attention of several nearby countries.&#10;&#10;Scythe is an engine-building game set in an alternate-history 1920s period. It is a time of farming and war, broken hearts and rusted gears, innovation and valor. In Scythe, each player represents a character from one of five factions of Eastern Europe who are attempting to earn their fortune and claim their faction's stake in the land around the mysterious Factory. Players conquer territory, enlist new recruits, reap resources, gain villagers, build structures, and activate monstrous mechs.&#10;&#10;Each player begins the game with different resources (power, coins, combat acumen, and popularity), a different starting location, and a hidden goal. Starting positions are specially calibrated to contribute to each faction&rsquo;s uniqueness and the asymmetrical nature of the game (each faction always starts in the same place). Scythe uses a streamlined action-selection mechanism (no rounds or phases) to keep gameplay moving at a brisk pace and reduce downtime between turns. While there is plenty of direct conflict for players who seek it, there is no player elimination.&#10;&#10;Scythe gives players almost complete control over their fate. Other than each player&rsquo;s individual hidden objective card, the only elements of luck or variability are &ldquo;encounter&rdquo; cards that players will draw as they interact with the citizens of newly explored lands. Each encounter card provides the player with several options, allowing them to mitigate the luck of the draw through their selection. Combat is also driven by choices, not luck or randomness. Every part of Scythe has an aspect of engine-building to it. Players can upgrade actions to become more efficient, build structures that improve their position on the map, enlist new recruits to enhance character abilities, activate mechs to deter opponents from invading, and expand their borders to reap greater types and quantities of resources. These engine-building aspects create a sense of momentum and progress throughout the game. The order in which players improve their engine adds to the unique feel of each game, even when playing one faction multiple times.&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":90,"maxPlayTime":115,"minAge":14,"categoriesAndMechanics":["Economic","Fighting","Science Fiction","Territory Building","Area Majority / Influence","Card Play Conflict Resolution","Contracts","End Game Bonuses","Force Commitment","Grid Movement","Hexagon Grid","King of the Hill","Movement Points","Solo / Solitaire Game","Take That","Tech Trees / Tech Tracks","Variable Player Powers","Variable Set-up","Victory Points as a Resource","Zone of Control"],"rating":4.075035,"complexity":3.4453,"urlThumb":"https://cf.geekdo-images.com/7k_nOxpO9OGIjhLq2BUZdA__thumb/img/eQ69OEDdjYjfKg6q5Navee87skU=/fit-in/200x150/filters:strip_icc()/pic3163924.jpg","urlImage":"https://cf.geekdo-images.com/7k_nOxpO9OGIjhLq2BUZdA__original/img/HlDb9F365w0tSP8uD1vf1pfniQE=/0x0/filters:format(jpeg)/pic3163924.jpg"},{"bggId":"246900","name":"Eclipse: Second Dawn for the Galaxy","description":"A game of Eclipse places you in control of a vast interstellar civilization, competing for success with its rivals. You explore new star systems, research technologies, and build spaceships with which to wage war. There are many potential paths to victory, so you need to plan your strategy according to the strengths and weaknesses of your species, while paying attention to the other civilizations' endeavors.&#10;&#10;Eclipse: Second Dawn for the Galaxy is a revised and upgraded version of the Eclipse base game that debuted in 2011 that features:&#10;&#10;&#10;    New graphic design, while maintaining the acclaimed symbology of the first edition &#10;    A full line of Ship Pack 1 miniatures&#10;    New miniatures for ancients, GCDS, orbitals, and more&#10;    Custom plastic inlays&#10;    Custom combat dice&#10;    Fine-tuned gameplay&#10;&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":60,"maxPlayTime":200,"minAge":14,"categoriesAndMechanics":["Civilization","Exploration","Science Fiction","Space Exploration","Wargame","Alliances","Area Majority / Influence","Area-Impulse","Dice Rolling","Grid Movement","Hexagon Grid","Income","Modular Board","Passed Action Token","Tech Trees / Tech Tracks","Variable Player Powers"],"rating":4.23261,"complexity":3.6682,"urlThumb":"https://cf.geekdo-images.com/Oh3kHw6lweg6ru71Q16h2Q__thumb/img/e9XZdQe1ZcPpaq4Gy31OoWBB_V0=/fit-in/200x150/filters:strip_icc()/pic5235277.jpg","urlImage":"https://cf.geekdo-images.com/Oh3kHw6lweg6ru71Q16h2Q__original/img/yW7d4RNfU1ndISCaPlfGYUyxnRU=/0x0/filters:format(jpeg)/pic5235277.jpg"},{"bggId":"173346","name":"7 Wonders Duel","description":"In many ways 7 Wonders Duel resembles its parent game 7 Wonders. Over three ages, players acquire cards that provide resources or advance their military or scientific development in order to develop a civilization and complete wonders. What's different about 7 Wonders Duel is that, as the title suggests, the game is solely for two players.&#10;&#10;Players do not draft cards simultaneously from decks of cards, but from a display of face-down and face-up cards arranged at the start of a round. A player can take a card only if it's not covered by any others, so timing comes into play, as it can with bonus moves that allow the player to take a second card immediately. As in the original game, each acquired card can be built, discarded for coins, or used to construct a wonder. Each player also starts with four wonder cards, and the construction of a wonder provides its owner with a special ability. Only seven wonders can be built, though, so one player will end up short.&#10;&#10;Players can purchase resources at any time from the bank, or they can gain cards during the game that provide them with resources for future building; as they are acquired, the cost for those resources increases for the opponent, representing the owner's dominance in this area.&#10;&#10;You can win 7 Wonders Duel in one of three ways: each time you acquire a military card, you advance the military marker toward your opponent's capital (also giving you a bonus at certain positions). If you reach the opponent's capital, you win the game immediately. Or if you acquire six of seven different scientific symbols, you achieve scientific dominance and win immediately. If none of these situations occurs, then the player with the most points at the end of the game wins.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Ancient","Card Game","City Building","Civilization","Economic","End Game Bonuses","Income","Layering","Market","Modular Board","Multi-Use Cards","Once-Per-Game Abilities","Open Drafting","Set Collection","Sudden Death Ending","Tags","Tech Trees / Tech Tracks","Tug of War","Variable Player Powers","Variable Set-up","Victory Points as a Resource"],"rating":4.04783,"complexity":2.2279,"urlThumb":"https://cf.geekdo-images.com/zdagMskTF7wJBPjX74XsRw__thumb/img/gV1-ckZSIC-dCxxpq1Y7GmPITzQ=/fit-in/200x150/filters:strip_icc()/pic2576399.jpg","urlImage":"https://cf.geekdo-images.com/zdagMskTF7wJBPjX74XsRw__original/img/Ju836WNSaW7Mab9Vjq2TJ_FqhWQ=/0x0/filters:format(jpeg)/pic2576399.jpg"},{"bggId":"28720","name":"Brass: Lancashire","description":"Brass: Lancashire &mdash; first published as Brass &mdash; is an economic strategy game that tells the story of competing cotton entrepreneurs in Lancashire during the industrial revolution. You must develop, build, and establish your industries and network so that you can capitalize demand for iron, coal and cotton. The game is played over two halves: the canal phase and the rail phase. To win the game, score the most victory points (VPs), which are counted at the end of each half. VPs are gained from your canals, rails, and established (flipped) industry tiles. Each round, players take turns according to the turn order track, receiving two actions to perform any of the following:&#10;&#10;&#10;    Build an industry tile&#10;    Build a rail or canal&#10;    Develop an industry&#10;    Sell cotton&#10;    Take a loan&#10;&#10;&#10;At the end of a player's turn, they replace the two cards they played with two more from the deck. Turn order is determined by how much money a player spent on the previous turn, from lowest spent first to highest spent. This turn order mechanism opens some strategic options for players going later in the turn order, allowing for the possibility of back-to-back turns.&#10;&#10;After all the cards have been played the first time (with the deck size being adjusted for the number of players), the canal phase ends and a scoring round commences. After scoring, all canals and all of the lowest level industries are removed for the game, after which new cards are dealt and the rail phase begins. During this phase, players may now occupy more than one location in a city and a double-connection build (though expensive) is possible. At the end of the rail phase, another scoring round takes place, then a winner is crowned.&#10;&#10;The cards limit where you can build your industries, but any card can be used for the develop, sell cotton or build connections actions. This leads to a strategic timing/storing of cards. Resources are common so that if one player builds a rail line (which requires coal) they have to use the coal from the nearest source, which may be an opponent's coal mine, which in turn gets that coal mine closer to scoring (i.e., being utilized).&#10;&#10;Brass: Lancashire, the 2018 edition from Roxley Games, reboots the original Warfrog Games edition of Brass with new artwork and components, as well as a few rules changes:&#10;&#10;&#10;     The virtual link rules between Birkenhead have been made optional.&#10;     The three-player experience has been brought closer to the ideal experience of four players by shortening each half of the game by one round and tuning the deck and distant market tiles slightly to ensure a consistent experience.&#10;     Two-player rules have been created and are playable without the need for an alternate board.&#10;     The level 1 cotton mill is now worth 5 VP to make it slightly less terrible.&#10;&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Economic","Industry / Manufacturing","Post-Napoleonic","Transportation","Hand Management","Income","Loans","Market","Network and Route Building","Tech Trees / Tech Tracks","Turn Order: Stat-Based"],"rating":4.0957,"complexity":3.8573,"urlThumb":"https://cf.geekdo-images.com/tHVtPzu82mBpeQbbZkV6EA__thumb/img/AghH1bAEhqzvyRcP3cy5G-rz0So=/fit-in/200x150/filters:strip_icc()/pic3469216.jpg","urlImage":"https://cf.geekdo-images.com/tHVtPzu82mBpeQbbZkV6EA__original/img/3ffdJj5Pz6HQrg09Kh8ecTen-TY=/0x0/filters:format(jpeg)/pic3469216.jpg"},{"bggId":"167355","name":"Nemesis","description":"Playing Nemesis will take you into the heart of sci-fi survival horror in all its terror. A soldier fires blindly down a corridor, trying to stop the alien advance. A scientist races to find a solution in his makeshift lab. A traitor steals the last escape pod in the very last moment. Intruders you meet on the ship are not only reacting to the noise you make but also evolve as the time goes by. The longer the game takes, the stronger they become. During the game, you control one of the crew members with a unique set of skills, personal deck of cards, and individual starting equipment. These heroes cover all your basic SF horror needs. For example, the scientist is great with computers and research, but will have a hard time in combat. The soldier, on the other hand...&#10;&#10;Nemesis is a semi-cooperative game in which you and your crewmates must survive on a ship infested with hostile organisms. To win the game, you have to complete one of the two objectives dealt to you at the start of the game and get back to Earth in one piece. You will find many obstacles on your way: swarms of Intruders (the name given to the alien organisms by the ship AI), the poor physical condition of the ship, agendas held by your fellow players, and sometimes just cruel fate.&#10;&#10;The gameplay of Nemesis is designed to be full of climactic moments which, hopefully, you will find rewarding even when your best plans are ruined and your character meets a terrible fate.&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":90,"maxPlayTime":180,"minAge":12,"categoriesAndMechanics":["Adventure","Horror","Miniatures","Science Fiction","Campaign / Battle Card Driven","Cooperative Game","Dice Rolling","Hand Management","Hidden Roles","Interrupts","Modular Board","Player Elimination","Semi-Cooperative Game","Solo / Solitaire Game","Team-Based Game","Traitor Game","Variable Player Powers"],"rating":4.138055,"complexity":3.4607,"urlThumb":"https://cf.geekdo-images.com/tAqLpWxQ0Oo3GaPP3MER1g__thumb/img/sMIg7_b5ekS1xm6cBIoMFpH0MZs=/fit-in/200x150/filters:strip_icc()/pic5073276.jpg","urlImage":"https://cf.geekdo-images.com/tAqLpWxQ0Oo3GaPP3MER1g__original/img/sA6r1p6BO_Tgyc3-xgIESC9Y-vg=/0x0/filters:format(jpeg)/pic5073276.jpg"},{"bggId":"266507","name":"Clank! Legacy: Acquisitions Incorporated","description":"Clank! Legacy: Acquisitions Incorporated extends the deck-building fun of Clank! with legacy-style gameplay! Found your own franchise of the legendary adventuring company Acquisitions Incorporated, and shepherd your fledgling treasure-hunters to immortal corporate glory over the course of multiple games. Your game board, your deck, and your world change as you play to create a unique campaign tailored to your adventuring party. Be cunning, be bold, and most importantly be ready...&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":90,"maxPlayTime":120,"minAge":13,"categoriesAndMechanics":["Adventure","Fantasy","Miniatures","Deck, Bag, and Pool Building","Delayed Purchase","End Game Bonuses","Events","Legacy Game","Map Addition","Movement Points","Narrative Choice / Paragraph","Once-Per-Game Abilities","Open Drafting","Pick-up and Deliver","Player Elimination","Point to Point Movement","Push Your Luck","Scenario / Mission / Campaign Game","Set Collection","Variable Player Powers","Variable Set-up"],"rating":4.274405,"complexity":2.7132,"urlThumb":"https://cf.geekdo-images.com/hc2NDafu5c24iLJh_IZmyg__thumb/img/8TA1Gn7jERN4yhtXD-xBCGk-QfM=/fit-in/200x150/filters:strip_icc()/pic4885780.png","urlImage":"https://cf.geekdo-images.com/hc2NDafu5c24iLJh_IZmyg__original/img/1Fpyz7j7rTvMPRiDdPjn0Vf0m2k=/0x0/filters:format(png)/pic4885780.png"},{"bggId":"124361","name":"Concordia","description":"Two thousand years ago, the Roman Empire ruled the lands around the Mediterranean Sea. With peace at the borders, harmony inside the provinces, uniform law, and a common currency, the economy thrived and gave rise to mighty Roman dynasties as they expanded throughout the numerous cities. Guide one of these dynasties and send colonists to the remote realms of the Empire; develop your trade network; and appease the ancient gods for their favor &mdash; all to gain the chance to emerge victorious!&#10;&#10;Concordia is a peaceful strategy game of economic development in Roman times for 2-5 players aged 13 and up. Instead of looking to the luck of dice or cards, players must rely on their strategic abilities. Be sure to watch your rivals to determine which goals they are pursuing and where you can outpace them! In the game, colonists are sent out from Rome to settle down in cities that produce bricks, food, tools, wine, and cloth. Each player starts with an identical set of playing cards and acquires more cards during the game. These cards serve two purposes:&#10;&#10;&#10;    They allow a player to choose actions during the game.&#10;    They are worth victory points (VPs) at the end of the game. &#10;&#10;&#10;Concordia is a strategy game that requires advance planning and consideration of your opponent's moves. Every game is different, not only because of the sequence of new cards on sale but also due to the modular layout of cities. (One side of the game board shows the entire Roman Empire with 30 cities for 3-5 players, while the other shows Roman Italy with 25 cities for 2-4 players.) When all cards have been sold or after the first player builds his 15th house, the game ends. The player with the most VPs from the gods (Jupiter, Saturnus, Mercurius, Minerva, Vesta, etc.) wins the game.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":100,"maxPlayTime":100,"minAge":13,"categoriesAndMechanics":["Ancient","Economic","Nautical","Action Retrieval","Advantage Token","Auction: Dutch","End Game Bonuses","Hand Management","Hidden Victory Points","Investment","Movement Points","Open Drafting","Point to Point Movement","Set Collection","Variable Set-up"],"rating":4.04824,"complexity":2.9975,"urlThumb":"https://cf.geekdo-images.com/CzwSm8i7tkLz6cBnrILZBg__thumb/img/ESPSltYYSFK-aJw6jOTdQrJGpOc=/fit-in/200x150/filters:strip_icc()/pic3453267.jpg","urlImage":"https://cf.geekdo-images.com/CzwSm8i7tkLz6cBnrILZBg__original/img/BhJ3sB3uk-eSdR1iW4EP3cu0Wi0=/0x0/filters:format(jpeg)/pic3453267.jpg"},{"bggId":"177736","name":"A Feast for Odin","description":"A Feast for Odin is a saga in the form of a board game. You are reliving the cultural achievements, mercantile expeditions, and pillages of those tribes we know as Viking today &mdash; a term that was used quite differently towards the end of the first millennium.&#10;&#10;When the northerners went out for a raid, they used to say they headed out for a viking. Their Scandinavian ancestors, however, were much more than just pirates. They were explorers and founders of states. Leif Eriksson is said to be the first European in America, long before Columbus.&#10;In what is known today as Normandy, the intruders were not called Vikings but Normans. One of them is the famous William the Conqueror who invaded England in 1066. He managed to do what the king of Norway failed to do only a few years prior: conquer the Throne of England. The reason why the people of these times became such strong seafarers is due to their unfortunate agricultural situation. Crop shortfalls caused great distress.&#10;&#10;In this game, you will raid and explore new territories. You will also experience their day-to-day activities: collecting goods to achieve a financially secure position in society. In the end, the player whose possessions bear the greatest value will be declared the winner.&#10;&#10;--gameplay description from @StoryBoardGamer's review:&#10;A Feast for Odin is a points-driven game, with plethora of pathways to victory, with a range of risk balanced against reward. A significant portion of this is your central hall, which has a whopping -86 points of squares and a major part of your game is attempting to cover these up with various tiles. Likewise, long halls and island colonies can also offer large rewards, but they will have penalties of their own.&#10;&#10;Each year follows a familiar pattern of preparation, worker placement, and then meeting the requirements of your feast. The main phase of each year is a worker placement affair. You start with a selection of Vikings, and a large action board with a whopping 61 different options to choose from. Each of these will be arranged from left to right in one of four columns. Each column requires an additional Viking to activate, but they are proportionally more powerful.&#10;&#10;At the end of each round, you will need to fill a feast table with food, alternating between plants and vegetable matter. You will also have a chance to lay the valuable green and blue tiles into your main hall. The configuration of these tiles must follow certain requirements, but your main goal is to both cover up a line of coin icons to increase your income, while otherwise encircling certain printed icons to generate those.&#10;&#10;You will build your engine over time, following an alternating pattern of outward expansion and hunting against development and cultivation. It all comes down to how much you&rsquo;re willing to take on at any one time, and what risks you&rsquo;re willing to set yourself up with for their rewards.&#10;&#10;UPC 681706716909&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Economic","Farming","Industry / Manufacturing","Medieval","Puzzle","Automatic Resource Growth","Dice Rolling","Grid Coverage","Income","Push Your Luck","Solo / Solitaire Game","Tile Placement","Turn Order: Pass Order","Worker Placement"],"rating":4.087535,"complexity":3.861,"urlThumb":"https://cf.geekdo-images.com/s9oGMCo1fcfV4Dk3EnqLZw__thumb/img/AKxMMz2DTbBrEynhDROla8fdjJ4=/fit-in/200x150/filters:strip_icc()/pic3146943.png","urlImage":"https://cf.geekdo-images.com/s9oGMCo1fcfV4Dk3EnqLZw__original/img/N1X-0JB1GapFVhl98nP4tNFXMcM=/0x0/filters:format(png)/pic3146943.png"},{"bggId":"266192","name":"Wingspan","description":"Wingspan is&nbsp;a competitive, medium-weight, card-driven, engine-building board game from Stonemaier Games. It's designed by Elizabeth Hargrave and features over 170 birds illustrated by Beth Sobel, Natalia Rojas, and Ana Maria Martinez.&#10;&#10;You are bird enthusiasts&mdash;researchers, bird watchers, ornithologists, and collectors&mdash;seeking to discover and attract the best birds to your network of wildlife preserves. Each bird extends a chain of powerful combinations in one of your habitats (actions). These habitats  focus on several key aspects of growth:&#10;&#10;&#10;     Gain food tokens via custom dice in a birdfeeder dice tower&#10;     Lay eggs using egg miniatures in a variety of colors&#10;     Draw from hundreds of unique bird cards and play them&#10;&#10;&#10;The winner is the player with the most points after 4 rounds.&#10;&#10;&mdash;description from the publisher&#10;&#10;From the 7th printing on, the base game box includes Wingspan: Swift-Start Promo Pack.&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":40,"maxPlayTime":70,"minAge":10,"categoriesAndMechanics":["Animals","Card Game","Educational","Action Queue","Dice Rolling","End Game Bonuses","Hand Management","Once-Per-Game Abilities","Open Drafting","Set Collection","Solo / Solitaire Game","Turn Order: Progressive"],"rating":4.02906,"complexity":2.4623,"urlThumb":"https://cf.geekdo-images.com/yLZJCVLlIx4c7eJEWUNJ7w__thumb/img/VNToqgS2-pOGU6MuvIkMPKn_y-s=/fit-in/200x150/filters:strip_icc()/pic4458123.jpg","urlImage":"https://cf.geekdo-images.com/yLZJCVLlIx4c7eJEWUNJ7w__original/img/cI782Zis9cT66j2MjSHKJGnFPNw=/0x0/filters:format(jpeg)/pic4458123.jpg"},{"bggId":"120677","name":"Terra Mystica","description":"In the land of Terra Mystica dwell 14 different peoples in seven landscapes, and each group is bound to its own home environment, so to develop and grow, they must terraform neighboring landscapes into their home environments in competition with the other groups.&#10;&#10;Terra Mystica is a full information game, without any luck, that rewards strategic planning. Each player governs one of the 14 groups. With subtlety and craft, the player must attempt to rule as great an area as possible and to develop that group's skills. There are also four religious cults in which you can progress. To do all that, each group has special skills and abilities.&#10;&#10;Taking turns, the players execute their actions on the resources they have at their disposal. Different buildings allow players to develop different resources. Dwellings allow for more workers. Trading houses allow players to make money. Strongholds unlock a group's special ability, and temples allow you to develop religion and your terraforming and seafaring skills. Buildings can be upgraded: Dwellings can be developed into trading houses; trading houses can be developed into strongholds or temples; one temple can be upgraded to become a sanctuary. Each group must also develop its terraforming skill and its skill with boats to use the rivers. The groups in question, along with their home landscape, are:&#10;&#10;&#10;    Desert (Fakirs, Nomads)&#10;    Plains (Halflings, Cultists)&#10;    Swamp (Alchemists, Darklings)&#10;    Lake (Mermaids, Swarmlings)&#10;    Forest (Witches, Auren)&#10;    Mountain (Dwarves, Engineers)&#10;    Wasteland (Giants, Chaos Magicians)&#10;&#10;&#10;Proximity to other groups is a double-edged sword in Terra Mystica. Being close to other groups gives you extra power, but it also means that expanding is more difficult...&#10;&#10;Terra Mystica FAQ&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":60,"maxPlayTime":150,"minAge":12,"categoriesAndMechanics":["Civilization","Economic","Fantasy","Territory Building","Area Majority / Influence","Chaining","End Game Bonuses","Hexagon Grid","Income","Increase Value of Unchosen Resources","Network and Route Building","Tech Trees / Tech Tracks","Turn Order: Pass Order","Variable Player Powers","Variable Set-up","Victory Points as a Resource","Worker Placement, Different Worker Types"],"rating":4.033805,"complexity":3.9726,"urlThumb":"https://cf.geekdo-images.com/bre12I1YiXkZr7elvriz4A__thumb/img/GW-ip0dfeAee7KQqJ04SRZxF1lg=/fit-in/200x150/filters:strip_icc()/pic5375624.jpg","urlImage":"https://cf.geekdo-images.com/bre12I1YiXkZr7elvriz4A__original/img/_dZS7fVfdc4DhJPbqnDpwTT4uF0=/0x0/filters:format(jpeg)/pic5375624.jpg"},{"bggId":"205637","name":"Arkham Horror: The Card Game","description":"Something evil stirs in Arkham, and only you can stop it. Blurring the traditional lines between role-playing and card game experiences, Arkham Horror: The Card Game is a Living Card Game of Lovecraftian mystery, monsters, and madness!&#10;&#10;In the game, you and your friend (or up to three friends with two Core Sets) become characters within the quiet New England town of Arkham. You have your talents, sure, but you also have your flaws. Perhaps you've dabbled a little too much in the writings of the Necronomicon, and its words continue to haunt you. Perhaps you feel compelled to cover up any signs of otherworldly evils, hampering your own investigations in order to protect the quiet confidence of the greater population. Perhaps you'll be scarred by your encounters with a ghoulish cult.&#10;&#10;No matter what compels you, no matter what haunts you, you'll find both your strengths and weaknesses reflected in your custom deck of cards, and these cards will be your resources as you work with your friends to unravel the world's most terrifying mysteries.&#10;&#10;Each of your adventures in Arkham Horror LCG carries you deeper into mystery. You'll find cultists and foul rituals. You'll find haunted houses and strange creatures. And you may find signs of the Ancient Ones straining against the barriers to our world...&#10;&#10;The basic mode of play in Arkham LCG is not the adventure, but the campaign. You might be scarred by your adventures, your sanity may be strained, and you may alter Arkham's landscape, burning buildings to the ground. All your choices and actions have consequences that reach far beyond the immediate resolution of the scenario at hand&mdash;and your actions may earn you valuable experience with which you can better prepare yourself for the adventures that still lie before you.&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Adventure","Card Game","Collectible Components","Exploration","Horror","Novel-based","Action Points","Area Movement","Communication Limits","Cooperative Game","Deck Construction","Events","Hand Management","Map Deformation","Modular Board","Push Your Luck","Role Playing","Scenario / Mission / Campaign Game","Solo / Solitaire Game","Stat Check Resolution","Variable Player Powers"],"rating":4.0654,"complexity":3.5327,"urlThumb":"https://cf.geekdo-images.com/B5F5ulz0UivNgrI9Ky0euA__thumb/img/L8ouPl5jv2Ye9MC4R_Os2zSGigE=/fit-in/200x150/filters:strip_icc()/pic3122349.jpg","urlImage":"https://cf.geekdo-images.com/B5F5ulz0UivNgrI9Ky0euA__original/img/guEKCewM_2e5ugltSN3dTSwdZJI=/0x0/filters:format(jpeg)/pic3122349.jpg"},{"bggId":"312484","name":"Lost Ruins of Arnak","description":"On an uninhabited island in uncharted seas, explorers have found traces of a great civilization. Now you will lead an expedition to explore the island, find lost artifacts, and face fearsome guardians, all in a quest to learn the island's secrets.&#10;&#10;Lost Ruins of Arnak combines deck-building and worker placement in a game of exploration, resource management, and discovery. In addition to traditional deck-builder effects, cards can also be used to place workers, and new worker actions become available as players explore the island. Some of these actions require resources instead of workers, so building a solid resource base will be essential. You are limited to only one action per turn, so make your choice carefully... what action will benefit you most now? And what can you afford to do later... assuming someone else doesn't take the action first!?&#10;&#10;Decks are small, and randomness in the game is heavily mitigated by the wealth of tactical decisions offered on the game board. With a variety of worker actions, artifacts, and equipment cards, the set-up for each game will be unique, encouraging players to explore new strategies to meet the challenge.&#10;&#10;Discover the Lost Ruins of Arnak!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Adventure","Ancient","Exploration","Fantasy","Travel","Contracts","Deck, Bag, and Pool Building","Market","Multi-Use Cards","Once-Per-Game Abilities","Resource to Move","Solo / Solitaire Game","Turn Order: Progressive","Worker Placement"],"rating":4.03996,"complexity":2.9159,"urlThumb":"https://cf.geekdo-images.com/6GqH14TJJhza86BX5HCLEQ__thumb/img/J8SVmGOJXZGxNjkT3xYNQU7Haxg=/fit-in/200x150/filters:strip_icc()/pic5674958.jpg","urlImage":"https://cf.geekdo-images.com/6GqH14TJJhza86BX5HCLEQ__original/img/CXqwimJPonWy1oyXEMgPN_ZVmUI=/0x0/filters:format(jpeg)/pic5674958.jpg"},{"bggId":"341169","name":"Great Western Trail: Second Edition","description":"America in the 19th century: You are a rancher and repeatedly herd your cattle from Texas to Kansas City, where you send them off by train. This earns you money and victory points. Needless to say, each time you arrive in Kansas City, you want to have your most valuable cattle in tow. However, the &quot;Great Western Trail&quot; not only requires that you keep your herd in good shape, but also that you wisely use the various buildings along the trail. Also, it might be a good idea to hire capable staff: cowboys to improve your herd, craftsmen to build your very own buildings, or engineers for the important railroad line.&#10;&#10;If you cleverly manage your herd and navigate the opportunities and pitfalls of Great Western Trail, you surely will gain the most victory points and win the game.&#10;&#10;The second edition of Great Western Trail includes solitaire rules, making for a player count of 1-4.&#10;&#10;Second Edition:&#10;Remember the old days in the West? Well, the times they are a-changing&rsquo;! From new solo opponent to incredible landscapes, you won't know where to start. And there is a new herd of cows for you to sell!&#10;&#10;Great Western Trail is the critically acclaimed game of cattle ranching by Alexander Pfister. Players attempt to wrangle their herd across the Midwest prairie and deliver it to Kansas City. But beware! Other cowboys are sharing the trail with you. We invite you to saddle up!&#10;&#10;The changes in the Second edition:&#10;&#10;&#10;     Brand New Artwork by Chris Quilliams&#10;     Solo Mode: A New Challenger in the West&#10;     Dual-Layered Player Boards&#10;     Addition of a new breed of cows: The Simmental breed&#10;     Two new reversible buildings (#11 &amp; 12)&#10;     Twelve Exchange Tokens, First introduced in the Rails of North Expansion, for more interaction with other players&#10;     Four new Master Tiles added for more strategy, replayability, and challenges&#10;&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":75,"maxPlayTime":150,"minAge":12,"categoriesAndMechanics":["American West","Animals","Economic","Deck, Bag, and Pool Building","Hand Management","Ownership","Set Collection","Solo / Solitaire Game","Tags","Track Movement","Variable Set-up"],"rating":4.178495,"complexity":3.7283,"urlThumb":"https://cf.geekdo-images.com/gDn7AhrDlmfCLSz9ZqoNFQ__thumb/img/0pt6XrFHTXpNetwMo9rdY7PdhfQ=/fit-in/200x150/filters:strip_icc()/pic5988511.jpg","urlImage":"https://cf.geekdo-images.com/gDn7AhrDlmfCLSz9ZqoNFQ__original/img/yecB1xO32nnjBAyskVOTq9LBuLo=/0x0/filters:format(jpeg)/pic5988511.jpg"},{"bggId":"237182","name":"Root","description":"Root is a game of adventure and war in which 2 to 4 (1 to 6 with the 'Riverfolk' expansion) players battle for control of a vast wilderness. Like Vast: The Crystal Caverns, each player in Root has unique capabilities and a different victory condition. Now, with the aid of gorgeous, multi-use cards, a truly asymmetric design has never been more accessible.&#10;&#10;The nefarious Marquise de Cat has seized the great woodland, intent on harvesting its riches. Under her rule, the many creatures of the forest have banded together. This Alliance will seek to strengthen its resources and subvert the rule of Cats. In this effort, the Alliance may enlist the help of the wandering Vagabonds who are able to move through the more dangerous woodland paths. Though some may sympathize with the Alliance&rsquo;s hopes and dreams, these wanderers are old enough to remember the great birds of prey who once controlled the woods.&#10;&#10;Meanwhile, at the edge of the region, the proud, squabbling Eyrie have found a new commander who they hope will lead their faction to resume their ancient birthright. The stage is set for a contest that will decide the fate of the great woodland. It is up to the players to decide which group will ultimately take root.&#10;&#10;In Root, players drive the narrative, and the differences between each role create an unparalleled level of interaction and replayability. Leder Games invites you and your family to explore the fantastic world of Root!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":90,"minAge":10,"categoriesAndMechanics":["Animals","Fantasy","Territory Building","Wargame","Action Queue","Action Retrieval","Area Majority / Influence","Area Movement","Dice Rolling","Hand Management","Point to Point Movement","Race","Sudden Death Ending","Variable Player Powers","Variable Set-up"],"rating":4.037555,"complexity":3.7976,"urlThumb":"https://cf.geekdo-images.com/JUAUWaVUzeBgzirhZNmHHw__thumb/img/ACovMZzGGIsBRyEQXFnsT8282NM=/fit-in/200x150/filters:strip_icc()/pic4254509.jpg","urlImage":"https://cf.geekdo-images.com/JUAUWaVUzeBgzirhZNmHHw__original/img/E0s2LvtFA1L5YKk-_44D4u2VD2s=/0x0/filters:format(jpeg)/pic4254509.jpg"},{"bggId":"164928","name":"Orlans","description":"During the medieval goings-on around Orl&eacute;ans, you must assemble a following of farmers, merchants, knights, monks, etc. to gain supremacy through trade, construction and science in medieval France.&#10;&#10;In Orl&eacute;ans, you will recruit followers and put them to work to make use of their abilities. Farmers and Boatmen supply you with money and goods; Knights expand your scope of action and secure your mercantile expeditions; Craftsmen build trading stations and tools to facilitate work; Scholars make progress in science; Traders open up new locations for you to use your followers; and last but not least, it cannot hurt to get active in monasteries since with Monks on your side you are much less likely to fall prey to fate.&#10;&#10;You will always want to take more actions than possible, and there are many paths to victory. The challenge is to combine all elements as best as possible with regard to your strategy.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":90,"maxPlayTime":90,"minAge":12,"categoriesAndMechanics":["Medieval","Religious","Travel","Contracts","Deck, Bag, and Pool Building","End Game Bonuses","Events","Point to Point Movement","Simultaneous Action Selection","Tech Trees / Tech Tracks","Turn Order: Progressive","Variable Set-up","Worker Placement, Different Worker Types"],"rating":4.03074,"complexity":3.0288,"urlThumb":"https://cf.geekdo-images.com/nagl1li6kYt9elV9jbfVQw__thumb/img/ykeqdM_Naz4IiqOgyB1arzteOiU=/fit-in/200x150/filters:strip_icc()/pic6228507.jpg","urlImage":"https://cf.geekdo-images.com/nagl1li6kYt9elV9jbfVQw__original/img/Qn6vlBaTUaHNFsqohIUjd0EA4z0=/0x0/filters:format(jpeg)/pic6228507.jpg"},{"bggId":"295770","name":"Frosthaven","description":"Frosthaven is the story of a small outpost far to the north of the capital city of White Oak, an outpost barely surviving the harsh weather as well as invasions from forces both known and unknown. There, a group of mercenaries at the end of their rope will help bring back this settlement from the edge of destruction. Not only will they have to deal with the harsh elements, but there are other, far more dangerous threats out in the unforgiving cold as well. There are Algox, the bigger, more yeti-like cousins of the Inox, attacking from the mountains; Lurkers flooding in from the northern sea; and rumors of machines that wander the frozen wastes of their own free will. The party of mercenaries must face all of these perils, and perhaps in doing so, make peace with these new races so they can work together against even more sinister forces.&#10;&#10;Frosthaven is a standalone adventure from the designer and publisher of Gloomhaven that features sixteen new characters, three new races, more than twenty new enemies, more than one hundred new items, and a new, 100-scenario campaign.  Characters and items from Gloomhaven will be usable in Frosthaven, and vice versa.&#10;&#10;In addition to having the well-known combat mechanisms of Gloomhaven, Frosthaven will feature much more to do outside of combat, such as numerous mysteries to solve, a seasonal event system to live through, and player control over how this ramshackle village expands, with each new building offering new ways to progress.&#10;&#10;Frosthaven has a whole new set of items but there is a mechanic for bringing items over from 'Gloomhaven'. However, as it is a remote location, these products get imported and are not there as standard. Resources are much more valuable and you have to build items through a crafting system rather than just buy them.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":90,"maxPlayTime":180,"minAge":14,"categoriesAndMechanics":["Adventure","Exploration","Fantasy","Fighting","Miniatures","Campaign / Battle Card Driven","Communication Limits","Cooperative Game","Deck Construction","Deck, Bag, and Pool Building","Grid Movement","Hand Management","Hexagon Grid","Legacy Game","Modular Board","Multi-Use Cards","Once-Per-Game Abilities","Scenario / Mission / Campaign Game","Simultaneous Action Selection","Solo / Solitaire Game","Variable Player Powers"],"rating":4.431195,"complexity":4.3478,"urlThumb":"https://cf.geekdo-images.com/iEBr5o8AbJi9V9cgQcYROQ__thumb/img/a_VDlLgE8s8bfaQKwHlHu2KoQwo=/fit-in/200x150/filters:strip_icc()/pic6177719.jpg","urlImage":"https://cf.geekdo-images.com/iEBr5o8AbJi9V9cgQcYROQ__original/img/ZNt6bSM6kCGFzN1_mzuPl4wCbyM=/0x0/filters:format(jpeg)/pic6177719.jpg"},{"bggId":"192135","name":"Too Many Bones","description":"Too Many Bones comes loaded for bear by breaking into a new genre: the dice-builder RPG. This game takes everything you think you know about dice-rolling and turns it on its head. Dripping with strategy, this fantasy-based RPG puts you in the skin of a new race and takes you on an adventure to the northern territories to root out and defeat growing enemy forces and of course the infamous &quot;baddie&quot; responsible.&#10;&#10;Team up or go it alone in a 1-4 player Coop or Solo play campaign. With over 100+ unique skill dice and 4-7 classes to choose from, every battle is its own mini challenge to figure out. Your adventure will consist of 8-12 battles before you reach your final destination and face off against one of a number of possible kingpins in order to win. Along the way, you will be faced with storyline decisions that will quickly have you weighing risk/reward, odds, and logic - with dice woven into every aspect! Your party will also be faced with other decisions: when to rest, when to explore, or even which fights to pursue! The Encounter cards offer fun plot twists and some comic relief, all while setting the stage for your next battle.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Adventure","Dice","Fantasy","Fighting","Cooperative Game","Deck, Bag, and Pool Building","Dice Rolling","Die Icon Resolution","Grid Movement","Hand Management","Resource to Move","Role Playing","Scenario / Mission / Campaign Game","Solo / Solitaire Game","Square Grid","Stat Check Resolution","Tech Trees / Tech Tracks","Turn Order: Role Order","Variable Player Powers"],"rating":4.175355,"complexity":3.8527,"urlThumb":"https://cf.geekdo-images.com/wKwRk0wYBcrtLAfgn4PCdg__thumb/img/mJNzYNKvYWDlaaD12V32BJ453d0=/fit-in/200x150/filters:strip_icc()/pic6624445.png","urlImage":"https://cf.geekdo-images.com/wKwRk0wYBcrtLAfgn4PCdg__original/img/Wpp0vzsVe4HxXGUqiZ1hDvwAHZU=/0x0/filters:format(png)/pic6624445.png"},{"bggId":"96848","name":"Mage Knight Board Game","description":"The Mage Knight board game puts you in control of one of four powerful Mage Knights as you explore (and conquer) a corner of the Mage Knight universe under the control of the Atlantean Empire. Build your army, fill your deck with powerful spells and actions, explore caves and dungeons, and eventually conquer powerful cities controlled by this once-great faction!  In competitive scenarios, opposing players may be powerful allies, but only one will be able to claim the land as their own.  In cooperative scenarios, the players win or lose as a group.  Solo rules are also included.&#10;&#10;Combining elements of RPGs, deck-building, and traditional board games the Mage Knight board game captures the rich history of the Mage Knight universe in a self-contained gaming experience.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":240,"minAge":14,"categoriesAndMechanics":["Adventure","Exploration","Fantasy","Fighting","Miniatures","Card Play Conflict Resolution","Cooperative Game","Deck, Bag, and Pool Building","Dice Rolling","Grid Movement","Hand Management","Hexagon Grid","Modular Board","Multi-Use Cards","Open Drafting","Role Playing","Solo / Solitaire Game","Turn Order: Claim Action","Variable Player Powers"],"rating":4.04329,"complexity":4.36,"urlThumb":"https://cf.geekdo-images.com/DUO2hz9AlLOH8p9ED-lCWg__thumb/img/0bWDfnjzYebauQZrHmjyHkuUttI=/fit-in/200x150/filters:strip_icc()/pic1083380.jpg","urlImage":"https://cf.geekdo-images.com/DUO2hz9AlLOH8p9ED-lCWg__original/img/PDDH38Vf9NEB_4ODURxcJKNBfVQ=/0x0/filters:format(jpeg)/pic1083380.jpg"},{"bggId":"199792","name":"Everdell","description":"Within the charming valley of Everdell, beneath the boughs of towering trees, among meandering streams and mossy hollows, a civilization of forest critters is thriving and expanding. From Everfrost to Bellsong, many a year have come and gone, but the time has come for new territories to be settled and new cities established. You will be the leader of a group of critters intent on just such a task. There are buildings to construct, lively characters to meet, events to host&mdash;you have a busy year ahead of yourself. Will the sun shine brightest on your city before the winter moon rises?&#10;&#10;Everdell is a game of dynamic tableau building and worker placement.&#10;&#10;On their turn a player can take one of three actions:&#10;&#10;a) Place a Worker: Each player has a collection of Worker pieces. These are placed on the board locations, events, and on Destination cards. Workers perform various actions to further the development of a player's tableau: gathering resources, drawing cards, and taking other special actions.&#10;&#10;b) Play a Card: Each player is building and populating a city; a tableau of up to 15 Construction and Critter cards. There are five types of cards: Travelers, Production, Destination, Governance, and Prosperity. Cards generate resources (twigs, resin, pebbles, and berries), grant abilities, and ultimately score points. The interactions of the cards reveal numerous strategies and a near infinite variety of working cities.&#10;&#10;c) Prepare for the next Season: Workers are returned to the players supply and new workers are added. The game is played from Winter through to the onset of the following winter, at which point the player with the city with the most points wins.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":40,"maxPlayTime":80,"minAge":10,"categoriesAndMechanics":["Animals","Card Game","City Building","Fantasy","Contracts","End Game Bonuses","Hand Management","Income","Open Drafting","Ownership","Set Collection","Solo / Solitaire Game","Variable Set-up","Worker Placement"],"rating":4.016565,"complexity":2.8158,"urlThumb":"https://cf.geekdo-images.com/fjE7V5LNq31yVEW_yuqI-Q__thumb/img/Cf_mYxR_VvdjTEPXseSurni2JNI=/fit-in/200x150/filters:strip_icc()/pic3918905.png","urlImage":"https://cf.geekdo-images.com/fjE7V5LNq31yVEW_yuqI-Q__original/img/HQ1ti16wT9lqja5_h3gUfHUIcVI=/0x0/filters:format(png)/pic3918905.png"},{"bggId":"251247","name":"Barrage","description":"In the dystopic 1930s, the industrial revolution pushed the exploitation of fossil-based resources to the limit, and now the only thing powerful enough to quench the thirst for power of the massive machines and of the unstoppable engineering progress is the unlimited hydroelectric energy provided by the rivers.&#10;&#10;Barrage is a resource management strategic game in which players compete to build their majestic dams, raise them to increase their storing capacity, and deliver all the potential power through pressure tunnels connected to the energy turbines of their powerhouses.&#10;&#10;Each player represents one of the four international companies who are gathering machinery, innovative patents and brilliant engineers to claim the best locations to collect and exploit the water of a contested Alpine region crossed by rivers.&#10;&#10;Barrage includes two innovative and challenging mechanisms. First, the players must carefully plan their actions and handle their machinery, since both their action tokens and resources are stored on a Construction Wheel and will only be available after a full turn of the wheel. The better you manage your wheel, the earlier your resources and actions come back to you.&#10;&#10;Second, the water flow on the rivers depicted on the board is a shared and contested resource. Players have to intercept and store as much of the water as they can, build dams (upstream dams are expensive but can block part of the water before it reaches the downstream dams), raise the dams to increase their capacity, and build long tunnels to channel the water to their powerhouses. Water is never consumed &mdash; its flow is just used to produce energy &mdash;, it is instead released back to the rivers, so you have to strategically place your dams to recover the water diverted by you and the other players.&#10;&#10;Over five rounds, the players must fulfill power requirements represented by a common competitive power track and meet specific requests of personal contracts. At the same time, by placing a limited number of engineers, they attempt to enhance their machinery to acquire new and more efficient construction actions and to build and activate special unique-effect buildings to forward their own developing strategy.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Economic","Environmental","Industry / Manufacturing","Action Retrieval","Contracts","End Game Bonuses","Income","Network and Route Building","Ownership","Solo / Solitaire Game","Turn Order: Stat-Based","Variable Player Powers","Variable Set-up","Worker Placement"],"rating":4.086705,"complexity":4.11,"urlThumb":"https://cf.geekdo-images.com/jEPmWvvYpqkWrKOzqIHFsg__thumb/img/kMLIpeqA6UcUvQg2AdMwwQoEIfU=/fit-in/200x150/filters:strip_icc()/pic4336469.png","urlImage":"https://cf.geekdo-images.com/jEPmWvvYpqkWrKOzqIHFsg__original/img/rkHKwkUqpQC7PAGG7n2gbrcQiUY=/0x0/filters:format(png)/pic4336469.png"},{"bggId":"324856","name":"The Crew: Mission Deep Sea","description":"In the trick-taking card game The Crew: Mission Deep Sea, you and the other players work together to search for the lost continent of Mu. This new adventure takes your crew deep down into the abyss on a search for the fabled sunken land. How far you get depends entirely on how well you work together as a team. Card by card, trick by trick, your search party will discover the challenges that lie ahead and forge a path to Mu.&#10;&#10;This new version of The Crew has the same innovative co-operative trick-taking mechanism as the highly lauded original game &mdash; but with some exciting new surprises! While communication between your crew members is severely limited by your submerged state, it is also critical to your success; finding the hidden land in the murky depths depends not only on winning tricks, but also on carefully negotiating the order in which they are won. If things don't go as planned, you might just be able to salvage the operation, but it will take near flawless execution and perhaps a little luck to finally reach Mu.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":20,"maxPlayTime":20,"minAge":10,"categoriesAndMechanics":["Adventure","Card Game","Deduction","Mythology","Nautical","Communication Limits","Cooperative Game","Hand Management","Scenario / Mission / Campaign Game","Trick-taking"],"rating":4.08628,"complexity":2.0369,"urlThumb":"https://cf.geekdo-images.com/VuBqZ1sMaDAVVHF_OEJP4g__thumb/img/EdacXlcFZ06YK0-ZKa0oKwL4VCw=/fit-in/200x150/filters:strip_icc()/pic5988903.jpg","urlImage":"https://cf.geekdo-images.com/VuBqZ1sMaDAVVHF_OEJP4g__original/img/jGWxczXC_VWZofeAmlO_DkB0hCI=/0x0/filters:format(jpeg)/pic5988903.jpg"},{"bggId":"183394","name":"Viticulture Essential Edition","description":"In Viticulture, the players find themselves in the roles of people in rustic, pre-modern Tuscany who have inherited meagre vineyards. They have a few plots of land, an old crush pad, a tiny cellar, and three workers. They each have a dream of being the first to call their winery a true success.&#10;&#10;The players are in the position of determining how they want to allocate their workers throughout the year. Every season is different on a vineyard, so the workers have different tasks they can take care of in the summer and winter. There's competition over those tasks, and often the first worker to get to the job has an advantage over subsequent workers.&#10;&#10;Fortunately for the vineyard owners, people love to visit wineries, and it just so happens that many of those visitors are willing to help out around the vineyard when they visit as long as you assign a worker to take care of them. Their visits (in the form of cards) are brief but can be very helpful. Using those workers and visitors, the vineyard owners can expand their vineyards by building structures, planting vines, and filling wine orders, working towards the goal of running the most successful winery in Tuscany.&#10;&#10;Viticulture Essential Edition includes the base game of Viticulture and a few of the most popular modules from the original Tuscany expansion, including Mamas &amp; Papas, Fields (previously known as Properties), expanded and revised Visitors, and Automa cards for a solo variant, along with a few minor rule changes.&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":45,"maxPlayTime":90,"minAge":13,"categoriesAndMechanics":["Economic","Farming","Contracts","Hand Management","Solo / Solitaire Game","Turn Order: Auction","Victory Points as a Resource","Worker Placement","Worker Placement, Different Worker Types"],"rating":3.997525,"complexity":2.8875,"urlThumb":"https://cf.geekdo-images.com/l_PRU2lVlX9seScRFcvFlA__thumb/img/pULDtVd75QZgGfvSMhr6Rs07vK8=/fit-in/200x150/filters:strip_icc()/pic6500949.jpg","urlImage":"https://cf.geekdo-images.com/l_PRU2lVlX9seScRFcvFlA__original/img/gDL7OZFlzoOFgU0VYlREs8P5hCQ=/0x0/filters:format(jpeg)/pic6500949.jpg"},{"bggId":"175914","name":"Food Chain Magnate","description":"&quot;Lemonade? They want lemonade? What is the world coming to? I want commercials for burgers on all channels, every 15 minutes. We are the Home of the Original Burger, not a hippie health haven. And place a billboard next to that new house on the corner. I want them craving beer every second they sit in their posh new garden.&quot; The new management trainee trembles in front of the CEO and tries to politely point out that... &quot;How do you mean, we don't have enough staff? The HR director reports to you. Hire more people! Train them! But whatever you do, don't pay them any real wages. I did not go into business to become poor. And fire that discount manager, she is only costing me money. From now on, we'll sell gourmet burgers. Same crap, double the price. Get my marketing director in here!&quot;&#10;&#10;Food Chain Magnate is a heavy strategy game about building a fast food chain. The focus is on building your company using a card-driven (human) resource management system. Players compete on a variable city map through purchasing, marketing and sales, and on a job market for key staff members. The game can be played by 2-5 serious gamers in 2-4 hours.&#10;&#10;German:&#10;&#10;&quot;Limonade? Sie wollen Limonade? Was ist mit der Welt los? Ich will Werbung f&uuml;r Burger auf allen Kan&auml;len, alle 15 Minuten. Wir sind die Heimat des Original-Burgers, kein Hippie-Gesundheitsparadies. Und stellen Sie eine Werbetafel neben das neue Haus an der Ecke. Ich will, dass sie jede Sekunde, in der sie in ihrem schicken neuen Garten sitzen, nach Bier lechzen.&quot; Der neue Management-Trainee zittert vor dem CEO und versucht, h&ouml;flich darauf hinzuweisen, dass... &quot;Wie meinen Sie das, wir haben nicht genug Personal? Der Personaldirektor berichtet an Sie. Stellen Sie mehr Leute ein! Bilden Sie sie aus! Aber was auch immer Sie tun, zahlen Sie ihnen keine echten L&ouml;hne. Ich bin nicht ins Gesch&auml;ft eingestiegen, um arm zu werden. Und feuere diese Discount-Managerin, sie kostet mich nur Geld. Von nun an werden wir Gourmet-Burger verkaufen. Derselbe Mist, nur doppelt so teuer. Holen Sie meinen Marketingdirektor her!&quot;&#10;&#10;Food Chain Magnate ist ein schweres Strategiespiel &uuml;ber den Aufbau einer Fast-Food-Kette. Der Schwerpunkt liegt auf dem Aufbau des eigenen Unternehmens mit Hilfe eines kartengesteuerten (Personal-)Managementsystems. Die Spieler konkurrieren auf einer variablen Stadtkarte durch Einkauf, Marketing und Verkauf sowie auf einem Stellenmarkt f&uuml;r wichtige Mitarbeiter.&#10;&#10;Das Spiel kann von 2-5 ernsthaften Spielern in 2-4 Stunden gespielt werden.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":120,"maxPlayTime":240,"minAge":14,"categoriesAndMechanics":["Economic","Industry / Manufacturing","Delayed Purchase","Income","Market","Modular Board","Open Drafting","Simultaneous Action Selection","Victory Points as a Resource"],"rating":4.032635,"complexity":4.199,"urlThumb":"https://cf.geekdo-images.com/Wtxml94LAXsIWQCxGPS63Q__thumb/img/LKU2KoMev222qUIKyNqaCF_ZLPY=/fit-in/200x150/filters:strip_icc()/pic2649434.png","urlImage":"https://cf.geekdo-images.com/Wtxml94LAXsIWQCxGPS63Q__original/img/9c-MJB6x54vN5eB-1hT4XQaHtP8=/0x0/filters:format(png)/pic2649434.png"},{"bggId":"285774","name":"Marvel Champions: The Card Game","description":"&quot;With great power, there must also come great responsibility.&quot;&#10;   &ndash;Stan Lee, Amazing Fantasy #15&#10;&#10;Iron Man and Black Panther team up to stop Rhino from rampaging through the streets of New York. Captain Marvel and Spider-Man battle Ultron as he threatens global annihilation. Do you have what it takes to join the ranks of these legendary heroes and become a champion?&#10;&#10;Jump into the Marvel Universe with Marvel Champions: The Card Game, a cooperative Living Card Game for one to four players!&#10;&#10;Marvel Champions: The Card Game invites players to embody iconic heroes from the Marvel Universe as they battle to stop infamous villains from enacting their devious schemes. As a Living Card Game, Marvel Champions is supported with regular releases of new product, including new heroes and scenarios.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":90,"minAge":14,"categoriesAndMechanics":["Card Game","Collectible Components","Comic Book / Strip","Fighting","Card Play Conflict Resolution","Cooperative Game","Deck Construction","Hand Management","Interrupts","Scenario / Mission / Campaign Game","Solo / Solitaire Game","Turn Order: Progressive","Variable Player Powers","Variable Set-up"],"rating":4.06254,"complexity":2.9221,"urlThumb":"https://cf.geekdo-images.com/kRvUgYiaOq07kC67ZK5UoQ__thumb/img/SDNWntiB06KhAINl06CDPkoipDc=/fit-in/200x150/filters:strip_icc()/pic4900321.jpg","urlImage":"https://cf.geekdo-images.com/kRvUgYiaOq07kC67ZK5UoQ__original/img/cqng0e4S7Cj6j6Sb49-OCggGi-8=/0x0/filters:format(jpeg)/pic4900321.jpg"},{"bggId":"256960","name":"Pax Pamir: Second Edition","description":"In Pax Pamir, players assume the role of nineteenth century Afghan leaders attempting to forge a new state after the collapse of the Durrani Empire. Western histories often call this period &quot;The Great Game&quot; because of the role played by the Europeans who attempted to use central Asia as a theater for their own rivalries. In this game, those empires are viewed strictly from the perspective of the Afghans who sought to manipulate the interloping ferengi (foreigners) for their own purposes.&#10;&#10;In terms of game play, Pax Pamir is a pretty straightforward tableau builder. Players spend most of their turns purchasing cards from a central market, then playing those cards in front of them in a single row called a court. Playing cards adds units to the game's map and grants access to additional actions that can be taken to disrupt other players and influence the course of the game. That last point is worth emphasizing. Though everyone is building their own row of cards, the game offers many ways for players to interfere with each other directly and indirectly.&#10;&#10;To survive, players will organize into coalitions. Throughout the game, the dominance of the different coalitions will be evaluated by the players when a special card, called a &quot;Dominance Check&quot;, is resolved. If a single coalition has a commanding lead during one of these checks, those players loyal to that coalition will receive victory points based on their influence in their coalition. However, if Afghanistan remains fragmented during one of these checks, players instead will receive victory points based on their personal power base.&#10;&#10;After each Dominance Check, victory is checked and the game will be partially reset, offering players a fresh attempt to realize their ambitions. The game ends when a single player is able to achieve a lead of four or more victory points  or after the fourth and final Dominance Check is resolved.&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":45,"maxPlayTime":120,"minAge":13,"categoriesAndMechanics":["Economic","Educational","Negotiation","Political","Post-Napoleonic","Spies/Secret Agents","Action Points","Area Majority / Influence","Area Movement","Auction: Dutch","Hand Management","Increase Value of Unchosen Resources","Negotiation","Open Drafting","Score-and-Reset Game","Simulation","Solo / Solitaire Game","Tags"],"rating":4.103285,"complexity":3.8482,"urlThumb":"https://cf.geekdo-images.com/oSM_AuKYfGIwOtKbVEsoVg__thumb/img/NyoufH5YBFCh1rKy4uy76bR4ITk=/fit-in/200x150/filters:strip_icc()/pic4503733.png","urlImage":"https://cf.geekdo-images.com/oSM_AuKYfGIwOtKbVEsoVg__original/img/7DlaMCmuoJzm9AzelmStYIDgutI=/0x0/filters:format(png)/pic4503733.png"},{"bggId":"247763","name":"Underwater Cities","description":"In Underwater Cities, which takes about 30-45 minutes per player, players represent the most powerful brains in the world, brains nominated due to the overpopulation of Earth to establish the best and most livable underwater areas possible.&#10;&#10;The main principle of the game is card placement. Three colored cards are placed along the edge of the main board  into 3 x 5 slots, which are also colored. Ideally players can place cards into slots of the same color. Then they can take both actions and advantages: the action depicted in the slot on the main board and also the advantage of the card. Actions and advantages can allow players to intake raw materials; to build and upgrade city domes, tunnels and production buildings such as farms, desalination devices and laboratories in their personal underwater area; to move their marker on the initiative track (which is important for player order in the next turn); to activate the player's &quot;A-cards&quot;; and to collect cards, both special ones and basic ones that allow for better decision possibilities during gameplay.&#10;&#10;All of the nearly 220 cards &mdash; whether special or basic &mdash; are divided into five types according to the way and time of use. Underwater areas are planned to be double-sided, giving players many opportunities to achieve VPs and finally win.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":80,"maxPlayTime":150,"minAge":12,"categoriesAndMechanics":["Card Game","City Building","Civilization","Industry / Manufacturing","Nautical","Science Fiction","End Game Bonuses","Hand Management","Income","Network and Route Building","Solo / Solitaire Game","Turn Order: Claim Action","Turn Order: Stat-Based","Worker Placement"],"rating":4.03442,"complexity":3.5971,"urlThumb":"https://cf.geekdo-images.com/PwOwTVHovJAUQgghnGqCOg__thumb/img/1gGYiRBx7W4wyLy826EHGTdjsKA=/fit-in/200x150/filters:strip_icc()/pic4837710.png","urlImage":"https://cf.geekdo-images.com/PwOwTVHovJAUQgghnGqCOg__original/img/1WL5-4DZi0hX76HEgsLIYRRaIh4=/0x0/filters:format(png)/pic4837710.png"},{"bggId":"3076","name":"Puerto Rico","description":"In Puerto Rico, players assume the roles of colonial governors on the island of Puerto Rico. The aim of the game is to amass victory points by shipping goods to Europe or by constructing buildings.&#10;&#10;Each player uses a separate small board with spaces for city buildings, plantations, and resources. Shared between the players are three ships, a trading house, and a supply of resources and doubloons.&#10;&#10;The resource cycle of the game is that players grow crops which they exchange for points or doubloons. Doubloons can then be used to buy buildings, which allow players to produce more crops or give them other abilities. Buildings and plantations do not work unless they are manned by colonists.&#10;&#10;During each round, players take turns selecting a role card from those on the table (such as &quot;Trader&quot; or &quot;Builder&quot;). When a role is chosen, every player gets to take the action appropriate to that role. The player that selected the role also receives a small privilege for doing so - for example, choosing the &quot;Builder&quot; role allows all players to construct a building, but the player who chose the role may do so at a discount on that turn. Unused roles gain a doubloon bonus at the end of each turn, so the next player who chooses that role gets to keep any doubloon bonus associated with it. This encourages players to make use of all the roles throughout a typical course of a game.&#10;&#10;Puerto Rico uses a variable phase order mechanism in which a &quot;governor&quot; token is passed clockwise to the next player at the conclusion of a turn. The player with the token begins the round by choosing a role and taking the first action.&#10;&#10;Players earn victory points for owning buildings, for shipping goods, and for manned &quot;large buildings.&quot; Each player's accumulated shipping chips are kept face down and come in denominations of one or five. This prevents other players from being able to determine the exact score of another player. Goods and doubloons are placed in clear view of other players and the totals of each can always be requested by a player. As the game enters its later stages, the unknown quantity of shipping tokens and its denominations require players to consider their options before choosing a role that can end the game.&#10;&#10;In 2011 and mostly afterwards, Puerto Rico was published to include both Puerto Rico: Expansion I &ndash; New Buildings and Puerto Rico: Expansion II &ndash; The Nobles. These versions are included in the other game entry Puerto Rico, not this regular game entry for Puerto Rico. Some editions of Puerto Rico list the player count as 2-5 instead of 3-5, and they include variant rules for games with only two players.&#10;&#10;","minPlayers":3,"maxPlayers":5,"minPlayTime":90,"maxPlayTime":150,"minAge":12,"categoriesAndMechanics":["City Building","Economic","Farming","Action Drafting","End Game Bonuses","Follow","Hidden Victory Points","Increase Value of Unchosen Resources","Turn Order: Progressive","Variable Phase Order"],"rating":3.960465,"complexity":3.27,"urlThumb":"https://cf.geekdo-images.com/QFiIRd2kimaMqTyWsX0aUg__thumb/img/5fLo89ChZH6Wzukk36bhZ-EpBS0=/fit-in/200x150/filters:strip_icc()/pic158548.jpg","urlImage":"https://cf.geekdo-images.com/QFiIRd2kimaMqTyWsX0aUg__original/img/DOgIp57F7tKZvxeITGAd3e_Q9as=/0x0/filters:format(jpeg)/pic158548.jpg"},{"bggId":"366013","name":"Heat: Pedal to the Metal","description":"Based on simple and intuitive hand management, Heat: Pedal to the Metal puts players in the driver's seat of intense car races, jockeying for position to cross the finish line first, while managing their car's speed if they don't want to overheat. Selecting the right upgrades for their car will help them hug the curves and keep their engine cool enough to maintain top speeds. Ultimately, their driving skills will be the key to victory!&#10;&#10;Drivers can compete in a single race or use the &quot;Championship System&quot; to play a whole season in one game night, customizing their car before each race to claim the top spot of the podium. They have to be careful as the weather, road conditions, and events will change every race to spice up their championship. Players can also enjoy a solo mode with the Legends Module or add automated drivers as additional opponents in multiplayer games.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Racing","Sports","Catch the Leader","Deck, Bag, and Pool Building","Hand Management","Programmed Movement","Push Your Luck","Race","Simulation","Simultaneous Action Selection","Solo / Solitaire Game","Track Movement","Variable Set-up"],"rating":4.04357,"complexity":2.1896,"urlThumb":"https://cf.geekdo-images.com/-vOrd4bOspibyohYExLqWg__thumb/img/2GbaKvYOzWIxfgbYTk2R9puiyzo=/fit-in/200x150/filters:strip_icc()/pic6940449.png","urlImage":"https://cf.geekdo-images.com/-vOrd4bOspibyohYExLqWg__original/img/iXU8a9WaVlwrkiEiOxWN06y9y5g=/0x0/filters:format(png)/pic6940449.png"},{"bggId":"295947","name":"Cascadia","description":"Cascadia is a puzzly tile-laying and token-drafting game featuring the habitats and wildlife of the Pacific Northwest.&#10;&#10;In the game, you take turns building out your own terrain area and populating it with wildlife. You start with three hexagonal habitat tiles (with the five types of habitat in the game), and on a turn you choose a new habitat tile that's paired with a wildlife token, then place that tile next to your other ones and place the wildlife token on an appropriate habitat. (Each tile depicts 1-3 types of wildlife from the five types in the game, and you can place at most one tile on a habitat.) Four tiles are on display, with each tile being paired at random with a wildlife token, so you must make the best of what's available &mdash; unless you have a nature token to spend so that you can pick your choice of each item.&#10;&#10;Ideally you can place habitat tiles to create matching terrain that reduces fragmentation and creates wildlife corridors, mostly because you score for the largest area of each type of habitat at game's end, with a bonus if your group is larger than each other player's. At the same time, you want to place wildlife tokens so that you can maximize the number of points scored by them, with the wildlife goals being determined at random by one of the four scoring cards for each type of wildlife. Maybe hawks want to be separate from other hawks, while foxes want lots of different animals surrounding them and bears want to be in pairs. Can you make it happen?&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":45,"minAge":10,"categoriesAndMechanics":["Animals","Environmental","Puzzle","End Game Bonuses","Hexagon Grid","Open Drafting","Pattern Building","Solo / Solitaire Game","Tile Placement","Variable Set-up","Victory Points as a Resource"],"rating":3.981575,"complexity":1.842,"urlThumb":"https://cf.geekdo-images.com/MjeJZfulbsM1DSV3DrGJYA__thumb/img/tVSFjSxYEcw7sKj3unIIQV8kxoc=/fit-in/200x150/filters:strip_icc()/pic5100691.jpg","urlImage":"https://cf.geekdo-images.com/MjeJZfulbsM1DSV3DrGJYA__original/img/B374C04Eip7fmQBGJzgiOTp-jyQ=/0x0/filters:format(jpeg)/pic5100691.jpg"},{"bggId":"102794","name":"Caverna: The Cave Farmers","description":"Following along the same lines as its predecessor (Agricola), Caverna: The Cave Farmers is a worker-placement game at heart, with a focus on farming. In the game, you are the bearded leader of a small dwarf family that lives in a little cave in the mountains. You begin the game with a farmer and his spouse, and each member of the farming family represents an action that the player can take each turn. Together, you cultivate the forest in front of your cave and dig deeper into the mountain. You furnish the caves as dwellings for your offspring as well as working spaces for small enterprises.&#10;&#10;It's up to you how much ore you want to mine. You will need it to forge weapons that allow you to go on expeditions to gain bonus items and actions. While digging through the mountain, you may come across water sources and find ore and ruby mines that help you increase your wealth. Right in front of your cave, you can increase your wealth even further with agriculture: You can cut down the forest to sow fields and fence in pastures to hold your animals. You can also expand your family while running your ever-growing farm. In the end, the player with the most efficiently developed home board wins.&#10;&#10;You can also play the solo variant of this game to familiarize yourself with the 48 different furnishing tiles for your cave.&#10;&#10;Caverna: The Cave Farmers, which has a playing time of roughly 30 minutes per player, is a complete redesign of Agricola that substitutes the card decks from the former game with a set of buildings while adding the ability to purchase weapons and send your farmers on quests to gain further resources. Designer Uwe Rosenberg says that the game includes parts of Agricola, but also has new ideas, especially the cave part of your game board, where you can build mines and search for rubies. The game also includes two new animals: dogs and donkeys.&#10;&#10;","minPlayers":1,"maxPlayers":7,"minPlayTime":30,"maxPlayTime":210,"minAge":12,"categoriesAndMechanics":["Animals","Economic","Fantasy","Farming","Automatic Resource Growth","Increase Value of Unchosen Resources","Solo / Solitaire Game","Tile Placement","Turn Order: Claim Action","Worker Placement"],"rating":3.97507,"complexity":3.7798,"urlThumb":"https://cf.geekdo-images.com/rz22tqa5PCYvK9oDjIbvxg__thumb/img/3Ae-ieYpDv6w0vuNsGjOmXdcCrU=/fit-in/200x150/filters:strip_icc()/pic1790789.jpg","urlImage":"https://cf.geekdo-images.com/rz22tqa5PCYvK9oDjIbvxg__original/img/h9il8XnFB0iqHNHsNTPNGxJZWdM=/0x0/filters:format(jpeg)/pic1790789.jpg"},{"bggId":"170216","name":"Blood Rage","description":"&quot;Life is Battle; Battle is Glory; Glory is ALL&quot;&#10;&#10;In Blood Rage, each player controls their own Viking clan&rsquo;s warriors, leader, and ship. Ragnar&ouml;k has come, and it&rsquo;s the end of the world! It&rsquo;s the Vikings&rsquo; last chance to go down in a blaze of glory and secure their place in Valhalla at Odin&rsquo;s side! For a Viking there are many pathways to glory. You can invade and pillage the land for its rewards, crush your opponents in epic battles, fulfill quests, increase your clan's stats, or even die gloriously either in battle or from Ragnar&ouml;k, the ultimate inescapable doom.&#10;&#10;Most player strategies are guided by the cards drafted at the beginning of each of the three game rounds (or Ages). These &ldquo;Gods&rsquo; Gifts&rdquo; grant you numerous boons for your clan including: increased Viking strength and devious battle strategies, upgrades to your clan, or even the aid of legendary creatures from Norse mythology. They may also include various quests, from dominating specific provinces, to having lots of your Vikings sent to Valhalla. Most of these cards are aligned with one of the Norse gods, hinting at the kind of strategy they support. For example, Thor gives more glory for victory in battle, Heimdall grants you foresight and surprises, Tyr strengthens you in battle, while the trickster Loki actually rewards you for losing battles, or punishes the winner.&#10;&#10;Players must choose their strategies carefully during the draft phase, but also be ready to adapt and react to their opponents&rsquo; strategies as the action phase unfolds. Battles are decided not only by the strength of the figures involved, but also by cards played in secret. By observing your opponent&rsquo;s actions and allegiances to specific gods, you may predict what card they are likely to play, and plan accordingly. Winning battles is not always the best course of action, as the right card can get you even more rewards by being crushed. The only losing strategy in Blood Rage is to shy away from battle and a glorious death!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":90,"minAge":14,"categoriesAndMechanics":["Fantasy","Fighting","Miniatures","Mythology","Action Points","Area Majority / Influence","Area Movement","Card Play Conflict Resolution","Closed Drafting","Hand Management","Map Reduction","Memory","Open Drafting","Simultaneous Action Selection"],"rating":3.967185,"complexity":2.8781,"urlThumb":"https://cf.geekdo-images.com/HkZSJfQnZ3EpS214xtuplg__thumb/img/NLhVdU8xazrgS5dA6nVCYmN2DNI=/fit-in/200x150/filters:strip_icc()/pic2439223.jpg","urlImage":"https://cf.geekdo-images.com/HkZSJfQnZ3EpS214xtuplg__original/img/Myy6IPDJDzLoPdXrPXVZcddBQoQ=/0x0/filters:format(jpeg)/pic2439223.jpg"},{"bggId":"521","name":"Crokinole","description":"Crokinole is a traditional dexterity game.&#10;&#10;Crokinole is played on a circular wooden board, with wooden circular disks as playing pieces.&#10;&#10;Players take turns shooting disks across the circular wooden board by flicking the disks with their fingers.  Players try to land their disks in scoring regions on the board, with the highest scoring area the recessed hole in the very center of the board.  Each round, each player/side alternately shoots a set number of disks (usually 12 or 8), shooting one disk each turn.&#10;&#10;As a traditional game, there are often many variations played, but the following method is based on the National Crokinole Association's rules which also govern the World Crokinole Championship.&#10;&#10;Players must position their disk on the start of each of their turns in their quadrant in front of them, touching the outer scoring ring boundary.&#10;&#10;If there are no opponent's disks on the board, they must aim for the center of the board.&#10;&#10;If there is an opponent's disk on the board, they must aim and hit an opponent's piece first, either directly, or by a carrom shot.&#10;&#10;The center recessed hole is worth 20 points, and disks are removed and scored at the end of the round if they land in the center hole.&#10;&#10;Disks that are outside the outer scoring ring at the end of each shot, or are touching the outer scoring ring at the end of each shot, are removed from play for the round.&#10;&#10;Scoring is by cancellation scoring (e.g. Player/Side One scores 250, and Player/Side Two scores 225, Player/Side One scores 25.)&#10;&#10;It is usually played as a two-player game or as a four-player game with partners.&#10;&#10;Play is to a set score, usually the first player/side to 100.&#10;&#10;Alternately, play is set at &quot;Match Scoring&quot; where the winner of each round scores 2 points, and if a tie, each player scores 1 point. A &quot;game&quot; is usually played to four rounds, with the winner of each &quot;game&quot; being the one with the most points. The numbers of &quot;games&quot; in a match is set by the tournament.&#10;&#10;The World Crokinole Championship uses &quot;Match Scoring.&quot;&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Action / Dexterity","Flicking","Team-Based Game"],"rating":4.01679,"complexity":1.2341,"urlThumb":"https://cf.geekdo-images.com/7ejbxsn-UtLl3ehamuAEdw__thumb/img/AX0pNTuAzpUfxlvtwirM6zAK4ws=/fit-in/200x150/filters:strip_icc()/pic79413.jpg","urlImage":"https://cf.geekdo-images.com/7ejbxsn-UtLl3ehamuAEdw__original/img/HJOZG6y87_skppfIqX-voRlhNxE=/0x0/filters:format(jpeg)/pic79413.jpg"},{"bggId":"185343","name":"Anachrony","description":"It is the late 26th century. Earth is recovering from a catastrophic explosion that exterminated the majority of the population centuries ago and made most of the surface uninhabitable due to unearthly weather conditions. The surviving humans organized along four radically different ideologies, called Paths, to rebuild the world as they see fit: Harmony, Dominance, Progress, and Salvation. Followers of the four Paths live in a fragile peace, but in almost complete isolation next to each other. Their only meeting point is the last major city on Earth, now just known as the Capital.&#10;&#10;By powering up the mysterious Time Rifts that opened in the wake of the cataclysm, each Path is able to reach back to specific moments in their past. Doing so can greatly speed up their progress, but too much meddling may endanger the time-space continuum. But progress is more important than ever before: if the mysterious message arriving through the Time Rift is to be believed, an even more terrible cataclysm is looming on the horizon: an asteroid bearing the mysterious substance called Neutronium is heading towards Earth. Even stranger, the scientists show that the energy signature of the asteroid matches the explosion centuries ago...&#10;&#10;Anachrony features a unique two-tiered worker placement system. To travel to the Capital or venture out to the devastated areas for resources, players need not only various specialists (Engineers, Scientists, Administrators, and Geniuses) but also Exosuits to protect and enhance them &mdash; and both are in short supply.&#10;&#10;The game is played in 4-7 turns, depending on the time when the looming cataclysm occurs &mdash; unless, of course, it is averted! The elapsed turns are measured on a dynamic timeline. By powering up the Time Rifts, players can reach back to earlier turns to supply their past &quot;self&quot; with resources. Each Path has a vastly different objective that rewards it with a massive amount of victory points when achieved. The Paths' settlements will survive the impact, but the Capital will not. Whichever Path manages to collect most points will be the new seat for the Capital, thus the most important force left on the planet...&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":120,"minAge":15,"categoriesAndMechanics":["Economic","Science Fiction","Dice Rolling","Solo / Solitaire Game","Turn Order: Claim Action","Variable Player Powers","Worker Placement","Worker Placement, Different Worker Types"],"rating":4.038835,"complexity":4.0152,"urlThumb":"https://cf.geekdo-images.com/31quLNzteInnevVRAABoow__thumb/img/a0G93aMOKp3_mmnCURYWuZd210U=/fit-in/200x150/filters:strip_icc()/pic3499707.jpg","urlImage":"https://cf.geekdo-images.com/31quLNzteInnevVRAABoow__original/img/3KfMPSj7jjhG0g5lQBsO-bn67D0=/0x0/filters:format(jpeg)/pic3499707.jpg"},{"bggId":"184267","name":"On Mars","description":"Following the success of unmanned rover missions, the United Nations established the Department of Operations and Mars Exploration (D.O.M.E.). The first settlers arrived on Mars in the year 2037 and in the decades after establishment Mars Base Camp, private exploration companies began work on the creation of a self-sustaining colony. As chief astronaut for one of these enterprises, you want to be a pioneer in the development of the biggest, most advanced colony on Mars by achieving both D.O.M.E. mission goals as well as your company&rsquo;s private agenda.&#10;&#10;In the beginning, you will be dependent on supplies from Earth and will have to travel often between the Mars Space Station and the planet's surface. As the colony expands over time, you will shift your activities to construct mines, power generators, water extractors, greenhouses, oxygen factories, and shelters. Your goal is to develop a self-sustaining colony independent of any terrestrial organization. This will require understanding the importance of water, air, power, and food &mdash; the necessities for survival.&#10;&#10;Do you dare take part in humankind&rsquo;s biggest challenge?&#10;&#10;On Mars is played over several rounds, each consisting of two phases - the Colonization Phase &#226;&#128;&#139;and the Shuttle Phase&#226;&#128;&#139;.&#10;&#10;During the Colonization Phase, each player takes a turn during which they take actions. The available actions depend on the side of the board they are on. If you are in orbit, you can take blueprints, buy and develop technologies, and take supplies from the Warehouse. If you are on the surface of the planet, you can construct buildings with your bots, upgrade these buildings using blueprints, take scientists and new contracts, welcome new ships, and explore the planet&rsquo;s surface with your rover. In the Shuttle Phase, players may travel between the colony and the Space Station in orbit.&#10;&#10;All buildings on Mars have a dependency on each other and some are required for the colony to grow. Building shelters for Colonists to live in requires oxygen; generating oxygen requires plants; growing plants requires water; extracting water from ice requires power; generating power requires mining minerals; and mining minerals requires Colonists. Upgrading the colony&rsquo;s ability to provide each of these resources is vital. As the colony grows, more shelters are needed so that the Colonists can survive the inhospitable conditions on Mars.&#10;&#10;During the game, players are also trying to complete missions. Once a total of three missions have been completed, the game ends. To win the game, players must contribute to the development of the first colony on Mars. This is represented during the game by players gaining Opportunity Points (OP). The player with the most OP at the end of the game is declared the winner.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":90,"maxPlayTime":150,"minAge":14,"categoriesAndMechanics":["City Building","Economic","Exploration","Science Fiction","Space Exploration","Territory Building","Contracts","Delayed Purchase","End Game Bonuses","Hexagon Grid","Income","Movement Points","Moving Multiple Units","Set Collection","Solo / Solitaire Game","Tech Trees / Tech Tracks","Tile Placement","Variable Phase Order","Worker Placement"],"rating":4.09946,"complexity":4.6708,"urlThumb":"https://cf.geekdo-images.com/Nm0Iw8NoiM9V8IsifimGBw__thumb/img/4GFbhkEWyIublXmikE2Tep6wSIQ=/fit-in/200x150/filters:strip_icc()/pic4357658.jpg","urlImage":"https://cf.geekdo-images.com/Nm0Iw8NoiM9V8IsifimGBw__original/img/GNjjsgxq7wYO9pSIteDJe6Sxt00=/0x0/filters:format(jpeg)/pic4357658.jpg"},{"bggId":"31260","name":"Agricola","description":"Description from BoardgameNews&#10;&#10;In Agricola, you're a farmer in a wooden shack with your spouse and little else. On a turn, you get to take only two actions, one for you and one for the spouse, from all the possibilities you'll find on a farm: collecting clay, wood, or stone; building fences; and so on. You might think about having kids in order to get more work accomplished, but first you need to expand your house. And what are you going to feed all the little rugrats?&#10;&#10;The game supports many levels of complexity, mainly through the use (or non-use) of two of its main types of cards, Minor Improvements and Occupations. In the beginner's version (called the Family Variant in the U.S. release), these cards are not used at all. For advanced play, the U.S. release includes three levels of both types of cards; Basic (E-deck), Interactive (I-deck), and Complex (K-deck), and the rulebook encourages players to experiment with the various decks and mixtures thereof. Aftermarket decks such as the Z-Deck and the L-Deck also exist.&#10;&#10;Agricola is a turn-based game. There are 14 game rounds occurring in 6 stages, with a Harvest at the end of each stage (after Rounds 4, 7, 9, 11, 13, and 14).&#10;Each player starts with two playing tokens (farmer and spouse) and thus can take two turns, or actions, per round. There are multiple options, and while the game progresses, you'll have more and more: first thing in a round, a new action card is flipped over.&#10;Problem: Each action can be taken by only one player each round, so it's important to do some things with high preference.&#10;Each player also starts with a hand of 7 Occupation cards (of more than 160 total) and 7 Minor Improvement cards (of more than 140 total) that he/she may use during the game if they fit in his/her strategy. Speaking of which, there are countless strategies, some depending on your card hand. Sometimes it's a good choice to stay on course, and sometimes it is better to react to your opponents' actions...&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":30,"maxPlayTime":150,"minAge":12,"categoriesAndMechanics":["Animals","Economic","Farming","Automatic Resource Growth","Closed Drafting","Enclosure","Hand Management","Increase Value of Unchosen Resources","Solo / Solitaire Game","Turn Order: Claim Action","Variable Player Powers","Worker Placement"],"rating":3.939725,"complexity":3.6369,"urlThumb":"https://cf.geekdo-images.com/dDDo2Hexl80ucK1IlqTk-g__thumb/img/GHGdnCfeysoP_34gLnofJcNivW8=/fit-in/200x150/filters:strip_icc()/pic831744.jpg","urlImage":"https://cf.geekdo-images.com/dDDo2Hexl80ucK1IlqTk-g__original/img/toobKoejPiHpfpHk4SYd1UAJafw=/0x0/filters:format(jpeg)/pic831744.jpg"},{"bggId":"284378","name":"Kanban EV","description":"Electric vehicles (EVs) have become more common since 2014 and are the future of the automobile industry. They are superior vehicles due to them being more efficient, easier to maintain, cleaner, and cheaper to run. They are computerized machines that use AI to improve safety and in the near future will provide autonomous driving. They receive software upgrades during their lifetime and are constantly improving, unlike their traditional combustion-engine counterparts, which start to become obsolete as soon as you start using them.&#10;&#10;You will be overseeing the production of these vehicles in Kanban EV, with &quot;kanban&quot; (&#231;&#156;&#139;&#230;&#157;&#191;) being the name for a scheduling system that supports an efficient assembly line, just-in-time production, and a smooth workflow process. Over the course of the game, players take on the role of rookie employees who are trying to secure their career. You need to manage suppliers and supplies, improve and innovate automobile parts, and get your hands greasy on the assembly line in order to boost production and impress the factory manager.&#10;&#10;You must make shrewd use of the recycling facilities and the limited factory supplies in order to appropriate parts when the suppliers come up short. Because the factory must run at optimum efficiency, production doesn't wait for you or for mistakes. Sandra, the factory manager, will review your performance and keep the factory on tempo.&#10;&#10;Kanban EV is a game that focuses on resource and time management that puts you in the driver's seat of an entire production facility, racing for factory goals and the highest level of promotion. You earn production points (PP) for performing various actions in the game, and the player with the most PP at the end of the game wins.&#10;&#10;&mdash;description from publisher&#10;&#10;Includes solo mode by D&aacute;vid Turczi&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":180,"minAge":14,"categoriesAndMechanics":["Economic","Industry / Manufacturing","Action Points","Hand Management","Variable Phase Order","Worker Placement"],"rating":4.213745,"complexity":4.3183,"urlThumb":"https://cf.geekdo-images.com/L2Wn-zUqkcHgqvwvY212Ig__thumb/img/RQunBacBw949DkYBgzoS5YaXgJo=/fit-in/200x150/filters:strip_icc()/pic4924232.jpg","urlImage":"https://cf.geekdo-images.com/L2Wn-zUqkcHgqvwvY212Ig__original/img/Htra4hvxjBlejtNEIUns_B3CNNc=/0x0/filters:format(jpeg)/pic4924232.jpg"},{"bggId":"255984","name":"Sleeping Gods","description":"&quot;Are the stars unfamiliar here?&quot; she asked, and the sky grew suddenly dark, the star's patterns alien and exotic. &quot;This is the Wandering Sea. The gods have brought you here, and you must wake them if you wish to return home.&quot;&#10;&#10;In Sleeping Gods, you and up to 3 friends become Captain Sofi Odessa and her crew, lost in a strange world in 1929 on your steamship, the Manticore. You must work together to survive, exploring exotic islands, meeting new characters, and seeking out the totems of the gods so that you can return home.&#10;&#10;Sleeping Gods is a campaign game. Each session can last as long as you want. When you are ready to take a break, you mark your progress on a journey log sheet, making it easy to return to the same place in the game the next time you play. You can play solo or with friends throughout your campaign. It's easy to swap players in and out at will. Your goal is to find at least fourteen totems hidden throughout the world. Like reading a book, you'll complete this journey one or two hours at a time, discovering new lands, stories, and challenges along the way.&#10;&#10;Sleeping Gods is an atlas game. Each page of the atlas represents only a small portion of the world you can explore. When you reach the edge of a page and you want to continue in the same direction, you simply turn to a new page and sail onward.&#10;&#10;Sleeping Gods is a storybook game. Each new location holds wild adventure, hidden treasures, and vivid characters. Your choices affect the characters and the plot of the game, and may help or hinder your chances of getting home!&#10;&#10;Welcome to a vast world. Your journey starts now.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":1200,"minAge":13,"categoriesAndMechanics":["Adventure","Exploration","Fantasy","Fighting","Nautical","Action Points","Cooperative Game","Events","Hand Management","Narrative Choice / Paragraph","Push Your Luck","Scenario / Mission / Campaign Game","Solo / Solitaire Game","Storytelling"],"rating":4.120335,"complexity":3.2519,"urlThumb":"https://cf.geekdo-images.com/Zdt8l4oTBpFICsMyNof7Jg__thumb/img/71w4Tt3xOnuDEDTCG8ni63QUhVE=/fit-in/200x150/filters:strip_icc()/pic5975244.png","urlImage":"https://cf.geekdo-images.com/Zdt8l4oTBpFICsMyNof7Jg__original/img/-okZ810RkA8fKKhIeZyX4cnqmbE=/0x0/filters:format(png)/pic5975244.png"},{"bggId":"314040","name":"Pandemic Legacy: Season 0","description":"1962 &mdash; The Cold War continues as a new threat looms on the horizon, a deadly new Soviet bioweapon, something called &quot;Project MEDUSA&quot;. You and your fellow medical graduates have been recruited by the CIA for the critical mission of investigating and preventing its development. Travel the world using carefully constructed aliases to move swiftly between Allied, Neutral, and Soviet cities. Your missions will require you to neutralize enemy agents, acquire specific targets, and set up other CIA agents on location to execute your operations without a hitch. As you complete objectives over the course of twelve months, each success or failure will bring you closer to the truth.&#10;&#10;Combatting this dangerous new pathogen is of utmost importance, but it's not the only threat you'll encounter in the field. Enemy agents are taking root in all parts of the world, and it's critical to your mission that you keep them contained before they can escalate international tensions. Luckily for you, you won't be without backup. Coordinate with other covert operatives for assistance and make strategic use of these teams at different locations to clean up the board and keep your eye on your main objectives.&#10;&#10;Designed as a prequel, Pandemic Legacy: Season 0 does not require you to have completed Season 1 and Season 2 before diving into this Cold War spy thriller. As in the first two Pandemic Legacy games, each time you play brings new cards, rules, and conditions that affect future games. Each alias you create will gain contacts and other assets to execute your plans more smoothly. And, of course, the CIA will be watching and evaluating your performance in the field. Work together with your fellow agents to prevent this new bio-threat &mdash; the fate of the world depends on it. Can you save humanity once again?&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":60,"minAge":14,"categoriesAndMechanics":["Spies/Secret Agents","Action Points","Cooperative Game","Hand Management","Legacy Game","Point to Point Movement","Scenario / Mission / Campaign Game","Set Collection","Tags","Trading","Variable Player Powers"],"rating":4.204445,"complexity":3.1586,"urlThumb":"https://cf.geekdo-images.com/y0x1zbkpUXjddzWWnhekYw__thumb/img/hj0jDCs-hKfkgqG-oOWu-kM-I6E=/fit-in/200x150/filters:strip_icc()/pic5581457.jpg","urlImage":"https://cf.geekdo-images.com/y0x1zbkpUXjddzWWnhekYw__original/img/2VlfzwT4b8f1s2HqbilcjR-bM3I=/0x0/filters:format(jpeg)/pic5581457.jpg"},{"bggId":"221107","name":"Pandemic Legacy: Season 2","description":"Description from the publisher:&#10;&#10;The world almost ended 71 years ago...&#10;&#10;The plague came out of nowhere and ravaged the world. Most died within a week. Nothing could stop it. The world did its best. It wasn't good enough.&#10;&#10;For three generations, we, the last fragments of humanity have lived on the seas, on floating stations called &quot;havens.&quot; Far from the plague, we are able to provide supplies to the mainland to keep them (and us) from succumbing completely.&#10;&#10;We've managed to keep a network of the largest known cities in the world alive. Things have been tough the past few years. Cities far away from the havens have fallen off our grid...&#10;&#10;Tomorrow, a small group of us head out into what's left of the world. We don't know what we'll find.&#10;&#10;Pandemic Legacy: Season 2 is an epic cooperative game for 2 to 4 players. Unlike most other games, this one is working against you. What's more, some of the actions you take in Pandemic Legacy will carry over to future games. No two worlds will ever be alike!&#10;&#10;Part of the Pandemic series.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":60,"minAge":14,"categoriesAndMechanics":["Environmental","Exploration","Medical","Science Fiction","Action Points","Cooperative Game","Hand Management","Legacy Game","Pick-up and Deliver","Point to Point Movement","Set Collection","Tags","Trading","Variable Player Powers"],"rating":4.018565,"complexity":3.2532,"urlThumb":"https://cf.geekdo-images.com/Qtkb-UTvHa0-kxt_MK1nKw__thumb/img/MfKsnJUTx9IQV-o12Fahxx5IaDQ=/fit-in/200x150/filters:strip_icc()/pic3763549.jpg","urlImage":"https://cf.geekdo-images.com/Qtkb-UTvHa0-kxt_MK1nKw__original/img/wJiRr7lBmWSKcRS3lPpvKIPMgQQ=/0x0/filters:format(jpeg)/pic3763549.jpg"},{"bggId":"205059","name":"Mansions of Madness: Second Edition","description":"Mansions of Madness: Second Edition is a fully co-operative, app-driven board game of horror and mystery for one to five players that takes place in the same universe as Eldritch Horror and Elder Sign. Let the immersive app guide you through the veiled streets of Innsmouth and the haunted corridors of Arkham's cursed mansions as you search for answers and respite. Eight brave investigators stand ready to confront four scenarios of fear and mystery, collecting weapons, tools, and information, solving complex puzzles, and fighting monsters, insanity, and death. Open the door and step inside these hair-raising Mansions of Madness: Second Edition. It will take more than just survival to conquer the evils terrorizing this town.&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":120,"maxPlayTime":180,"minAge":14,"categoriesAndMechanics":["Adventure","Exploration","Fighting","Horror","Miniatures","Murder/Mystery","Mythology","Puzzle","Area Movement","Cooperative Game","Dice Rolling","Hand Management","Map Addition","Modular Board","Role Playing","Scenario / Mission / Campaign Game","Solo / Solitaire Game","Stat Check Resolution","Traitor Game","Variable Player Powers"],"rating":3.97588,"complexity":2.6859,"urlThumb":"https://cf.geekdo-images.com/LIooA9bTdjnE9qmhjL-UFw__thumb/img/kwaa7aI2sMeyWV5JSRKcKrS5hC8=/fit-in/200x150/filters:strip_icc()/pic3118622.jpg","urlImage":"https://cf.geekdo-images.com/LIooA9bTdjnE9qmhjL-UFw__original/img/Go6c8-ZiXomS8E7X4MBCdDd-aZc=/0x0/filters:format(jpeg)/pic3118622.jpg"},{"bggId":"161533","name":"Lisboa","description":"Lisboa is a game about the reconstruction of Lisboa after the great earthquake of 1755.&#10;&#10;On November 1, 1755, Lisbon suffered an earthquake of an estimated magnitude of 8.5&ndash;9.0, followed by a tsunami and three days of fires. The city was almost totally destroyed. The Marques of Pombal &mdash; Sebasti&atilde;o Jos&eacute; de Carvalho e Melo &mdash; was the then Minister of Foreign Affairs and the King put him in charge of the reconstruction of Lisbon. The Marques of Pombal gathered a team of engineers and architects and you, the players, are members of the nobility; members who will use your influence in the reconstruction and business development of the new city. You will work with the architects to build Lisbon anew, with the Marquis to develop commerce and with the King to open all the buildings, but the true reason you do all this is not for greatness or fame or even fortune, but for the most important thing of all in that time: wigs.&#10;&#10;Lisboa is played on a real map of downtown Lisbon. During the planning of the downtown project, the type of business permitted in each street was previously determined. The economic motor is driven by the wealth of the royal treasure and this treasure is controlled by player actions during the game, making each game a totally different experience. The game ends after a fixed number of rounds and whoever gathers the most wigs by the end of the game wins.&#10;&#10;Lisboa is played in rounds. Each round, all players play one turn. They may place one card on their display or replace one card from this display. During the game, players schedule hearings to get character favors, such as commerce, construction, and openings. The iconic buildings score the stores and stores provide income to the players. Players need to manage influence, construction licenses, store permits, church power, workers and money, with the workers' cost being dependent on the prestige of the players.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["City Building","Economic","Industry / Manufacturing","Political","Area Majority / Influence","Hand Management","Open Drafting","Solo / Solitaire Game","Tile Placement"],"rating":4.09502,"complexity":4.5842,"urlThumb":"https://cf.geekdo-images.com/OrHS8_a1CqSGiXeTfCk0Wg__thumb/img/ZBTT0qZcD5HMFlhFN7PLMe6zXvg=/fit-in/200x150/filters:strip_icc()/pic3209553.jpg","urlImage":"https://cf.geekdo-images.com/OrHS8_a1CqSGiXeTfCk0Wg__original/img/hVArRkZYHiPTGTfi0DPR58i4o44=/0x0/filters:format(jpeg)/pic3209553.jpg"},{"bggId":"276025","name":"Maracaibo","description":"Maracaibo, a strategy game for 1-4 players by Alexander Pfister, is set in the Caribbean during the 17th century. The players try to increase their influence in three nations in four rounds with a play time of 40 minutes per player.&#10;&#10;The players sail on a round course through the Caribbean, e.g., you have city tiles where you are able to perform various&nbsp;actions or deliver goods to. One special feature is an implemented quest mode over more and various tiles, which tells the player, who chase after it, a little story.&#10;&#10;As a player, you move with your ship around the course, managing it by using cards like in other games from Alexander Pfister.&#10;&#10;&#10;NOTE: The Spanish and Portuguese editions of Maracaibo contain La Armada mini-expansion packaged inside the base game's box.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Economic","Exploration","Nautical","Pirates","Contracts","End Game Bonuses","Events","Hand Management","Income","Movement Points","Multi-Use Cards","Narrative Choice / Paragraph","Point to Point Movement","Scenario / Mission / Campaign Game","Set Collection","Solo / Solitaire Game","Stock Holding","Tech Trees / Tech Tracks","Track Movement","Variable Set-up"],"rating":4.0193,"complexity":3.9144,"urlThumb":"https://cf.geekdo-images.com/rMNa0k05zMdKgSEp26Q3Tw__thumb/img/lVlnhYyxlZb3WuKZJHLoJcFHEjs=/fit-in/200x150/filters:strip_icc()/pic4917407.jpg","urlImage":"https://cf.geekdo-images.com/rMNa0k05zMdKgSEp26Q3Tw__original/img/yhnCcq9UplffqjSCe08mjTFvgOM=/0x0/filters:format(jpeg)/pic4917407.jpg"},{"bggId":"126163","name":"Tzolk'in: The Mayan Calendar","description":"Tzolkin: The Mayan Calendar presents a new game mechanism: dynamic worker placement. Players representing different Mayan tribes place their workers on giant connected gears, and as the gears rotate they take the workers to different action spots.&#10;&#10;During a turn, players can either (a) place one or more workers on the lowest visible spot of the gears or (b) pick up one or more workers. When placing workers, they must pay corn, which is used as a currency in the game. When they pick up a worker, they perform certain actions depending on the position of the worker. Actions located &quot;later&quot; on the gears are more valuable, so it's wise to let the time work for you &ndash; but players cannot skip their turn; if they have all their workers on the gears, they have to pick some up.&nbsp;&#10;&#10;The game ends after one full revolution of the central Tzolkin gear. There are many paths to victory. Pleasing the gods by placing crystal skulls in deep caves or building many temples are just two of those many paths...&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":90,"maxPlayTime":90,"minAge":13,"categoriesAndMechanics":["Ancient","Civilization","Economic","Farming","Mythology","Bias","End Game Bonuses","Turn Order: Claim Action","Worker Placement"],"rating":3.931195,"complexity":3.6672,"urlThumb":"https://cf.geekdo-images.com/kXf7mDyDYuHg6oe8yTUIEA__thumb/img/or9mAn4ClljY_wO_zvsLJDqs9tU=/fit-in/200x150/filters:strip_icc()/pic4604439.jpg","urlImage":"https://cf.geekdo-images.com/kXf7mDyDYuHg6oe8yTUIEA__original/img/f6-Au0KTnNR4nugSu2U-wPNbZCU=/0x0/filters:format(jpeg)/pic4604439.jpg"},{"bggId":"2651","name":"Power Grid","description":"Power Grid is the updated release of the Friedemann Friese crayon game Funkenschlag. It removes the crayon aspect from network building in the original edition, while retaining the fluctuating commodities market like Crude: The Oil Game and an auction round intensity reminiscent of The Princes of Florence.&#10;&#10;The objective of Power Grid is to supply the most cities with power when someone's network gains a predetermined size.  In this new edition, players mark pre-existing routes between cities for connection, and then bid against each other to purchase the power plants that they use to power their cities.&#10;&#10;However, as plants are purchased, newer, more efficient plants become available, so by merely purchasing, you're potentially allowing others access to superior equipment.&#10;&#10;Additionally, players must acquire the raw materials (coal, oil, garbage, and uranium) needed to power said plants (except for the 'renewable' windfarm/ solar plants, which require no fuel), making it a constant struggle to upgrade your plants for maximum efficiency while still retaining enough wealth to quickly expand your network to get the cheapest routes.&#10;&#10;Power Grid FAQ - Please read this before posting a rules question!  Many questions are asked over and over in the forums... If you have a question about a specific expansion, please check the rules forum or FAQ for that particular expansion.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":120,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Economic","Industry / Manufacturing","Auction: Turn Order Until Pass","Auction/Bidding","Catch the Leader","Income","Market","Network and Route Building","Turn Order: Stat-Based","Variable Set-up"],"rating":3.907135,"complexity":3.2546,"urlThumb":"https://cf.geekdo-images.com/yd6LuatytHRhcFCxCf-EEg__thumb/img/jWTonZ5oYNlPzpELKHIJGWSS0Y8=/fit-in/200x150/filters:strip_icc()/pic4459753.jpg","urlImage":"https://cf.geekdo-images.com/yd6LuatytHRhcFCxCf-EEg__original/img/OS13C6W4i1XW__wWVVVaqF7BV0c=/0x0/filters:format(jpeg)/pic4459753.jpg"},{"bggId":"253344","name":"Cthulhu: Death May Die","description":"In Cthulhu: Death May Die, inspired by the writings of H.P. Lovecraft, you and your fellow players represent investigators in the 1920s who instead of trying to stop the coming of Elder Gods, want to summon those otherworldly beings so that you can put a stop to them permanently. You start the game insane, and while your long-term goal is to shoot Cthulhu in the face, so to speak, at some point during the game you'll probably fail to mitigate your dice rolls properly and your insanity will cause you to do something terrible &mdash; or maybe advantageous. Hard to know for sure.&#10;&#10;The game has multiple episodes, and each of them has a similar structure of two acts, those being before and after you summon whatever it is you happen to be summoning. If any character dies prior to the summoning, then the game ends and you lose; once the Elder One is on the board, as long as one of you is still alive, you still have a chance to win.&#10;&#10;The episodes are all standalone and not contingent on being played in a certain order or with the same players.&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":90,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Fantasy","Fighting","Horror","Miniatures","Novel-based","Action Points","Area Movement","Cooperative Game","Dice Rolling","Role Playing","Scenario / Mission / Campaign Game","Solo / Solitaire Game","Variable Player Powers"],"rating":4.092655,"complexity":2.4569,"urlThumb":"https://cf.geekdo-images.com/e8D09pfFsUsoX1D81EeoZg__thumb/img/j03wBmZg1Kp5QaaIu9p-O8XRqeU=/fit-in/200x150/filters:strip_icc()/pic4705171.jpg","urlImage":"https://cf.geekdo-images.com/e8D09pfFsUsoX1D81EeoZg__original/img/8_FKwPd8bBL3PFjef8Yjz_sFWSk=/0x0/filters:format(jpeg)/pic4705171.jpg"},{"bggId":"244521","name":"The Quacks of Quedlinburg","description":"In The Quacks of Quedlinburg, players are charlatans &mdash; or quack doctors &mdash; each making their own secret brew by adding ingredients one at a time. Take care with what you add, though, for a pinch too much of this or that will spoil the whole mixture!&#10;&#10;Each player has their own bag of ingredient chips. During each round, they simultaneously draw chips from their bags and add them to their pots. The higher the face value of the drawn chip, the further it is placed in the pot's swirling pattern, increasing how much the potion will be worth. Push your luck as far as you can, but if you add too many cherry bombs, your pot will explode!&#10;&#10;At the end of each round, players gain victory points and coins to spend on new ingredients, depending on how well they managed to fill up their pots. But players whose pots have exploded must choose points or coins &mdash; not both! The player with the most victory points at the end of nine rounds wins the game.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":45,"minAge":10,"categoriesAndMechanics":["Medieval","Catch the Leader","Deck, Bag, and Pool Building","Delayed Purchase","Dice Rolling","Events","Open Drafting","Push Your Luck","Simultaneous Action Selection","Variable Set-up"],"rating":3.915045,"complexity":1.9473,"urlThumb":"https://cf.geekdo-images.com/pH5LgRL4mNRon-2NsSDb1Q__thumb/img/E_XspsgbgrVOwOeCuZMO1S8W2rk=/fit-in/200x150/filters:strip_icc()/pic6137509.png","urlImage":"https://cf.geekdo-images.com/pH5LgRL4mNRon-2NsSDb1Q__original/img/8PEJOyuKGbTaEGbUbCoLQy_i65Y=/0x0/filters:format(png)/pic6137509.png"},{"bggId":"216132","name":"Clans of Caledonia","description":"Clans of Caledonia is a mid-to-heavy economic game set in 19th-century Scotland. At this time, Scotland made the transition from an agricultural to an industrialized country that heavily relied on trade and export. In the following years, food production increased significantly to feed the population growth. Linen was increasingly substituted by the cheaper cotton and raising sheep was given high importance. More and more distilleries were founded and whisky became the premium alcoholic beverage in Europe.&#10;&#10;Players represent historic clans with unique abilities and compete to produce, trade and export agricultural goods and of course whisky!&#10;&#10;The game ends after five rounds. Each round consists of the three phases:&#10;&#10;&#10;     Players' turns&#10;     Production phase&#10;     Round scoring&#10;&#10;&#10;1. Players take turns and do one of eight possible actions, from building, to upgrading, trading and exporting. When players run out of money, they pass and collect a passing bonus.&#10;&#10;2. In the production phase, each player collects basic resources, refined goods and cash from their production units built on the game map. Each production unit built makes income visible on the player mat. Refined goods require the respective basic resource.&#10;&#10;3. Players receive VPs depending on the scoring tile of the current round.&#10;&#10;The game comes with eight different clans, a modular board with 16 configurations, eight port bonuses and eight round scoring tiles.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Economic","Farming","Commodity Speculation","Contracts","Market","Modular Board","Network and Route Building","Solo / Solitaire Game","Turn Order: Pass Order","Variable Player Powers"],"rating":3.9731,"complexity":3.4553,"urlThumb":"https://cf.geekdo-images.com/SPuwc6RJ6y4PnTH36Pegsg__thumb/img/M_6Yxp0A_NbebWk3Mepinsm96WI=/fit-in/200x150/filters:strip_icc()/pic3511783.png","urlImage":"https://cf.geekdo-images.com/SPuwc6RJ6y4PnTH36Pegsg__original/img/GcuvCavv-ZZP5_O1kCTrZELuZdY=/0x0/filters:format(png)/pic3511783.png"},{"bggId":"231733","name":"Obsession","description":"You are the head of a respected but troubled family estate in mid-19th century Victorian England. After several lean decades, family fortunes are looking up! Your goal is to improve your estate so as to be in better standing with the truly influential families in Derbyshire.&#10;&#10;Obsession is a game of 16 to 20 turns in which players build a deck of Victorian gentry (British social upper class), renovate their estate by acquiring building tiles from a centralized builders' market, and manipulate an extensive service staff of butlers, housekeepers, underbutlers, maids, valets, and footmen utilizing a novel worker placement mechanic. Successfully hosting prestigious social activities such as Fox Hunts, Music Recitals, Billiards, Political Debates, and Grand Balls increases a player's wealth, reputation, and connections among the elite.&#10;&#10;Each turn, players choose a building tile representing a room or outdoor space in and around their 19th century British country house. The tile chosen dictates the event that can be hosted and the guests to be invited. Players must carefully plan, however, to have the proper staff available to service the event and support guests as needed. The reward for success is new investment opportunities, permitting further renovation of the estate (acquisition of more valuable/powerful building tiles), an increase in reputation in the county, an expanding circle of influential acquaintances, and a larger and highly-trained domestic staff.&#10;&#10;Throughout the game, a competitive courtship for the hand of the most eligible young gentleman and lady in the county presents specific renovation and reputation objectives. The player who best meets these objectives while accumulating victory points will win the hand of the wealthy love interest and the game.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":90,"minAge":14,"categoriesAndMechanics":["Post-Napoleonic","Action Retrieval","Deck, Bag, and Pool Building","Hand Management","Open Drafting","Solo / Solitaire Game","Worker Placement","Worker Placement, Different Worker Types"],"rating":4.080155,"complexity":3.1108,"urlThumb":"https://cf.geekdo-images.com/sy89BiuZXfbSnG7Cag9tBQ__thumb/img/eTnMwfCC2jCGDPXC08SIaMXNOTM=/fit-in/200x150/filters:strip_icc()/pic5902073.png","urlImage":"https://cf.geekdo-images.com/sy89BiuZXfbSnG7Cag9tBQ__original/img/uArsqbWyUALa982zGWsy8QQWnjE=/0x0/filters:format(png)/pic5902073.png"},{"bggId":"35677","name":"Le Havre","description":"In Le Havre, a player's turn consists of two parts: First, distribute newly supplied goods onto the offer spaces; then take an action. As an action, players may choose either to take all goods of one type from an offer space or to use one of the available buildings. Building actions allow players to upgrade goods, sell them or use them to build their own buildings and ships. Buildings are both an investment opportunity and a revenue stream, as players must pay an entry fee to use buildings that they do not own. Ships, on the other hand, are primarily used to provide the food that is needed to feed the workers.&#10;&#10;After every seven turns, the round ends: players' cattle and grain may multiply through a Harvest, and players must feed their workers. After a fixed number of rounds, each player may carry out one final action, and then the game ends. Players add the value of their buildings and ships to their cash reserves. The player who has amassed the largest fortune is the winner.&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":30,"maxPlayTime":150,"minAge":12,"categoriesAndMechanics":["City Building","Economic","Industry / Manufacturing","Nautical","Automatic Resource Growth","End Game Bonuses","Increase Value of Unchosen Resources","Loans","Ownership","Solo / Solitaire Game","Worker Placement"],"rating":3.92556,"complexity":3.7199,"urlThumb":"https://cf.geekdo-images.com/y7Rqd3S6J7vyVhicR1bqTQ__thumb/img/w1iHoYZCVTDZI6gsPuxOScA7FqU=/fit-in/200x150/filters:strip_icc()/pic6091101.jpg","urlImage":"https://cf.geekdo-images.com/y7Rqd3S6J7vyVhicR1bqTQ__original/img/tQFXv1w2R-J-1cjyaKG9LAS2UOs=/0x0/filters:format(jpeg)/pic6091101.jpg"},{"bggId":"182874","name":"Grand Austria Hotel","description":"In the thick of the Viennese modern age, exquisite caf&eacute;s are competing for customers. Inspiring artists, important politicians, and tourists from all over the world are populating Vienna and in need of a hotel room. This is your opportunity to turn your little caf&eacute; into a world famous hotel. Hire staff, fulfill the wishes of your guests, and gain the emperor's favor. Only then will your caf&eacute; become the Grand Austria Hotel.&#10;&#10;The start player rolls the dice, sorting them by the rolled number and placing them on the corresponding action spaces. On a turn, a player chooses one of the six actions and carries it out. The number of the available dice in the corresponding action spaces determines how much the player gets from the action. They then remove one of the dice and can carry out additional actions. With the different actions, a player can get the necessary drinks and dishes, prepare the rooms, or hire staff.&#10;&#10;But no hotel can grow without guests. To choose wisely which guests to attract and to complete their orders brings some important bonus actions. The staff cards also have different advantages, but the game ends after seven rounds and no player can do everything they want, so whoever makes the right decisions and finds the best way to create bonus actions will win.&#10;&#10;With 116 different cards and a new set-up in each game, Grand Austria Hotel provides a huge replay value. Each game stands on its own and demands new tactics and strategies.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Economic","Action Drafting","Contracts","Dice Rolling","End Game Bonuses","Hand Management","Set Collection","Variable Set-up"],"rating":3.969925,"complexity":3.2117,"urlThumb":"https://cf.geekdo-images.com/GlCmHjdLwv3SqSjv52ToGw__thumb/img/WXzXZh50EGKd1U2fg75fCbFIL_8=/fit-in/200x150/filters:strip_icc()/pic6966955.jpg","urlImage":"https://cf.geekdo-images.com/GlCmHjdLwv3SqSjv52ToGw__original/img/5vNCdK9mQ0szo_SwSeVQUWnirZ8=/0x0/filters:format(jpeg)/pic6966955.jpg"},{"bggId":"266810","name":"Paladins of the West Kingdom","description":"Paladins of the West Kingdom is set at a turbulent time of West Francia's story, circa 900 AD. Despite recent efforts to develop the city, outlying townships are still under threat from outsiders. Saracens scout the borders, while Vikings plunder wealth and livestock. Even the Byzantines from the east have shown their darker side. As noble men and women, players must gather workers from the city to defend against enemies, build fortifications and spread faith throughout the land. Fortunately you are not alone. In his great wisdom, the King has sent his finest knights to help aid in our efforts. So ready the horses and sharpen the swords. The Paladins are approaching.&#10;&#10;The aim of Paladins of the West Kingdom is to be the player with the most victory points (VP) at game's end. Points are gained by building outposts and fortifications, commissioning monks and confronting outsiders. Each round, players will enlist the help of a specific Paladin and gather workers to carry out tasks. As the game progresses, players will slowly increase their faith, strength and influence. Not only will these affect their final score, but they will also determine the significance of their actions. The game is concluded at the end of the seventh round.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":90,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Medieval","End Game Bonuses","Market","Open Drafting","Solo / Solitaire Game","Worker Placement","Worker Placement, Different Worker Types"],"rating":3.99309,"complexity":3.7254,"urlThumb":"https://cf.geekdo-images.com/4nhokcLdYoo6ulbZ1rmGgA__thumb/img/1gEbke_bKTA6D2jjpPm1HowGGHM=/fit-in/200x150/filters:strip_icc()/pic4462987.png","urlImage":"https://cf.geekdo-images.com/4nhokcLdYoo6ulbZ1rmGgA__original/img/9ktZDu003VVVTw0RxD-ufLYV1HQ=/0x0/filters:format(png)/pic4462987.png"},{"bggId":"164153","name":"Star Wars: Imperial Assault","description":"Star Wars: Imperial Assault is a strategy board game of tactical combat and missions for two to five players, offering two distinct games of battle and adventure in the Star Wars universe!&#10;&#10;Imperial Assault puts you in the midst of the Galactic Civil War between the Rebel Alliance and the Galactic Empire after the destruction of the Death Star over Yavin 4. In this game, you and your friends can participate in two separate games. The campaign game pits the limitless troops and resources of the Galactic Empire against a crack team of elite Rebel operatives as they strive to break the Empire&rsquo;s hold on the galaxy, while the skirmish game invites you and a friend to muster strike teams and battle head-to-head over conflicting objectives.&#10;&#10;In the campaign game, Imperial Assault invites you to play through a cinematic tale set in the Star Wars universe. One player commands the seemingly limitless armies of the Galactic Empire, threatening to extinguish the flame of the Rebellion forever. Up to four other players become heroes of the Rebel Alliance, engaging in covert operations to undermine the Empire&rsquo;s schemes. Over the course of the campaign, both the Imperial player and the Rebel heroes gain new experience and skills, allowing characters to evolve as the story unfolds.&#10;&#10;Imperial Assault offers a different game experience in the skirmish game. In skirmish missions, you and a friend compete in head-to-head, tactical combat. You&rsquo;ll gather your own strike force of Imperials, Rebels, and Mercenaries and build a deck of command cards to gain an unexpected advantage in the heat of battle. Whether you recover lost holocrons or battle to defeat a raiding party, you&rsquo;ll find danger and tactical choices in every skirmish.&#10;&#10;As an additional benefit, the Luke Skywalker Ally Pack and the Darth Vader Villain Pack are included within the Imperial Assault Core Set. These figure packs offer sculpted plastic figures alongside additional campaign and skirmish missions that highlight both Luke Skywalker and Darth Vader within Imperial Assault.&#10;&#10;With these Imperial Assault and other Figure Packs, you'll find even more missions that allow your heroes to fight alongside iconic characters from the Star Wars saga. Boxed expansions add more heroes, imperial and mercenary groups, and totally new campaigns (see IA Community Wiki for a list), and the free Star Wars: Imperial Assault &#226;&#128;&#147; Legends of the Alliance app provides you with additional content to play in solo or co-op mode.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":60,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Adventure","Exploration","Fighting","Miniatures","Movies / TV / Radio theme","Science Fiction","Wargame","Dice Rolling","Die Icon Resolution","Grid Movement","Line of Sight","Modular Board","Role Playing","Scenario / Mission / Campaign Game","Solo / Solitaire Game","Square Grid","Team-Based Game","Variable Player Powers"],"rating":3.983805,"complexity":3.306,"urlThumb":"https://cf.geekdo-images.com/pIQ_MXvaoARRp1loCHJuHg__thumb/img/AD5YvNSUaVvITmtQb1-b01VuBbs=/fit-in/200x150/filters:strip_icc()/pic2247647.jpg","urlImage":"https://cf.geekdo-images.com/pIQ_MXvaoARRp1loCHJuHg__original/img/12Xvbw01hpsAjsO0xrajZt2b5HY=/0x0/filters:format(jpeg)/pic2247647.jpg"},{"bggId":"125153","name":"The Gallerist","description":"This age of art and capitalism has created a need for a new occupation - The Gallerist.&#10;&#10;Combining the elements of an Art dealer, museum curator, and Artists&rsquo; manager, you are about to take on that job! You will promote and nurture Artists; buy, display, and sell their Art; and build and exert your international reputation. As a result, you will achieve the respect needed to draw visitors to your Gallery from all over the world.&#10;&#10;There's a lot of work to be done, but don't worry, you can hire assistants to help you achieve your goals. Build your fortune by running the most lucrative Gallery and secure your reputation as a world-class Gallerist!&#10;&#10;Maximize your money and thus win the game by: &#10;&#10;     having visitors in your gallery; &#10;     exhibiting and selling works of art;&#10;     investing in artists&rsquo; promotion to increase art value;&#10;     achieving trends and reputation as well as curator and dealer goals.&#10;&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":150,"minAge":13,"categoriesAndMechanics":["Economic","Area Majority / Influence","Commodity Speculation","Contracts","Investment","Open Drafting","Point to Point Movement","Resource to Move","Set Collection","Solo / Solitaire Game","Victory Points as a Resource","Worker Placement","Worker Placement, Different Worker Types"],"rating":4.012465,"complexity":4.2508,"urlThumb":"https://cf.geekdo-images.com/ie1GSt1XV04sXQXt-3O1UQ__thumb/img/O0H84AvXp139U865gRLGiAo9-gA=/fit-in/200x150/filters:strip_icc()/pic2503200.png","urlImage":"https://cf.geekdo-images.com/ie1GSt1XV04sXQXt-3O1UQ__original/img/59dZRZePEgtcupkRSA2zohZuHpM=/0x0/filters:format(png)/pic2503200.png"},{"bggId":"284083","name":"The Crew: The Quest for Planet Nine","description":"In the co-operative trick-taking game The Crew: The Quest for Planet Nine, the players set out as astronauts on an uncertain space adventure. What are the rumors regarding the unknown planet about? The eventful journey through space extends over 50 exciting missions. But this game can only be defeated by meeting common individual tasks of each player. In order to meet the varied challenges communication is essential in the team. But this is more difficult than expected in space.&#10;&#10;With each mission the game becomes more difficult. After each mission the game can be paused and continued later. During each mission it is not the number of tricks but the right tricks at the right time that count.&#10;&#10;The team completes a mission only if every single player is successful in fulfilling their tasks.&#10;&#10;The game comes with 50 missions, with three additional missions published in spielbox 2/2020.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":20,"maxPlayTime":20,"minAge":10,"categoriesAndMechanics":["Card Game","Science Fiction","Space Exploration","Communication Limits","Cooperative Game","Hand Management","Scenario / Mission / Campaign Game","Trick-taking"],"rating":3.90753,"complexity":1.9572,"urlThumb":"https://cf.geekdo-images.com/98LnQShydr11OBKS46xY-Q__thumb/img/et-fnuozyOdBOVL-5kSS3_7I8fw=/fit-in/200x150/filters:strip_icc()/pic5687013.jpg","urlImage":"https://cf.geekdo-images.com/98LnQShydr11OBKS46xY-Q__original/img/Q-ZkgnuBu9OTBr7J3qnqPjqamAE=/0x0/filters:format(jpeg)/pic5687013.jpg"},{"bggId":"209010","name":"Mechs vs. Minions","description":"Mechs vs. Minions is a cooperative tabletop campaign for 2-4 players. Set in the world of Runeterra, players take on the roles of four intrepid Yordles: Corki, Tristana, Heimerdinger, and Ziggs, who must join forces and pilot their newly-crafted mechs against an army of marauding minions. With modular boards, programmatic command lines, and a story-driven campaign, each mission will be unique, putting your teamwork, programming, and piloting skills to the test.&#10;&#10;There are ten missions in total, and each individual mission will take about 60-90 minutes. The box includes five game boards, four command lines (one for each player), four painted mech miniatures, ability and damage decks, a sand timer, a bomb-like-power source miniature, 6 metal trackers, 4 acrylic shards, 4 dice, and 100 minion miniatures.  There also appears to be some large object trying to get out of that sealed box...&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Fantasy","Fighting","Miniatures","Video Game Theme","Action Queue","Bias","Cooperative Game","Dice Rolling","Modular Board","Open Drafting","Programmed Movement","Role Playing","Slide/Push","Variable Player Powers"],"rating":3.98704,"complexity":2.443,"urlThumb":"https://cf.geekdo-images.com/n4J5LebMj0DQD016qW7ABw__thumb/img/Nbu-AYVIop-1yvVfs5zjKowtlEQ=/fit-in/200x150/filters:strip_icc()/pic3184103.jpg","urlImage":"https://cf.geekdo-images.com/n4J5LebMj0DQD016qW7ABw__original/img/KDP4s1942J-T52OEytY2VpUWZC0=/0x0/filters:format(jpeg)/pic3184103.jpg"},{"bggId":"124742","name":"Android: Netrunner","description":"Welcome to New Angeles, home of the Beanstalk. From our branch offices in this monument of human achievement, NBN proudly broadcasts all your favorite media programming. We offer fully comprehensive streaming in music and threedee, news and sitcoms, classic movies and sensies. We cover it all. Ours is a brave new age, and as humanity hurtles into space and the future with an astonishing series of new advances every day, NBN and our affiliates are keeping pace, bringing you all the vid that's fit to view.&#10;&#10;Android: Netrunner is an asymmetrical Living Card Game for two players. Set in the cyberpunk future of Android and Infiltration, the game pits a megacorporation and its massive resources against the subversive talents of lone runners.&#10;&#10;Corporations seek to score agendas by advancing them. Doing so takes time and credits. To buy the time and earn the credits they need, they must secure their servers and data forts with &quot;ice&quot;. These security programs come in different varieties, from simple barriers, to code gates and aggressive sentries. They serve as the corporation's virtual eyes, ears, and machine guns on the sprawling information superhighways of the network.&#10;&#10;In turn, runners need to spend their time and credits acquiring a sufficient wealth of resources, purchasing the necessary hardware, and developing suitably powerful ice-breaker programs to hack past corporate security measures. Their jobs are always a little desperate, driven by tight timelines, and shrouded in mystery. When a runner jacks-in and starts a run at a corporate server, he risks having his best programs trashed or being caught by a trace program and left vulnerable to corporate countermeasures. It's not uncommon for an unprepared runner to fail to bypass a nasty sentry and suffer massive brain damage as a result. Even if a runner gets through a data fort's defenses, there's no telling what it holds. Sometimes, the runner finds something of value. Sometimes, the best he can do is work to trash whatever the corporation was developing.&#10;&#10;The first player to seven points wins the game, but not likely before he suffers some brain damage or bad publicity.&#10;&#10;The Revised Core Set for Android: Netrunner released in late 2017 includes cards from the original Core Set released in 2012 as well as cards from the Genesis Cycle and Spin Cycle series of Data Packs. While the cards in this set have been released previously, the art on some of them is new.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":45,"maxPlayTime":45,"minAge":14,"categoriesAndMechanics":["Bluffing","Card Game","Collectible Components","Science Fiction","Action Points","Deck Construction","Hand Management","Race","Secret Unit Deployment","Take That","Variable Player Powers"],"rating":3.940355,"complexity":3.4053,"urlThumb":"https://cf.geekdo-images.com/2ewHIIG_TRq8bYlqk0jIMw__thumb/img/IJaOyyQ7Y59tW6nbKbjTMTFt-Ls=/fit-in/200x150/filters:strip_icc()/pic3738560.jpg","urlImage":"https://cf.geekdo-images.com/2ewHIIG_TRq8bYlqk0jIMw__original/img/cassW39WF2QrPImJF59efADAmM0=/0x0/filters:format(jpeg)/pic3738560.jpg"},{"bggId":"55690","name":"Kingdom Death: Monster","description":"Kingdom Death: Monster is a fully cooperative tabletop hobby game experience.  Set in a unique nightmarish world devoid of most natural resources, you control a settlement at the dawn of its existence. Fight monsters, craft weapons and gear, and develop your settlement to ensure your survival from generation to generation.&#10;&#10;Campaign System&#10;Embark alone or with up to 3 friends (5 with game variant) on a 5-30-lantern-year campaign, with each year consisting of a cycle of hunt, showdown, and settlement phases. The settlement phase is an intricate civilization building game in which you spend very limited resources to build buildings, research new technologies, train your warriors, and set up your strategy for survival.  During the hunt, you'll encounter a series of stories in a &quot;choose your own adventure&quot; style journey through various events and encounters.  Finally, when you meet the monster you're pursuing, you'll engage it in an a massive arena-style battle where only one party is going to survive.  If your party lives, you'll be able to bring the spoils back home to use in expanding your settlement.&#10;&#10;Monster AI System&#10;Each of the 7 monsters included are controlled by their own pair of decks that scale to 3 levels of difficulty (except for the final encounter, which has only 1 level and it's HARD!). Every encounter, even with the same monster, is highly variable and no two showdowns will resolve the same way. Players will have to plan their gear and keep their minds sharp to prevail.&#10;&#10;Gear System&#10;In Kingdom Death: Monster, survivors will craft gear from resources earned from defeating monsters or found on their hunt. Each survivor has a 3x3 gear grid. Selection and arrangement of your gear cards is critical, as many provided bonuses and activate special rules when aligned correctly.&#10;&#10;Story Event System&#10;40+ Story Events plus over 100 hunt encounters will shape and guide your campaign. Story Events detail important evolutions in your civilization, introduce new monsters, and provide rich detail for your campaign.  Some will trigger automatically as you progress through the campaign, but most will be entirely based on choices players make.&#10;&#10;Story Events cover everything from setting up and fighting a monster to key events that happen within the overall story. Some are triggered directly from the timeline and others from choices you make in game.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":180,"minAge":17,"categoriesAndMechanics":["Adventure","Fantasy","Fighting","Horror","Mature / Adult","Miniatures","Mythology","Cooperative Game","Critical Hits and Failures","Dice Rolling","Grid Movement","Role Playing","Scenario / Mission / Campaign Game","Solo / Solitaire Game","Storytelling"],"rating":4.251035,"complexity":4.2609,"urlThumb":"https://cf.geekdo-images.com/LenzJBOHboAGU0cUIqAZPQ__thumb/img/Z3yFJIp9rmSmcGoTiqGeTkKCnQU=/fit-in/200x150/filters:strip_icc()/pic2931007.jpg","urlImage":"https://cf.geekdo-images.com/LenzJBOHboAGU0cUIqAZPQ__original/img/-dnx4zkvdOn3CMVHpXIfESazj40=/0x0/filters:format(jpeg)/pic2931007.jpg"},{"bggId":"230802","name":"Azul","description":"Introduced by the Moors, azulejos (originally white and blue ceramic tiles) were fully embraced by the Portuguese when their king Manuel I, on a visit to the Alhambra palace in Southern Spain, was mesmerized by the stunning beauty of the Moorish decorative tiles. The king, awestruck by the interior beauty of the Alhambra, immediately ordered that his own palace in Portugal be decorated with similar wall tiles. As a tile-laying artist, you have been challenged to embellish the walls of the Royal Palace of Evora.&#10;&#10;In the game Azul, players take turns drafting colored tiles from suppliers to their player board. Later in the round, players score points based on how they've placed their tiles to decorate the palace. Extra points are scored for specific patterns and completing sets; wasted supplies harm the player's score. The player with the most points at the end of the game wins.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":45,"minAge":8,"categoriesAndMechanics":["Abstract Strategy","Puzzle","Renaissance","End Game Bonuses","Open Drafting","Pattern Building","Set Collection","Tile Placement","Turn Order: Claim Action"],"rating":3.876775,"complexity":1.7635,"urlThumb":"https://cf.geekdo-images.com/aPSHJO0d0XOpQR5X-wJonw__thumb/img/ccsXKrdGJw-YSClWwzVUwk5Nh9Y=/fit-in/200x150/filters:strip_icc()/pic6973671.png","urlImage":"https://cf.geekdo-images.com/aPSHJO0d0XOpQR5X-wJonw__original/img/AkbtYVc6xXJF3c9EUrakklcclKw=/0x0/filters:format(png)/pic6973671.png"},{"bggId":"200680","name":"Agricola (Revised Edition)","description":"Updated and streamlined for a new generation of players, Agricola, the award-winning and highly acclaimed game by Uwe Rosenberg, features a revised rulebook and gameplay, along with wood pieces and components for up to four players.&#10;&#10;The 17th century was not an easy time to be a farmer.  A game for 1-4 players ages 12 and up; play time is 30 minutes per player. Amazing replay value. The Agricola base game is a revised edition of Uwe Rosenberg&rsquo;s celebrated classic. The game features improved all-wood components and a card selection from the base game as well as its expansions, revised and updated for this edition. Players begin the game with two family members and can grow their families over the course of the game. This allows them more actions but remember you have to grow more food to feed your family as it grows! Feeding your family is a special kind of challenge and players will plant grain and vegetables while supplementing their food supply with sheep, wild boar and cattle. Guide your family to wealth, health and prosperity and you will win the game.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Animals","Economic","Farming","Enclosure","Hand Management","Worker Placement","Advantage Token","Automatic Resource Growth","Closed Drafting","Increase Value of Unchosen Resources","Solo / Solitaire Game","Team-Based Game","Turn Order: Claim Action","Variable Player Powers"],"rating":3.97995,"complexity":3.4545,"urlThumb":"https://cf.geekdo-images.com/Vf_0TrTfz9yll7rVBvYGsg__thumb/img/booIzVH8Wg4YJa7hIvzgIqwV25Y=/fit-in/200x150/filters:strip_icc()/pic3029377.jpg","urlImage":"https://cf.geekdo-images.com/Vf_0TrTfz9yll7rVBvYGsg__original/img/K6dtSMTAibW5f0QhHXo37CeuECc=/0x0/filters:format(jpeg)/pic3029377.jpg"},{"bggId":"28143","name":"Race for the Galaxy","description":"2018 UPDATE: The second edition of the game is improved for CVD (color blindness) and includes 5 revised cards from the original version and 6 New Worlds promo homeworlds. The promo homeworlds and first edition compatible Revised Cards are both available for purchase through the BGG store.&#10;&#10;In the card game Race for the Galaxy, players build galactic civilizations by playing game cards in front of them that represent worlds or technical and social developments. Some worlds allow players to produce goods, which can be consumed later to gain either card draws or victory points when the appropriate technologies are available to them. These are mainly provided by the developments and worlds that are not able to produce, but the fancier production worlds also give these bonuses.&#10;&#10;At the beginning of each round, players each select, secretly and simultaneously, one of the seven roles which correspond to the phases in which the round progresses. By selecting a role, players activate that phase for this round, giving each player the opportunity to perform that phase's action. For example, if one player chooses the settle role, each player has the opportunity to settle one of the planets from their hand. The player who has chosen the role, however, gets a bonus that applies only to them. But bonuses may also be acquired through developments, so you must be aware when another player also takes advantage of your choice of role.&#10;&#10;UPC 655132003018&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Card Game","Civilization","Economic","Science Fiction","Space Exploration","Follow","Hand Management","Income","Market","Multi-Use Cards","Set Collection","Simultaneous Action Selection","Tags","Turn Order: Role Order","Variable Phase Order","Variable Player Powers"],"rating":3.872405,"complexity":2.9906,"urlThumb":"https://cf.geekdo-images.com/-DOqixs8uwKUvvWPKI4f9w__thumb/img/xLs-ldTPwaADbvzkOpF0sgWzwck=/fit-in/200x150/filters:strip_icc()/pic5261714.jpg","urlImage":"https://cf.geekdo-images.com/-DOqixs8uwKUvvWPKI4f9w__original/img/Vh-DCkTPa8OU45LaJdUywwhiYqE=/0x0/filters:format(jpeg)/pic5261714.jpg"},{"bggId":"157354","name":"Five Tribes: The Djinns of Naqala","description":"Crossing into the Land of 1001 Nights, your caravan arrives at the fabled Sultanate of Naqala. The old sultan just died and control of Naqala is up for grabs! The oracles foretold of strangers who would maneuver the Five Tribes to gain influence over the legendary city-state. Will you fulfill the prophecy? Invoke the old Djinns and move the Tribes into position at the right time, and the Sultanate may become yours!&#10;&#10;Designed by Bruno Cathala, Five Tribes builds on a long tradition of German-style games that feature wooden meeples. Here, in a unique twist on the now-standard &quot;worker placement&quot; genre, the game begins with the meeples already in place &ndash; and players must cleverly maneuver them over the villages, markets, oases, and sacred places tiles that make up Naqala. How, when, and where you dis-place these Five Tribes of Assassins, Elders, Builders, Merchants, and Viziers determine your victory or failure.&#10;&#10;As befitting a Days of Wonder game, the rules are straightforward and easy to learn. But devising a winning strategy will take a more calculated approach than our standard fare. You need to carefully consider what moves can score you well and put your opponents at a disadvantage. You need to weigh many different pathways to victory, including the summoning of powerful Djinns that may help your cause as you attempt to control this legendary Sultanate.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":40,"maxPlayTime":80,"minAge":13,"categoriesAndMechanics":["Arabian","Fantasy","Mythology","Auction/Bidding","Constrained Bidding","End Game Bonuses","Hidden Victory Points","Mancala","Modular Board","Set Collection","Square Grid","Take That","Turn Order: Auction","Variable Player Powers","Variable Set-up","Victory Points as a Resource"],"rating":3.88746,"complexity":2.8475,"urlThumb":"https://cf.geekdo-images.com/dmo-WD6HZHVUPrbVHunaTw__thumb/img/I6KVJlQgS1GfWDPSWAFNqce4Cgc=/fit-in/200x150/filters:strip_icc()/pic2055255.jpg","urlImage":"https://cf.geekdo-images.com/dmo-WD6HZHVUPrbVHunaTw__original/img/PS9HXrThM8Pepbd-cuA1tX8KCYU=/0x0/filters:format(jpeg)/pic2055255.jpg"},{"bggId":"72125","name":"Eclipse: New Dawn for the Galaxy","description":"The galaxy has been a peaceful place for many years. After the ruthless Terran&ndash;Hegemony War (30.027&ndash;33.364), much effort has been employed by all major spacefaring species to prevent the terrifying events from repeating themselves. The Galactic Council was formed to enforce precious peace, and it has taken many courageous efforts to prevent the escalation of malicious acts. Nevertheless, tension and discord are growing among the seven major species and in the Council itself. Old alliances are shattering, and hasty diplomatic treaties are made in secrecy. A confrontation of the superpowers seems inevitable &ndash; only the outcome of the galactic conflict remains to be seen. Which faction will emerge victorious and lead the galaxy under its rule?&#10;&#10;A game of Eclipse places you in control of a vast interstellar civilization, competing for success with its rivals. You will explore new star systems, research technologies, and build spaceships with which to wage war. There are many potential paths to victory, so you need to plan your strategy according to the strengths and weaknesses of your species, while paying attention to the other civilizations' endeavors.&#10;&#10;The shadows of the great civilizations are about to eclipse the galaxy. Lead your people to victory!&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":60,"maxPlayTime":180,"minAge":14,"categoriesAndMechanics":["Civilization","Fighting","Science Fiction","Space Exploration","Wargame","Dice Rolling","Grid Movement","Hexagon Grid","Map Addition","Modular Board","Player Elimination","Tile Placement","Variable Phase Order","Variable Player Powers"],"rating":3.91713,"complexity":3.7042,"urlThumb":"https://cf.geekdo-images.com/cnFppsVNOSTJ-W3APQFuTg__thumb/img/X8XQO2_mRl7HRSzzOEgoKrWulj4=/fit-in/200x150/filters:strip_icc()/pic1974056.jpg","urlImage":"https://cf.geekdo-images.com/cnFppsVNOSTJ-W3APQFuTg__original/img/AbcjscBi-x3tVrsJsBhXq2RxLbc=/0x0/filters:format(jpeg)/pic1974056.jpg"},{"bggId":"201808","name":"Clank!: A Deck-Building Adventure","description":"Burgle your way to adventure in the deck-building board game Clank! Sneak into an angry dragon's mountain lair to steal precious artifacts. Delve deeper to find more valuable loot. Acquire cards for your deck and watch your thievish abilities grow.&#10;&#10;Be quick and be quiet. One false step and CLANK! Each careless sound draws the attention of the dragon, and each artifact stolen increases its rage. You can enjoy your plunder only if you make it out of the depths alive!&#10;&#10;Clank! is a deck-building game. Each player has their own deck, and building yours up is part of playing the game. You start each of your turns with five cards in your hand, and you'll play them all in any order you choose. Most cards will generate resources, of which there are three different kinds:&#10;&#10;&#10;    Skill, which is used to acquire new cards for your deck.&#10;    Swords, which are used to fight the monsters that infest the dungeon.&#10;    Boots, which are used to move around the board.&#10;&#10;&#10;Every time you acquire a new card, you put it face up in your discard pile. Whenever you need to draw a card and find your deck empty, you shuffle your discard pile and turn it face down to form a new deck. With each shuffle, your newest cards become part of a bigger and better deck! Each player starts with the same cards in their deck, but they&rsquo;ll acquire different cards during their turns. Because cards can do many different things, each player&rsquo;s deck (and strategy) will become more and more different as the game unfolds.&#10;&#10;During the game, you have two goals:&#10;&#10;    Retrieve an Artifact token and escape the dragon by returning to the place you started, outside of the dungeon.&#10;    Accumulate enough points with your Artifact and other loot to beat out your opponents and earn the title of Greatest Thief in the Realm!&#10;&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Adventure","Fantasy","Action Points","Deck, Bag, and Pool Building","Delayed Purchase","End Game Bonuses","Movement Points","Open Drafting","Player Elimination","Point to Point Movement","Push Your Luck","Variable Set-up"],"rating":3.891015,"complexity":2.2252,"urlThumb":"https://cf.geekdo-images.com/DPjV1iI0ygo5Bl3XLNRiIg__thumb/img/O2WnqJew5gNjQqPUH3gqmTBc1pQ=/fit-in/200x150/filters:strip_icc()/pic4449526.jpg","urlImage":"https://cf.geekdo-images.com/DPjV1iI0ygo5Bl3XLNRiIg__original/img/cXqOdM3BLyIeRt0GP3M3V--gF1M=/0x0/filters:format(jpeg)/pic4449526.jpg"},{"bggId":"191189","name":"Aeon's End","description":"The survivors of a long-ago invasion have taken refuge in the forgotten underground city of Gravehold. There, the desperate remnants of society have learned that the energy of the very breaches the beings use to attack them can be repurposed through various gems, transforming the malign energies within into beneficial spells and weapons to aid their last line of defense: the breach mages.&#10;&#10;Aeon's End is a cooperative game that explores the deckbuilding genre with a number of innovative mechanisms, including a variable turn order system that simulates the chaos of an attack, and deck management rules that require careful planning with every discarded card. Players will struggle to defend Gravehold from The Nameless and their hordes using unique abilities, powerful spells, and, most importantly of all, their collective wits.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":60,"minAge":14,"categoriesAndMechanics":["Card Game","Fantasy","Fighting","Science Fiction","Chit-Pull System","Cooperative Game","Deck, Bag, and Pool Building","Delayed Purchase","Hand Management","Open Drafting","Solo / Solitaire Game","Variable Phase Order","Variable Player Powers","Variable Set-up"],"rating":3.954405,"complexity":2.8089,"urlThumb":"https://cf.geekdo-images.com/d50LceHj6LIafa4S_qIsCg__thumb/img/KMFA-gXm_LbZpyXSAHbIZm-eAcQ=/fit-in/200x150/filters:strip_icc()/pic3189350.jpg","urlImage":"https://cf.geekdo-images.com/d50LceHj6LIafa4S_qIsCg__original/img/4MsKNGm47PU9BGW4i2yamMlRSQ0=/0x0/filters:format(jpeg)/pic3189350.jpg"},{"bggId":"251661","name":"Oathsworn: Into the Deepwood","description":"Oathsworn is a Twisting Tales Game for 1-4 players where play is focused on narrative choices and rich miniature combat encounters. The game is set in the Deepwood where a Free company (the Oathsworn) fights for humanity's survival against unnatural horrors and the Deepwood itself.&#10;&#10;Each gaming session sees the players participate in a multi path game book where the story unfolds to an inevitable encounter. The encounters are multi phase scripted boss fights on the encounter board where players have to outwit and outplay the AI driven monsters and enemies. As the sessions unfold the group is taken into a deep legacy campaign where they gain levels, loot and new allies to join them in their journey.&#10;&#10;Oathsworn boasts a unique push your luck combat system of exploding dice where players are always having to decide between hitting harder and potentially missing the attack. This coupled with a euro style cooldown system called 'Battleflow' makes for a vibrant and engaging play session.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":90,"minAge":14,"categoriesAndMechanics":["Adventure","Card Game","Dice","Exploration","Fantasy","Fighting","Miniatures","Mythology","Puzzle","Action Points","Card Play Conflict Resolution","Cooperative Game","Deck, Bag, and Pool Building","Dice Rolling","Hand Management","Hexagon Grid","Legacy Game","Modular Board","Pattern Recognition","Push Your Luck","Role Playing","Scenario / Mission / Campaign Game","Storytelling","Variable Player Powers"],"rating":4.51335,"complexity":3.6276,"urlThumb":"https://cf.geekdo-images.com/dezQ4YjF03lZVxTdI-UJYw__thumb/img/ddtxNyNC1fPEi5M-uc-dQyNovws=/fit-in/200x150/filters:strip_icc()/pic6863204.jpg","urlImage":"https://cf.geekdo-images.com/dezQ4YjF03lZVxTdI-UJYw__original/img/smV4u2r1moRbzsSTzykECb06Mpo=/0x0/filters:format(jpeg)/pic6863204.jpg"},{"bggId":"159675","name":"Fields of Arle","description":"Welcome to Arle&#10;In Fields of Arle, created by Uwe Rosenberg, one to two players live as farmers in the small and peaceful town of Arle in East Frisia. The flax grown in the land surrounding the village makes it a profitable place to work and live. Fields of Arle takes players through four and a half years of this era of prosperity, with different opportunities available as the seasons change. Farm the land to capitalize on the demand for flax, or find other ways to make the most of the small town&rsquo;s prosperity.&#10;&#10;Work the Land&#10;Whether you delve into flax farming or leverage other areas of expertise, always make sure that you have the land to build up your village. Construct dikes to keep the waters at bay and expand your fields. Dry out bogs to harvest peat and then clear the land for cultivation. Create more fields for your livestock, buildings, or future crops; after that, you can decide whether to house animals or cultivate a forest for timber. Perhaps you&rsquo;d like to take up some flax farming for yourself, or diversify and try out a little bit of everything.&#10;&#10;Tools of the Trade&#10;At the outset of each half year, you&rsquo;ll choose how you&rsquo;d like to spend that time working. There are many ways to build your fortune. Use the Master space to increase the tools at your disposal, focus on the Cattle Trainer to make the most of your livestock, or build up your fleet of vehicles and ship out goods. Taking stock of your progress differs depending on the season. You may milk your existing livestock or care for a bunch of newborn animals. You could harvest your flax in the fall, and sheer your sheep in spring. At the end of each half year, you&rsquo;ll need to take stock of your progress by unloading your vehicles and feeding your family and animals, so keep an eye on the season and do your best to keep the farm growing and everyone well fed!&#10;&#10;Travel and Prosper&#10;Once you&rsquo;ve made headway in clearing fields and stocking up goods, it's time to make your products available to potential buyers. The more vehicles you have, the more goods you can ship. Send things into the wide world to increase your Travel Experience and grant you points over the course of the four and a half years of the game. Build up your farm and your vehicles and get your goods out into the world to make the most of every season. There are many roads to success in Fields of Arle, so pick your path, work the land, and enjoy the friendly competition as you strive to make your fortune!&#10;&#10;- from the publisher's website&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":120,"minAge":13,"categoriesAndMechanics":["Economic","Farming","Industry / Manufacturing","Automatic Resource Growth","Highest-Lowest Scoring","Income","Set Collection","Solo / Solitaire Game","Turn Order: Claim Action","Turn Order: Progressive","Worker Placement"],"rating":4.016495,"complexity":3.8494,"urlThumb":"https://cf.geekdo-images.com/0w8go6cfvlpgJKydHUkDtA__thumb/img/0z1o-kU2xYwmVO8oNszdt1V4K54=/fit-in/200x150/filters:strip_icc()/pic2225968.png","urlImage":"https://cf.geekdo-images.com/0w8go6cfvlpgJKydHUkDtA__original/img/322N77t8F7uTev-U_WCqX5uqmEE=/0x0/filters:format(png)/pic2225968.png"},{"bggId":"317985","name":"Beyond the Sun","description":"Beyond the Sun is a space civilization game in which players collectively decide the technological progress of humankind at the dawn of the Spacefaring Era, while competing against each other to be the leading faction in economic development, science, and galactic influence.&#10;&#10;The game is played over a variable number of rounds until a number of game-end achievements are collectively claimed by the players. The winner is the faction with the most victory points, which are obtained by researching technologies, improving their economy, controlling and colonizing systems, and completing various achievements and events throughout the game.&#10;&#10;On a turn, a player moves their action pawn to an empty action space, then takes that action. They then conduct their production phase, either producing ore, growing their population, or trading one of those resources for another. Finally, they can claim up to one achievement, if possible.&#10;&#10;As players take actions, they research new technologies that come in four levels. Each technology is one of four types (scientific, economic, military, commercial), and higher-level technologies must match one of the types of tech that lead into it. Thus, players create their own technology tree in each game, using these actions to increase their military strength, to jump to different habitable exoplanetary systems, to colonize those systems, to boost their resource production, to develop android tech that allows growth without population, and more.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Civilization","Science Fiction","Space Exploration","Area Majority / Influence","Contracts","Events","Income","Point to Point Movement","Tech Trees / Tech Tracks","Worker Placement"],"rating":3.969795,"complexity":3.128,"urlThumb":"https://cf.geekdo-images.com/BfEHqHQAvZLbRX7y7e9TWg__thumb/img/6rZLxebQyTXasbAPddxpdE1LVls=/fit-in/200x150/filters:strip_icc()/pic5617866.jpg","urlImage":"https://cf.geekdo-images.com/BfEHqHQAvZLbRX7y7e9TWg__original/img/h2NEwLqn5mNkcEfMdP_8oMWa9KE=/0x0/filters:format(jpeg)/pic5617866.jpg"},{"bggId":"229853","name":"Teotihuacan: City of Gods","description":"Travel back in time to the greatest city in Mesoamerica. Witness the glory and the twilight of the powerful pre-Columbian civilization. Strategize, accrue wealth, gain the favour of the gods, and become the builder of the magnificent Pyramid of the Sun.&#10;&#10;In Teotihuacan: City of Gods, each player commands a force of worker dice, which grow in strength with every move. On your turn, you move a worker around a modular board, always choosing one of two areas of the location tile you land on: one offering you an action (and a worker upgrade), the other providing you with a powerful bonus (but without an upgrade).&#10;&#10;While managing their workforce and resources, players develop new technologies, climb the steps of the three great temples, build houses for the inhabitants of the city, and raise the legendary and breath-taking Pyramid of the Sun in the center of the city.&#10;&#10;Each game is played in three eras. As the dawn of the Aztecs comes closer, player efforts (and their ability to feed their workforce) are evaluated a total of three times. The player with the most fame is the winner.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":90,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Ancient","Area Movement","Rondel","Set Collection","Solo / Solitaire Game","Tile Placement","Track Movement","Variable Set-up","Worker Placement with Dice Workers"],"rating":3.93456,"complexity":3.7794,"urlThumb":"https://cf.geekdo-images.com/wW5xjgBJcFyLaEWZwrYuKA__thumb/img/MppmP7GtDAfKiB5LiAl-ZtPxOPE=/fit-in/200x150/filters:strip_icc()/pic4583626.jpg","urlImage":"https://cf.geekdo-images.com/wW5xjgBJcFyLaEWZwrYuKA__original/img/72kzn6t41ZxLEr3GFd8ir6hDdH4=/0x0/filters:format(jpeg)/pic4583626.jpg"},{"bggId":"25613","name":"Through the Ages: A Story of Civilization","description":"Through the Ages is a civilization building game. Each player attempts to build the best civilization through careful resource management, discovering new technologies, electing the right leaders, building wonders and maintaining a strong military. Weakness in any area can be exploited by your opponents. The game takes place throughout the ages beginning in the age of antiquity and ending in the modern age.&#10;&#10;One of the primary mechanisms in TTA is card drafting. Technologies, wonders, and leaders come into play and become easier to draft the longer they are in play. In order to use a technology you will need enough science to discover it, enough food to create a population to man it and enough resources (ore) to build the building to use it. While balancing the resources needed to advance your technology you also need to build a military. Military is built in the same way as civilian buildings. Players that have a weak military will be preyed upon by other players. There is no map in the game so you cannot lose territory, but players with higher military will steal resources, science, kill leaders, take population or culture. It is very difficult to win with a large military, but it is very easy to lose because of a weak one.&#10;&#10;Victory is achieved by the player whose nation has the most culture at the end of the modern age.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":120,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Civilization","Economic","Action Points","Auction: Dutch","Auction/Bidding","Hand Management","Open Drafting"],"rating":3.92406,"complexity":4.1766,"urlThumb":"https://cf.geekdo-images.com/3piN3YX4WmBRuIvbEG2Ygg__thumb/img/TDXIygWwAHKc2o90uGnnAhIa7_4=/fit-in/200x150/filters:strip_icc()/pic236169.jpg","urlImage":"https://cf.geekdo-images.com/3piN3YX4WmBRuIvbEG2Ygg__original/img/9it-9V5tij-EnowN_pLXQgl6k7c=/0x0/filters:format(jpeg)/pic236169.jpg"},{"bggId":"110327","name":"Lords of Waterdeep","description":"Game description from the publisher:&#10;&#10;Waterdeep, the City of Splendors &ndash; the most resplendent jewel in the Forgotten Realms, and a den of political intrigue and shady back-alley dealings. In this game, the players are powerful lords vying for control of this great city. Its treasures and resources are ripe for the taking, and that which cannot be gained through trickery and negotiation must be taken by force!&#10;&#10;In Lords of Waterdeep, a strategy board game for 2-5 players, you take on the role of one of the masked Lords of Waterdeep, secret rulers of the city. Through your agents, you recruit adventurers to go on quests on your behalf, earning rewards and increasing your influence over the city. Expand the city by purchasing new buildings that open up new actions on the board, and hinder &ndash; or help &ndash; the other lords by playing Intrigue cards to enact your carefully laid plans.&#10;&#10;During the course of play, you may gain points or resources through completing quests, constructing buildings, playing intrigue cards or having other players utilize the buildings you have constructed.  At the end of 8 rounds of play, the player who has accrued the most points wins the game.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":60,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["City Building","Fantasy","Contracts","Hidden Roles","Increase Value of Unchosen Resources","Ownership","Set Collection","Take That","Turn Order: Claim Action","Worker Placement"],"rating":3.86725,"complexity":2.4534,"urlThumb":"https://cf.geekdo-images.com/-hk8f8iGk_DyWyMrfiPBkg__thumb/img/dBqYOO8uLXAumxUGuYtuiRGQ1Y8=/fit-in/200x150/filters:strip_icc()/pic1116080.jpg","urlImage":"https://cf.geekdo-images.com/-hk8f8iGk_DyWyMrfiPBkg__original/img/GWNOhno3y7g0XE00VacKaRxoczk=/0x0/filters:format(jpeg)/pic1116080.jpg"},{"bggId":"62219","name":"Dominant Species","description":"90,000 B.C. &mdash; A great ice age is fast approaching. Another titanic struggle for global supremacy has unwittingly commenced between the varying animal species. &#10;Dominant Species is a game that abstractly recreates a tiny portion of ancient history: the ponderous encroachment of an ice age and what that entails for the living creatures trying to adapt to the slowly-changing earth. &#10;Each player will assume the role of one of six major animal classes&mdash;mammal, reptile, bird, amphibian, arachnid, or insect. Each begins the game more or less in a state of natural balance in relation to one another. But that won&rsquo;t last: It is indeed &quot;survival of the fittest&quot;.&#10;Through wily action pawn placement, players will strive to become dominant on as many different terrain tiles as possible in order to claim powerful card effects. Players will also want to propagate their individual species in order to earn victory points for their particular animal. Players will be aided in these endeavors via speciation, migration, and adaptation actions, among others. &#10;All of this eventually leads to the end game&mdash;the final ascent of the ice age&mdash;where the player having accumulated the most victory points will have his animal crowned the Dominant Species. &#10;But somebody better become dominant quickly, because it&rsquo;s getting mighty cold...&#10;&#10;Game Play&#10;The large hexagonal tiles are used throughout the game to create an ever-expanding interpretation of earth as it might have appeared a thousand centuries ago. The smaller tundra tiles will be placed atop the larger tiles&mdash;converting them into tundra in the process&mdash;as the ice age encroaches.&#10;The cylindrical action pawns (or &quot;AP&quot;s) drive the game. Each AP will allow a player to perform the various actions that can be taken, such as speciation, environmental change, migration, or glaciation. After being placed on the action display during the Planning Phase, an AP will trigger that particular action for the owning player during the Execution Phase.&#10;Generally, players will be trying to enhance their own animal&rsquo;s survivability while simultaneously trying to hinder that of their opponents&rsquo;&mdash;hopefully collecting valuable victory points (or &quot;VP&quot;s) along the way. The various cards will aid in these efforts, giving players useful one-time abilities or an opportunity for recurring VP gains.&#10;Throughout the game, species cubes will be added to, moved about in, and removed from the tiles in play (the &quot;earth&quot;). Element disks will be added to and removed from both animals and earth. &#10;When the game ends, players will conduct a final scoring of each tile&mdash;after which the player controlling the animal with the highest VP total wins.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":120,"maxPlayTime":240,"minAge":14,"categoriesAndMechanics":["Animals","Environmental","Prehistoric","Action Queue","Area Majority / Influence","End Game Bonuses","Grid Movement","Hexagon Grid","Map Addition","Open Drafting","Take That","Tile Placement","Turn Order: Claim Action","Variable Player Powers","Worker Placement"],"rating":3.90903,"complexity":4.041,"urlThumb":"https://cf.geekdo-images.com/oeygRZntjNUJWvc8SxDfww__thumb/img/PUmSkY6ZKL81b6YuP1U59R3VdRE=/fit-in/200x150/filters:strip_icc()/pic784193.jpg","urlImage":"https://cf.geekdo-images.com/oeygRZntjNUJWvc8SxDfww__original/img/U-WjAGlPXS_p89z4R0V4b8IADxA=/0x0/filters:format(jpeg)/pic784193.jpg"},{"bggId":"171623","name":"The Voyages of Marco Polo","description":"In 1271, 17-year-old Marco Polo started on a journey to China with his father and older brother. After a long and grueling journey that led through Jerusalem and Mesopotamia and over the &quot;Silk Road&quot;, they reached the court of Kublai Khan in 1275.&#10;&#10;In The Voyages of Marco Polo, players recreate this journey, with each player having a different character from history with a special power in the game. The game is played over five rounds. Each round, the players roll their five personal dice and take turns performing actions by placing their dice onto the board. Players may choose from a variety of actions, each require the use of one or more dice: collecting resources or money, acquiring contracts, traveling on the map or using a special action granted by a city. When traveling, each player begins at Venice and can decide between several routes eastward, all the way to Beijing. When a player stops at a city, they place a trading post there, giving them access to extra actions or resources for the rest of the game. The higher the value of the dice used for an action, the better the options that may be chosen, but also the more money the player must pay if an opponent has already chosen the same action.&#10;&#10;After five rounds, the game ends with players receiving extra victory points for having trading posts in Beijing, fulfilling the most contracts, and having trading posts in the cities on secret goal cards that each player gets at the start of the game.&#10;&#10;This game should not be confused with Marco Polo Expedition, which has the same German title.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":40,"maxPlayTime":100,"minAge":12,"categoriesAndMechanics":["Dice","Economic","Medieval","Travel","Contracts","Dice Rolling","Point to Point Movement","Resource to Move","Turn Order: Claim Action","Variable Player Powers","Variable Set-up","Worker Placement with Dice Workers"],"rating":3.89448,"complexity":3.1825,"urlThumb":"https://cf.geekdo-images.com/n1G7_aWToLAAB7Mqt8iwyA__thumb/img/qfEgrXBN5L1EeMQ91siw6r_OoL4=/fit-in/200x150/filters:strip_icc()/pic2461346.png","urlImage":"https://cf.geekdo-images.com/n1G7_aWToLAAB7Mqt8iwyA__original/img/VQddnfi_QO0r4GmUU3M8_-nuO3Q=/0x0/filters:format(png)/pic2461346.png"},{"bggId":"121921","name":"Robinson Crusoe: Adventures on the Cursed Island","description":"Robinson Crusoe: Adventures on the Cursed Island is a game created by Ignacy Trzewiczek, the author of Stronghold. This time Trzewiczek takes the players to a deserted island, where they'll play the parts of shipwreck survivors confronted by an extraordinary adventure. They'll be faced with the challenges of building a shelter, finding food, fighting wild beasts, and protecting themselves from weather changes. Building walls around their homes, animal domestication, constructing weapons and tools from what they find, and much more await them on the island. The players decide in which direction the game will unfold and &ndash; after several in-game weeks of hard work &ndash; how their settlement will look. Will they manage to discover the secret of the island in the meantime? Will they find a pirate treasure, or an abandoned village? Will they discover an underground city or a cursed temple at the bottom of a volcano? Answers to these questions lie in hundreds of event cards and hundreds of object and structure cards that can be used during the game...&#10;&#10;Robinson Crusoe: Adventures on the Cursed Island is an epic game from Portal. You will build a shelter, palisade, weapons, you will create tools like axes, knives, sacks, you will do everything you can to&hellip; to survive. You will have to find food, fight wild beasts, protect yourself from weather changes&hellip;&#10;&#10;Take the role of one of four characters from the ship crew (cook, carpenter, explorer, or soldier) and face the adventure. Use your determination skills to help your teammates, discuss with them your plan, and put it into practice. Debate, discuss, and work on the best plan you all can make.&#10;&#10;Search for treasures. Discover mysteries. Follow goals of six different, engaging scenarios. Start by building a big pile of wood and setting it on fire to call for help, and then start new adventures. Become an exorcist on cursed Island. Become a treasure hunter on Volcano Island. Become a rescue team for a young lady who&rsquo;s stuck on rock island&hellip;&#10;&#10;Let the adventure live!&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Adventure","Exploration","Fighting","Novel-based","Territory Building","Action Queue","Area Movement","Cooperative Game","Dice Rolling","Die Icon Resolution","Events","Hexagon Grid","Map Addition","Movement Points","Narrative Choice / Paragraph","Scenario / Mission / Campaign Game","Solo / Solitaire Game","Tile Placement","Turn Order: Progressive","Variable Player Powers","Worker Placement"],"rating":3.87506,"complexity":3.8153,"urlThumb":"https://cf.geekdo-images.com/FbFnaTx3aT5dM18K_bR_Pg__thumb/img/K1ZUx-QNGg-Kkm2D9iUX4bL0-IM=/fit-in/200x150/filters:strip_icc()/pic3165731.jpg","urlImage":"https://cf.geekdo-images.com/FbFnaTx3aT5dM18K_bR_Pg__original/img/TB2dGHOnuUr54jQYIJZDIMilOJE=/0x0/filters:format(jpeg)/pic3165731.jpg"},{"bggId":"68448","name":"7 Wonders","description":"You are the leader of one of the 7 great cities of the Ancient World. Gather resources, develop commercial routes, and affirm your military supremacy. Build your city and erect an architectural wonder which will transcend future times.&#10;&#10;7 Wonders lasts three ages. In each age, players receive seven cards from a particular deck, choose one of those cards, then pass the remainder to an adjacent player. Players reveal their cards simultaneously, paying resources if needed or collecting resources or interacting with other players in various ways. (Players have individual boards with special powers on which to organize their cards, and the boards are double-sided). Each player then chooses another card from the deck they were passed, and the process repeats until players have six cards in play from that age. After three ages, the game ends.&#10;&#10;In essence, 7 Wonders is a card development game. Some cards have immediate effects, while others provide bonuses or upgrades later in the game. Some cards provide discounts on future purchases. Some provide military strength to overpower your neighbors and others give nothing but victory points. Each card is played immediately after being drafted, so you'll know which cards your neighbor is receiving and how her choices might affect what you've already built up. Cards are passed left-right-left over the three ages, so you need to keep an eye on the neighbors in both directions.&#10;&#10;Though the box of earlier editions is listed as being for 3&ndash;7 players, there is an official 2-player variant included in the instructions.&#10;&#10;","minPlayers":2,"maxPlayers":7,"minPlayTime":30,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Ancient","Card Game","City Building","Civilization","Economic","Closed Drafting","Hand Management","Neighbor Scope","Set Collection","Simultaneous Action Selection","Variable Player Powers"],"rating":3.84282,"complexity":2.3165,"urlThumb":"https://cf.geekdo-images.com/35h9Za_JvMMMtx_92kT0Jg__thumb/img/BUOso8b0M1aUOkU80FWlhE8uuxc=/fit-in/200x150/filters:strip_icc()/pic7149798.jpg","urlImage":"https://cf.geekdo-images.com/35h9Za_JvMMMtx_92kT0Jg__original/img/jt70jJDZ1y1FWJs4ZQf5FI8APVY=/0x0/filters:format(jpeg)/pic7149798.jpg"},{"bggId":"279537","name":"The Search for Planet X","description":"At the edge of our solar system, a dark planet may lurk. In 2015, astronomers estimated a large distant planet could explain the unique orbits of dwarf planets and other objects. Since then, astronomers have been scanning the sky, hoping to find this planet.&#10;&#10;In The Search for Planet X, players take on the role of astronomers who use observations and logical deductions to search for this hypothetical planet. Each game, the companion app randomly selects an arrangement of objects and a location for Planet X following predefined logic rules.&#10;&#10;Each round, as the earth travels around the sun, players use the app to perform scans and attend conferences. As they gain information about the location of the objects, they mark that information on their deduction sheets. As players learn the locations of the various objects, they can start publishing theories, which is how players score points.&#10;&#10;As more and more objects are found, players narrow down the possible locations for Planet X. Once a player believes they know its location and the objects on either side of it, they use the app to conduct a search. The game ends when a player successfully locates Planet X, and all players have a final chance to score some additional points.&#10;&#10;The Search for Planet X captures the thrill of discovery, the puzzle-y nature of astronomical investigation, and the competition inherent in the scientific process. Can you be the first to find Planet X?&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":75,"minAge":13,"categoriesAndMechanics":["Deduction","Puzzle","Action Points","Deduction","End Game Bonuses","Paper-and-Pencil","Solo / Solitaire Game","Turn Order: Time Track"],"rating":3.982615,"complexity":2.3881,"urlThumb":"https://cf.geekdo-images.com/NItjtztEUAKOpaTWZddu9A__thumb/img/x8YD4cAVOAbSDsZbmKgU0-WQ9wI=/fit-in/200x150/filters:strip_icc()/pic5744928.jpg","urlImage":"https://cf.geekdo-images.com/NItjtztEUAKOpaTWZddu9A__original/img/fr-JmerGdiEj6r9UM7F6laogGF0=/0x0/filters:format(jpeg)/pic5744928.jpg"},{"bggId":"93","name":"El Grande","description":"In this award-winning game, players take on the roles of Grandes in medieval Spain.  The king's power is flagging, and these powerful lords are vying for control of the various regions.  To that end, you draft caballeros (knights) into your court and subsequently move them onto the board to help seize control of regions.  After every third round, the regions are scored, and after the ninth round, the player with the most points is the winner.&#10;&#10;In each of the nine rounds, you select one of your 13 power cards to determine turn order as well as the number of caballeros you get to move from the provinces (general supply) into your court (personal supply).&#10;&#10;A turn then consists of selecting one of five action cards which allow variations to the rules and additional scoring opportunities in addition to determining how many caballeros to move from your court to one or more of the regions on the board (or into the castillo - a secretive tower). Normally, you may only place your caballeros into regions adjacent to the one containing the king. The one hard and fast rule in El Grande is that nothing may move into or out of the king's region. One of the five action cards that is always available each round allows you to move the king to a new region. The other four action cards vary from round to round.&#10;&#10;The goal is to have a caballero majority in as many regions (and the castillo) as possible during a scoring round. Following the scoring of the castillo, you place any cubes you had there into the region you secretly indicated on your region dial. Each region is then scored individually according to a table printed in that region. Two-point bonuses are awarded for having sole majority in the region containing your Grande and in the region containing the king.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":60,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Medieval","Renaissance","Action Drafting","Area Majority / Influence","Area Movement","Auction/Bidding","Hand Management","Memory","Open Drafting","Selection Order Bid","Simultaneous Action Selection","Turn Order: Progressive","Turn Order: Stat-Based"],"rating":3.87338,"complexity":3.0004,"urlThumb":"https://cf.geekdo-images.com/RRKDHaYtFPHhczkUDcHOmg__thumb/img/XPcVtsZPITv5qe3IXpzMKa5RSYA=/fit-in/200x150/filters:strip_icc()/pic7906240.jpg","urlImage":"https://cf.geekdo-images.com/RRKDHaYtFPHhczkUDcHOmg__original/img/E_QazS4f8ffj6oBcUl3C_VROCEw=/0x0/filters:format(jpeg)/pic7906240.jpg"},{"bggId":"321608","name":"Hegemony: Lead Your Class to Victory","description":"Extended edition includes Crisis &amp; Control expansion.&#10;&#10;&#10;The Nation is in disarray and a war is waging between the classes. The working class faces a dismantled welfare system, the capitalists are losing their hard-earned profits, the middle class is gradually fading and the state is sinking into a deep deficit. Amidst all this chaos, the only person who can provide guidance is... you. Will you take the side of the working class and fight for social reforms? Or will you stand with the corporations and the free market? Will you help the government try to keep it all together, or will you try to enforce your agenda no matter the cost to the country?&#10;&#10;Hegemony is an asymmetric politico-economic card-driven board game for 2-4 players that puts you in the role of one of the socio-economic groups in a fictional state: The Working Class, the Middle Class, the Capitalist Class and the State itself.&#10;&#10;The Working class controls the workers. The Capitalist class controls the companies. The Middle class combines elements from both the Working class and the Capitalist. It has workers who can work in the Capitalist's companies but it can also build companies of its own, yet smaller. Finally the State is trying to keep everyone happy, providing benefits and subsidies when needed but trying also to maintain a steady income through taxes to avoid going into debt.&#10;&#10;While players have their own separate goals, they are all limited by a series of policies that affect most of their actions, like Taxation, Labor Market, Foreign Trade etc. Voting on those policies and using their influence to change them is also very important. Through careful planning, strategic actions and political maneuvering, you will do your best to increase the power of your class and carry out your agenda. Will you be the one to lead your class to victory?&#10;&#10;Hegemony is heavily based on actual academic principles such as Social-Democracy, Neoliberalism, Nationalism and Globalism, and allows players to see their real world applications through engaging gameplay. There are many ways to achieve hegemony- which one will you take?&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":90,"maxPlayTime":180,"minAge":14,"categoriesAndMechanics":["Economic","Educational","Political","Action/Event","Hand Management","Simulation","Variable Player Powers","Voting"],"rating":4.265845,"complexity":4.2,"urlThumb":"https://cf.geekdo-images.com/DCLgJlrvB-EqL6A3WgQLMQ__thumb/img/9yp6ANJx6cqdQqQ6hkNr3zA88vw=/fit-in/200x150/filters:strip_icc()/pic5715770.jpg","urlImage":"https://cf.geekdo-images.com/DCLgJlrvB-EqL6A3WgQLMQ__original/img/vGpYcxjDBCOVcI0BcWOevspTQMQ=/0x0/filters:format(jpeg)/pic5715770.jpg"},{"bggId":"264220","name":"Tainted Grail: The Fall of Avalon","description":"Tainted Grail: the Fall of Avalon  is an unforgettable, solo or cooperative adventure experience for 1-4 players. Blending Arthurian legends and Celtic mythology with a unique vision, it allows you to impact the game world in deep and meaningful ways. A deep, branching storyline allows you to tackle problems in different ways, ensuring no two games play alike. Difficult decisions or harrowing choices wait behind every corner and seemingly minor tasks may reverberate with major long-term consequences.&#10;&#10;In a land slowly sinking into the Wyrdness and torn apart by con&#239;&#172;&#130;ict; surviving each day is a challenge on its own. Starvation, sickness, violent weather, and random incidents all conspire to end your journey. Guardian Menhirs, that ensured safe travel throughout the realm, are slowly going dark turning simple logistics into an involving puzzle. To overcome these challenges, your character develops along several con&#239;&#172;&#130;icting lines, such as Brutality / Empathy or Practicality / Spirituality. These traits unlock a rich choice of mutually exclusive skills and lead to di&#239;&#172;&#128;erent deck-building strategies, making character advancement meaningful and deep.&#10;&#10;The character you develop is going to be tested during dozens of combat and non-combat encounters. Sometimes you will need to brute force your way, but often diplomacy might be a better option. Regardless whether you fight with your strength or your wits, our unique dice-less encounter system makes resolving each con&#239;&#172;&#130;ict fun and exciting, while keeping you immersed in the game.&#10;&#10;In Avalon, there&rsquo;s a legend waiting behind every stone and every tree. All locations have their own rich stories and secrets to discover. Places and characters are often much more than they seem. As you slowly put all the pieces of the larger puzzle together, the land will always have a surprise waiting for you just around the corner. Many secrets can be discovered only after several games. Created by one of the best polish fantasy authors, Krzysztof Piskorski, the story of Tainted Grail: the Fall of Avalon aims to push the boundaries of non-linear narrative, building upon the rich experience.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Adventure","Exploration","Fantasy","Mature / Adult","Medieval","Miniatures","Mythology","Travel","Area Movement","Campaign / Battle Card Driven","Cooperative Game","Deck, Bag, and Pool Building","Dice Rolling","Hand Management","Map Addition","Modular Board","Narrative Choice / Paragraph","Role Playing","Scenario / Mission / Campaign Game","Solo / Solitaire Game","Storytelling","Variable Player Powers"],"rating":4.04783,"complexity":3.3513,"urlThumb":"https://cf.geekdo-images.com/aAwBzPzta4joKfFZt05hCw__thumb/img/zvV21ZaydrMSEbbYSNXcmw3WmfY=/fit-in/200x150/filters:strip_icc()/pic4385726.jpg","urlImage":"https://cf.geekdo-images.com/aAwBzPzta4joKfFZt05hCw__original/img/e1HfD3XIvObNuGH6rq7kUSK-5aQ=/0x0/filters:format(jpeg)/pic4385726.jpg"},{"bggId":"37111","name":"Battlestar Galactica: The Board Game","description":"Battlestar Galactica: The Board Game is an exciting game of mistrust, intrigue, and the struggle for survival. Based on the epic and widely-acclaimed Sci Fi Channel series, Battlestar Galactica: The Board Game puts players in the role of one of ten of their favorite characters from the show. Each playable character has their own abilities and weaknesses, and must all work together in order for humanity to have any hope of survival. However, one or more players in every game secretly side with the Cylons. Players must attempt to expose the traitor while fuel shortages, food contaminations, and political unrest threatens to tear the fleet apart.&#10;&#10;After the Cylon attack on the Colonies, the battered remnants of the human race are on the run, constantly searching for the next signpost on the road to Earth. They face the threat of Cylon attack from without, and treachery and crisis from within. Humanity must work together if they are to have any hope of survival&hellip;but how can they, when any of them may, in fact, be a Cylon agent?&#10;&#10;Battlestar Galactica: The Board Game is a semi-cooperative game for 3-6 players ages 10 and up that can be played in 2-3 hours. Players choose from pilots, political leaders, military leaders, or engineers to crew Galactica. They are also dealt a loyalty card at the start of the game to determine if they are a human or Cylon along with an assortment of skill cards based on their characters abilities. Players then can move and take actions either on Galactica, on Colonial 1, or in a Viper. They need to collect skill cards, fend off Cylon ships, and keep Galactica and the fleet jumping. Each turn also brings a Crisis Card, various tasks that players must overcome. Players need to play matching skill cards to fend off the problems; skill cards that don't match hinder the players success. Fate could be working against the crew, or there could be a traitorous Cylon! As players get closer and closer towards reaching their Earth, another round of loyalty cards are passed out and more Cylons may turn up. If players can keep their up their food stores, fuel levels, ship morale, and population, and they can keep Galactica in one piece long enough to make it to Earth, the Humans win the game. But if the Cylon players reveal themselves at the right moment and bring down Galactica, the Humans have lost.&#10;&#10;Official Site, Rules &amp; FAQ: http://www.fantasyflightgames.com/edge_minisite_sec.asp?eidm=18&amp;esem=4&#10;Unofficial FAQ for really tricky questions: http://boardgamegeek.com/wiki/page/Battlestar_Galactica_FAQ&#10;&#10;","minPlayers":3,"maxPlayers":6,"minPlayTime":120,"maxPlayTime":180,"minAge":14,"categoriesAndMechanics":["Bluffing","Deduction","Movies / TV / Radio theme","Political","Science Fiction","Space Exploration","Spies/Secret Agents","Area Movement","Dice Rolling","Hand Management","Hidden Roles","Once-Per-Game Abilities","Role Playing","Team-Based Game","Traitor Game","Variable Player Powers","Variable Set-up","Voting"],"rating":3.86524,"complexity":3.2516,"urlThumb":"https://cf.geekdo-images.com/5Q2w2rFJiFI_uV89KP6ECg__thumb/img/s1BljxEdoxQ1zGYiw05Qa9rg9hI=/fit-in/200x150/filters:strip_icc()/pic354500.jpg","urlImage":"https://cf.geekdo-images.com/5Q2w2rFJiFI_uV89KP6ECg__original/img/MYuRAKLRAGlIQTph2XKWjzqT7sQ=/0x0/filters:format(jpeg)/pic354500.jpg"},{"bggId":"236457","name":"Architects of the West Kingdom","description":"Architects of the West Kingdom is set at the end of the Carolingian Empire, circa 850 AD. As royal architects, players compete to impress their King and maintain their noble status by constructing various landmarks throughout his newly appointed domain. Players need to collect raw materials, hire apprentices, and keep a watchful eye on their workforce. These are treacherous times, and rival architects will stop at nothing to slow your progress. Will you remain virtuous, or be found in the company of thieves and black marketeers?&#10;&#10;The aim of Architects of the West Kingdom is to be the player with the most victory points (VP) at game's end. Points are gained by constructing various buildings and advancing work on the Archbishop's cathedral. Throughout the game, players need to make a lot of moral decisions. However, only at game's end will their virtue be judged. A few underhand deals here and there might not seem like much, but fall too far and you will be punished. The game ends once a set number of constructions have been completed.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":60,"maxPlayTime":80,"minAge":12,"categoriesAndMechanics":["City Building","Medieval","Contracts","Increase Value of Unchosen Resources","Open Drafting","Solo / Solitaire Game","Tags","Variable Player Powers","Worker Placement"],"rating":3.86859,"complexity":2.749,"urlThumb":"https://cf.geekdo-images.com/OAX7HfOz-9N60StgADzd0g__thumb/img/sBMaoJ-Kz74lJ6djcl-NNMTr0Wo=/fit-in/200x150/filters:strip_icc()/pic3781944.png","urlImage":"https://cf.geekdo-images.com/OAX7HfOz-9N60StgADzd0g__original/img/x2Y_DYWrzzleMETfnu7Jm3R8jPo=/0x0/filters:format(png)/pic3781944.png"},{"bggId":"225694","name":"Decrypto","description":"Players compete in two teams in Decrypto, with each trying to correctly interpret the coded messages presented to them by their teammates while cracking the codes they intercept from the opposing team.&#10;&#10;In more detail, each team has their own screen, and in this screen they tuck four cards in pockets numbered 1-4, letting everyone on the same team see the words on these cards while hiding the words from the opposing team. In the first round, each team does the following: One team member takes a code card that shows three of the digits 1-4 in some order, e.g., 4-2-1. They then give a coded message that their teammates must use to guess this code. For example, if the team's four words are &quot;pig&quot;, &quot;candy&quot;, &quot;tent&quot;, and &quot;son&quot;, then I might say &quot;Sam-striped-pink&quot; and hope that my teammates can correctly map those words to 4-2-1. If they guess correctly, great; if not, we receive a black mark of failure.&#10;&#10;Starting in the second round, a member of each team must again give a clue about their words to match a numbered code. If I get 2-4-3, I might now say, &quot;sucker-prince-stake&quot;. The other team then attempts to guess our numbered code. If they're correct, they receive a white mark of success; if not, then my team must guess the number correctly or take a black mark of failure. (Guessing correctly does nothing except avoid failure and give the opposing team information about what our hidden words might be.)&#10;&#10;The rounds continue until a team collects either its second white mark (winning the game) or its second black mark (losing the game). Games typically last between 4-7 rounds. If neither team has won after eight rounds, then each team must attempt to guess the other team's words; whichever team guesses more words correctly wins.&#10;&#10;","minPlayers":3,"maxPlayers":8,"minPlayTime":15,"maxPlayTime":45,"minAge":12,"categoriesAndMechanics":["Deduction","Party Game","Spies/Secret Agents","Word Game","Communication Limits","Targeted Clues","Team-Based Game"],"rating":3.885895,"complexity":1.8052,"urlThumb":"https://cf.geekdo-images.com/hHZWXnUTMYDd_KTAM6Jwlw__thumb/img/O5XHaPOALYquS058qcXWVm5b_k4=/fit-in/200x150/filters:strip_icc()/pic3759421.jpg","urlImage":"https://cf.geekdo-images.com/hHZWXnUTMYDd_KTAM6Jwlw__original/img/lL6QJ69UmZT7CeljUcjyA47b-e0=/0x0/filters:format(jpeg)/pic3759421.jpg"},{"bggId":"155821","name":"Inis","description":"Inis is a game deeply rooted in Celtic history and lore in which players win by being elected King of the Island (Inis). Players can try to achieve one of three different victory conditions:&#10;&#10;&#10;     Leadership: Be the leader &mdash; i.e., have more clan figures than any other player &mdash; of territories containing at least six opponents' clans.&#10;     Land: Have your clans present in at least six different territories.&#10;     Religion: Have your clans present in territories that collectively contain at least six sanctuaries.&#10;&#10;&#10;Over the course of the game, players also earn deeds, typically chanted by bards or engraved by master crafters, that reduce by one the magic total of six for any condition. While one victory condition is enough to claim the title of King, a game of experienced players usually has a tight balance of power, emphasizing the leadership of the capital of the island.&#10;&#10;At the start of each round, players draft a hand of four action cards (with 13 action cards for three players and 17 for four players) during the Assembly. Action cards not played at the end of one season are not held for the next. Players also have access to leader cards for the territories that allow it and where they were elected leader during the assembly. Each Assembly reallocates those cards. Finally, they collect &quot;epic tales&quot; cards that depict the deeds of the ancient Irish gods and heroes, like Cuchulainn, the Dagda, Lugh and many others. These will be kept and used to inspire the clans and achieve extraordinary feats...under the right circumstances. The cards provide a variety of actions: adding clans, moving clans, building/exploring, and special actions.&#10;&#10;Careful drafting, hand management, bluffing (especially once players understand the importance of passing their turn), good timing, and a precise understanding of the balance of power are the keys to victory. After a discovery game you'll be ready for a full and epic game, where an undisputed player will be king by the Assembly for his merit and wisdom.&#10;&#10;While Inis has &quot;dudes&quot; that are &quot;on a map&quot;, it's a beginner's mistake to play this as a battle game because eliminating other clans reduces your chances of scoring a Leadership victory condition. Peace among different clans, with or without a clear territory leader, is the usual outcome of a clan's movement. Battles will occur, of course, as the Celtic clans can be unruly and a good player will listen to his clan's people (i.e., his hand of cards). That battle aspect is reflected in the clan's miniatures representing warriors. Woodsmen, shepherds and traders complete the set of twelve minis for each player; these occupations have no impact on the game, but give it flavor.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":90,"minAge":14,"categoriesAndMechanics":["Card Game","Exploration","Medieval","Mythology","Wargame","Area Majority / Influence","Area Movement","Campaign / Battle Card Driven","Closed Drafting","Hand Management","Interrupts","King of the Hill","Map Addition","Modular Board","Variable Set-up"],"rating":3.913385,"complexity":2.8979,"urlThumb":"https://cf.geekdo-images.com/6QE8mnPFmauoj2THsyUYPA__thumb/img/m63hnvHi6jqlva52FGaWbEqzjys=/fit-in/200x150/filters:strip_icc()/pic4739757.jpg","urlImage":"https://cf.geekdo-images.com/6QE8mnPFmauoj2THsyUYPA__original/img/6bZdn1SNbpIqU7n5pwtncvdNE_U=/0x0/filters:format(jpeg)/pic4739757.jpg"},{"bggId":"163068","name":"Trickerion: Legends of Illusion","description":"Trickerion is a competitive Euro-style strategy game set in a fictional world inspired by the late 19th century urban life and culture, spiced with a pinch of supernatural.&#10;&#10;Players take on the roles of rival stage illusionists, each with their own strengths and characteristics. They are striving for fortune and fame in a competition hosted by a legendary magician, looking for a successor worthy of the mighty Trickerion Stone, which is fabled to grant supernatural power to its owner.&#10;&#10;Using worker placement and simultaneous action selection mechanisms, the Illusionists and their teams of helpers &mdash; the Engineer, the Assistant, the Manager, and a handful of Apprentices &ndash; obtain blueprints and components for increasingly complex magic tricks, expand the team and set up performances by visiting the Downtown, Dark Alley, Market Row and Theater locations on the main game board depicting a late 19th century cityscape.&#10;&#10;The tricks are stored and prepared on the Magician's own Workshop game board, while the performances themselves take place at the Theater in the form of a tile placement mini-game with lots of player interaction. The performances yield Fame points and Coins to their owners based on the tricks they consist of. Fame points have multiple uses, but they also serve as a win condition - After turn 7, when the last Performance card is revealed, the game ends and the illusionist with the most Fame points wins.&#10;&#10;The game offers 48 different Tricks to be learned from the Optical, Spiritual, Mechanical and Escape categories, over 90 character abilities, and 40 Special Assignment cards that influence the actions taken at the various game locations. The base game can be expanded with two optional rule modules to add further strategic depth to the game.&#10;&#10;The &quot;Dark Alley&quot; expansion included in the base game adds a new location to the game. It also comes with 48 new Special Assignment cards, a new tier of Tricks, and 27 Prophecy tokens that can alter certain game rules turn by turn, giving the game additional variety.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":180,"minAge":14,"categoriesAndMechanics":["Post-Napoleonic","Action Points","Action Queue","Catch the Leader","Dice Rolling","Simultaneous Action Selection","Tile Placement","Turn Order: Stat-Based","Worker Placement","Worker Placement, Different Worker Types"],"rating":3.98841,"complexity":4.2511,"urlThumb":"https://cf.geekdo-images.com/9gob752VqEklQFV_gz16hw__thumb/img/C2GPhkDu7fWK6L64MTOaYVRCgS4=/fit-in/200x150/filters:strip_icc()/pic2585510.png","urlImage":"https://cf.geekdo-images.com/9gob752VqEklQFV_gz16hw__original/img/ivQUea2qrHp2TDLM4i7gp1123vQ=/0x0/filters:format(png)/pic2585510.png"},{"bggId":"122515","name":"Keyflower","description":"Keyflower is a game for two to six players played over four rounds. Each round represents a season: spring, summer, autumn, and finally winter. Each player starts the game with a &quot;home&quot; tile and an initial team of eight workers, each of which is colored red, yellow, or blue. Workers of matching colors are used by the players to bid for tiles to add to their villages. Matching workers may alternatively be used to generate resources, skills and additional workers, not only from the player's own tiles, but also from the tiles in the other players' villages and from the new tiles being auctioned.&#10;&#10;In spring, summer and autumn, more workers will arrive on board the Keyflower and her sister boats, with some of these workers possessing skills in the working of the key resources of iron, stone and wood. In each of these seasons, village tiles are set out at random for auction. In the winter no new workers arrive and the players select the village tiles for auction from those they received at the beginning of the game. Each winter village tile offers VPs for certain combinations of resources, skills and workers. The player whose village and workers generate the most VPs wins the game.&#10;&#10;Keyflower presents players with many different challenges and each game will be different due to the mix of village tiles that appear in that particular game. Throughout the game, players will need to be alert to the opportunities to best utilize their various resources, transport and upgrade capability, skills and workers.&#10;&#10;Keyflower, a joint design between Richard Breese and Sebastian Bleasdale, is the seventh game in the &quot;Key&quot; series from R&amp;D Games set in the medieval &quot;Key&quot; land.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":90,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["City Building","Economic","Renaissance","Territory Building","Transportation","Auction: Fixed Placement","Auction: Multiple Lot","Auction/Bidding","Constrained Bidding","End Game Bonuses","Hexagon Grid","Modular Board","Network and Route Building","Ownership","Selection Order Bid","Set Collection","Tile Placement","Turn Order: Auction","Variable Set-up","Worker Placement","Worker Placement, Different Worker Types"],"rating":3.863915,"complexity":3.3399,"urlThumb":"https://cf.geekdo-images.com/HbfgxDJZQnNEZQKvpmJxQg__thumb/img/5t1MtJEDdhSgtyJlmu3Hu1qR_ZQ=/fit-in/200x150/filters:strip_icc()/pic2278942.jpg","urlImage":"https://cf.geekdo-images.com/HbfgxDJZQnNEZQKvpmJxQg__original/img/HsrtfanhKfXX07zNEm-xZpSbxyY=/0x0/filters:format(jpeg)/pic2278942.jpg"}]