[{"bggId":"273121","name":"Ratsastuspeli","description":"Fun riding game for over 6-year-olds who love horses.&#10;&#10;Contents:&#10;dice&#10;board&#10;4 &quot;horses&quot;&#10;&#10;Select your horse and place it on the start. Your goal is to ride first to finish. Decide how many turns the race will take and who will start. Players throw the dice and ride in as many squares as the dice shows. Some screens have different functions.&#10;&#10;The winner is the one who has first rounded the agreed turns and arrived at the finish.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":6,"categoriesAndMechanics":["Children's Game","Roll / Spin and Move"],"rating":1.666665,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/kAJ7SOB9J6Hm70cO_HCEZQ__thumb/img/LlCscKFYPWup5PDU3ED5LrOm19k=/fit-in/200x150/filters:strip_icc()/pic7105397.jpg","urlImage":"https://cf.geekdo-images.com/kAJ7SOB9J6Hm70cO_HCEZQ__original/img/_7csOO2wtK_4TrVxOuEKHzZBmm4=/0x0/filters:format(jpeg)/pic7105397.jpg"},{"bggId":"273134","name":"Jumble Poker","description":"This self-published game is a deck of 52 letter cards plus an instructions card.  Its play is similar to draw poker without any bidding: 5 cards per person are dealt; each may discard any number of cards and draw to replace them; the one who forms the longest word wins the hand.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Card Game","Word Game","Hand Management"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/VY2b7CHv5pxoiB3M7VRzaw__thumb/img/ifHKB8MECr80u5ckASSY6YLXjio=/fit-in/200x150/filters:strip_icc()/pic4644715.jpg","urlImage":"https://cf.geekdo-images.com/VY2b7CHv5pxoiB3M7VRzaw__original/img/xXZ0BFODgss2szRr1D-kMrQ7uvY=/0x0/filters:format(jpeg)/pic4644715.jpg"},{"bggId":"273137","name":"Nate's Word Poker","description":"The 52 cards in this game each have a letter and a point value, with rarer letters having more points. This game plays like draw poker without betting: each player is dealt a hand of 5 cards and may discard and replace up to 4 of them.  Players score for the points on the cards making up the word they spell from their hand; longest word gets a 3-point bonus, with 3 more for using all their cards.  The first player to reach a total of 100 points (or other agreed total) wins the game.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Card Game","Word Game","Hand Management"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/zZ7fGzJBhDBlqpOLO4b7aw__thumb/img/qpQJRl4bds9H-HSFpGBf5KcvuwA=/fit-in/200x150/filters:strip_icc()/pic4644713.jpg","urlImage":"https://cf.geekdo-images.com/zZ7fGzJBhDBlqpOLO4b7aw__original/img/AtcuMgEn9kEBwl9Aho4q3ju7ZAE=/0x0/filters:format(jpeg)/pic4644713.jpg"},{"bggId":"273154","name":"Copagol","description":"Copagol is a board game for two people that recreates a soccer match between two national teams (among 16 countries). It is mainly based on dice rolling although it also has cards that are played instantly. This board game lets the players enjoy the main actions of a soccer match (goals, attack, defense, offside, corner kick, penalty shoot, foul, yellow card, red card, individual actions, etc.) It has a basic playing mode and a more advanced one to enrich the players' experience.&#10;The game has its own time control on the board and it can be played in its full time length or depending on the desired duration agreed by the players. A complete soccer match of two halves can last 30 minutes. You can include extra time and penalty shoot out if the game ends tied.&#10;&mdash;description from the designer&#10;&#10;Copagol es un juego de mesa para dos personas que recrea un partido de f&uacute;tbol entre dos selecciones nacionales (de 16 pa&iacute;ses diferentes). Se basa principalmente en lanzamiento de dados aunque tambi&eacute;n cuenta con tarjetas que se juegan inmediatamente. Este juego permite que los jugadores disfruten de la emoci&oacute;n de las principales acciones de un partido de f&uacute;tbol (goles, ataques, defensa, fuera de juego, tiro de esquina, remate al arco, penales, tiro libre, faltas, tarjetas amarillas y rojas, etc.) Tiene un modo de juego b&aacute;sico y otro avanzado para enriquecer la experiencia del juego. El juego cuenta con un mecanismo de cron&oacute;metro propio en el tablero y puede jugarse en su duraci&oacute;n completa o la duraci&oacute;n que acuerden los jugadores. Un partido de tiempo completo puede durar 30 minutos aproximadamente. En caso de terminar el partido empatado pueden jugar tiempo extra o definici&oacute;n a penales.&#10;&#10;&mdash;description from the designer (Spanish)&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":40,"minAge":8,"categoriesAndMechanics":["Sports","Dice Rolling"],"rating":3.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/46fAExltIR-p7Mes2sVPNA__thumb/img/m-01QFScC02fmO3scyqU4GATfAc=/fit-in/200x150/filters:strip_icc()/pic4672046.jpg","urlImage":"https://cf.geekdo-images.com/46fAExltIR-p7Mes2sVPNA__original/img/_pzPtgHwgXze4BV0TQr-Qx1R_8g=/0x0/filters:format(jpeg)/pic4672046.jpg"},{"bggId":"273255","name":"LocoMotive","description":"Your train ride home from work takes an unexpected turn when suddenly a fork in the tracks appears out of thin air, your train makes an unexpected turn on these new tracks and you find yourself extremely disoriented. Everything begins rapidly changing colors right before your eyes, you quickly realize the train is going in circles around this psychedelic new railway. Every lap you see the one path home slowly fading away. Hurry to the front of the train to turn back toward reality before the path home disappears forever.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":15,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Racing","Trains","Dice Rolling","Point to Point Movement","Take That"],"rating":0,"complexity":0},{"bggId":"273256","name":"Most or Least","description":"Most Or Least is a relaxed style party game for 4-8 players ages 13 and up. In the game you and your friends go through a selection of interesting playful question which ask if you are most/least likely to do something or make a selection between three unpredictable &amp; hilarious choices.&#10;&#10;Each round a new person draws a card and reads out the question then selects the card that best fits their personality/desires/experiences. The other players must then select an answer in an attempt to match the reader&rsquo;s card answer. Points are awarded for correctly guessing answers and the game play time is between 30-45 minutes. Most or Least avoids &lsquo;adult&rsquo; themes which allows younger players to enjoy the game.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":4,"maxPlayers":8,"minPlayTime":30,"maxPlayTime":45,"minAge":13,"categoriesAndMechanics":["Party Game","Voting"],"rating":3.25,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/UYYdN90eVVkSiojX7vxH3A__thumb/img/ygXUgQjKU6IiFv3n7WTWQbGJdp4=/fit-in/200x150/filters:strip_icc()/pic4626775.jpg","urlImage":"https://cf.geekdo-images.com/UYYdN90eVVkSiojX7vxH3A__original/img/R2pRhyu3SngaJ5FW8wHk1TBU1ew=/0x0/filters:format(jpeg)/pic4626775.jpg"},{"bggId":"273257","name":"POH!","description":"POH! is a game about creating good stories with the cards you have. In the card you'll find Chilean slang words. There are two modes, collaborative and competitive, in both, each player has to add more details to the story that previous player narrated.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":40,"minAge":16,"categoriesAndMechanics":["Card Game","Humor","Party Game","Word Game","Storytelling"],"rating":3.715625,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/F_hKIwFvA3lsW0mryBMasQ__thumb/img/XBCI9qebtffRTuDaSUYXvbQYK18=/fit-in/200x150/filters:strip_icc()/pic5496981.jpg","urlImage":"https://cf.geekdo-images.com/F_hKIwFvA3lsW0mryBMasQ__original/img/xC_lvCOdDZDGwEPEA7uW0MgCi8I=/0x0/filters:format(jpeg)/pic5496981.jpg"},{"bggId":"273261","name":"Humans Being","description":"Human's Being is an improv card game with MadLib features. Players are split into two teams. A player from one team chooses a scene card that describes what the two actors will be doing, but a word is missing from the card. A member from the opposite team has to fill in the blank for the missing word, which then affects the scene. One person from each team will act out the scene in 90 seconds. One of the actors will select a secret challenge card to use during the scene. When the scene ends, the two teams have to guess the challenge card. Whichever team guesses the challenge card right wins the card. The first team to properly act out and guess all eight types of challenge cards wins the game.&#10;&#10;","minPlayers":2,"maxPlayers":16,"minPlayTime":45,"maxPlayTime":45,"minAge":11,"categoriesAndMechanics":["Card Game","Party Game","Real-time","Acting","Team-Based Game"],"rating":2.75,"complexity":0},{"bggId":"273262","name":"Raging Pandas","description":"Raging Pandas is a fast, frantic, funny, and highly competitive card game filled with awesome pandas and terrified food cards. Players draw cards with the hope of getting a pair of matching food cards and try to gobble up five food pairs to win! Sounds easy, right? Not so fast! Other hungry Pandas are doing whatever it takes to get YOUR food and the game gets more intense each round as players use their defense and attack panda cards to block or steal food from other players. Rare specialty panda cards will either be your best friend or worst enemy when they join in the fight. This constant battle between furry friends means the tables can turn extremely fast and anyone can come out on top.&#10;&#10;-description from publisher&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":10,"maxPlayTime":20,"minAge":7,"categoriesAndMechanics":["Animals","Card Game","Humor","Party Game","Hand Management","Take That"],"rating":2.92,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/qLxCM985C6p2DQmu0Zk9iA__thumb/img/PX1S6t983CZKHfWYwwU8oTQyt7w=/fit-in/200x150/filters:strip_icc()/pic4643500.jpg","urlImage":"https://cf.geekdo-images.com/qLxCM985C6p2DQmu0Zk9iA__original/img/mGNg4KEaZBlQN6uuUQbaJX6u8tE=/0x0/filters:format(jpeg)/pic4643500.jpg"},{"bggId":"273263","name":"Seize the Imperium the Card Game","description":"2-6 players compete to be the next Emperor or Empress of the galaxy using pre-constructed decks with 3 sub-decks (Asset Deck of 50 cards, System Deck of 10 World cards and Character Deck of 10 cards) and a pool of Color-coded counters, Resource counters, and Throne World token. Players win by accumulating 20 points of World cards through buying them or conquest.&#10;&#10;Each player's Turn will be compromised of 5 Phases:&#10;1. Resupply Phase - They will undeplete (ready) cards from the last Turn, draw a card from an their Asset Deck and Character Decks, generate Resource counters from each World card they control and pay to flip up World card from their Face Down System Card area.&#10;&#10;2. Allocation Phase - They will use Resource counters to allocate Artifact cards and Character cards and deplete (unready) World cards to allocate the Unit cards of the game (Fleets, Troops, Installations and Orbitals) to your World cards.&#10;&#10;3. Reallocation Phase - Move your Units card first between your World cards, and then to other player's World cards that you intend to attack.&#10;&#10;4. Conquest Phase - You resolve the Conquest Actions at each World card that you reallocated Fleets or Troops to.&#10;&#10;5. Victory Phase - Determine the spoils of your Conquest Actions, liberate World cards, pay for more face down World cards, determine if you have enough Victory points to win, and draw back to hand size.&#10;&#10;The game is meant to be won through conquest, as purchasing World cards from your System Deck gets incrementally expensive, and you'll use Tactics cards in battle. Character cards also will tip the balance of power by affecting Conquest Actions, altering allocations and other game mechanics including neutralizing other Characters!&#10;&#10;-description from designer&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":120,"minAge":13,"categoriesAndMechanics":["Card Game","Science Fiction","Hand Management","Open Drafting"],"rating":2.666665,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/bkC4EK08hrcmOyNjKtBmqQ__thumb/img/vJsNRRR4QdHm28nvoLE4tw6Zy-A=/fit-in/200x150/filters:strip_icc()/pic4591084.jpg","urlImage":"https://cf.geekdo-images.com/bkC4EK08hrcmOyNjKtBmqQ__original/img/jjgRtJjbwGNdyFn6zlcgtNBmkpk=/0x0/filters:format(jpeg)/pic4591084.jpg"},{"bggId":"273266","name":"Apothecary","description":"Welcome to the middle ages, where life was short and medicine was terrible. You and 1 to 3 other players are masters of herbal remedies and potions who have come to make new lives for yourselves in a small town. Will you be a helpful addition to the community, becoming the Apothecary, or will you be a snake oil salesperson, only in it for a quick buck before moving on to the next town?&#10;&#10;---&#10;&#10;Apothecary is a medieval-themed game of medicine-making and disease management for 2-4 players. You and your friends play competing herbalists who have set up shop in a small town. You will buy resources (represented by cards and tokens) and use them to treat sick villagers (represented by cards). You will have the choice to actually treat or filmflam the villagers with snake oil&mdash;but watch out&mdash;too much lying and you&rsquo;ll get run out of town. Do it right and you&rsquo;ll be made the Apothecary!&#10;&#10;The game is played in a series of phases, (A-E).&#10;&#10;- In Phase A (Auction), players will bid for turn order, and the prices for the herbs players will use will be set. &#10;- In Phase B (Barter), players will buy supplies from the market, forage in the woods, or trade with other players.&#10;- In Phase C (Collect), players will select villager cards for treatment.&#10;- In Phase D (Disease), players will use their resources to treat their villager cards, either honestly or dishonestly. &#10;- In Phase E (End), the market will be reset, and disease tokens will be added to villager cards, bringing them closer to death!&#10;&#10;In order to win the game, players must either accomplish a unique objective they've been dealt at the beginning of the game, or treat enough villagers honestly so that they land on the Apothecary space of the Apothecary track. If one player is Run Out (the other end of the track), the player(s) who were not Run Out and who have the most money win the game.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Dice","Medical","Medieval","Print & Play","Auction/Bidding","Dice Rolling","Hand Management","Push Your Luck","Trading"],"rating":3.25,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/YEwwZshXGdhNx8N6GLBLBQ__thumb/img/gHhDmGYXVC5qSnGTQdAlSjnkKNE=/fit-in/200x150/filters:strip_icc()/pic4594467.jpg","urlImage":"https://cf.geekdo-images.com/YEwwZshXGdhNx8N6GLBLBQ__original/img/rnkzWICcHZoCkVSThAh8w3bXEK4=/0x0/filters:format(jpeg)/pic4594467.jpg"},{"bggId":"273267","name":"Storage Auction Showdown","description":"A streamlined open bidding auction game with unique player powers and hidden information.&#10;&#10;Can you best manage your cash, buy the right items, and play to your unique strengths to become master of the storage auction?&#10;&#10;In Storage Auction Showdown, players are competing in a storage auction. The auction consists of a series of storage units being sold off, one after the other. Storage units have a randomized variety of items inside. Items come in 8 different types, including several special unique items. Each item scores you points and/or utilizes an ability. Some items will be hidden from you during an auction, so you&rsquo;ll need to decide how much of your cash you want to risk bidding on the unknown. The player willing to pay the most for a storage unit gets all its items, whether those are treasures or trash. At the end of the game, the player with the most points wins!&#10;&#10;Storage Auction Showdown features unique player powers and hidden information, is quick to learn and play, and has high replayability. It also has a significant amount of luck, is family friendly, no player elimination, and minimal downtime.&#10;&#10;-description from designer&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":20,"maxPlayTime":45,"minAge":8,"categoriesAndMechanics":["Bluffing","Card Game","Auction/Bidding","Dice Rolling","Set Collection","Variable Player Powers"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/jp2pQ5Wyby0UaNCFIgWlgw__thumb/img/U2bYBsgWyxjPQ7bbzXeJUWJVS2c=/fit-in/200x150/filters:strip_icc()/pic6094527.jpg","urlImage":"https://cf.geekdo-images.com/jp2pQ5Wyby0UaNCFIgWlgw__original/img/eI28vn2Yy19M5UO5LMOXp3vVTjQ=/0x0/filters:format(jpeg)/pic6094527.jpg"},{"bggId":"273270","name":"Stationeries (ブングス )","description":"User summary&#10;&#227;&#131;&#150;&#227;&#131;&#179;&#227;&#130;&#176;&#227;&#130;&#185; (Bungusu) Stationeries is a Japanese card game, with the 'butting' mechanic (equal values cancel).&#10;&#10;At the beginning of the game, all players receive an identical set of six cards valued 0-5. Players then choose one from their hand each turn, and place it face down in front of themselves.  All of those cards are then simultaneously revealed. Typically, the player who chose the card with the highest value will score a point. However, duplicate cards cancel each other, '1' beats a '5', and '0' can be any value between 0-5. After all six cards have been played once, each player picks up their entire hand and play another set of turns.&#10;&#10;The game ends one of two ways: The first player to score 9 points immediately wins, or after 3 complete sets.  In the latter case, the player with the highest score wins.&#10;&#10;Publisher's summary&#10;&#230;&#150;&#135;&#230;&#136;&#191;&#229;&#133;&#183;&#227;&#130;&#146;&#227;&#131;&#162;&#227;&#131;&#129;&#227;&#131;&#188;&#227;&#131;&#149;&#227;&#129;&#171;&#227;&#129;&#151;&#227;&#129;&#159;6&#230;&#158;&#154;&#227;&#129;&#174;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#129;&#167;&#227;&#131;&#144;&#227;&#131;&#136;&#227;&#131;&#171;&#227;&#129;&#153;&#227;&#130;&#139;&#227;&#131;&#144;&#227;&#131;&#131;&#227;&#131;&#134;&#227;&#130;&#163;&#227;&#131;&#179;&#227;&#130;&#176;&#227;&#130;&#178;&#227;&#131;&#188;&#227;&#131;&#160;&#227;&#129;&#167;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#229;&#142;&#159;&#229;&#137;&#135;&#230;&#149;&#176;&#229;&#173;&#151;&#227;&#129;&#174;&#229;&#164;&#167;&#227;&#129;&#141;&#227;&#129;&#132;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#129;&#140;&#229;&#139;&#157;&#229;&#136;&#169;&#227;&#129;&#151;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#129;&#140;&#227;&#128;&#129;&#239;&#188;&#145;&#227;&#129;&#175;&#239;&#188;&#149;&#227;&#129;&#171;&#229;&#139;&#157;&#229;&#136;&#169;&#227;&#129;&#151;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#227;&#129;&#190;&#227;&#129;&#159;&#239;&#188;&#144;&#227;&#129;&#175;&#227;&#128;&#129;&#10;&#239;&#188;&#145;&#239;&#189;&#158;5&#227;&#129;&#190;&#227;&#129;&#167;&#227;&#129;&#174;&#230;&#149;&#176;&#229;&#173;&#151;&#227;&#130;&#146;&#227;&#130;&#179;&#227;&#131;&#148;&#227;&#131;&#188;&#227;&#129;&#153;&#227;&#130;&#139;&#227;&#129;&#147;&#227;&#129;&#168;&#227;&#129;&#140;&#227;&#129;&#167;&#227;&#129;&#141;&#227;&#130;&#139;&#227;&#129;&#174;&#227;&#129;&#167;&#227;&#128;&#129;&#230;&#136;&#166;&#231;&#149;&#165;&#231;&#154;&#132;&#227;&#129;&#170;&#227;&#131;&#144;&#227;&#131;&#136;&#227;&#131;&#171;&#227;&#129;&#140;&#230;&#165;&#189;&#227;&#129;&#151;&#227;&#130;&#129;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":20,"minAge":8,"categoriesAndMechanics":["Bluffing","Card Game","Hand Management"],"rating":3.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/vloLEctSrghHu9OzGudyMg__thumb/img/i44rp-xvs_UHDdYlHFpHXdtawbk=/fit-in/200x150/filters:strip_icc()/pic5391652.jpg","urlImage":"https://cf.geekdo-images.com/vloLEctSrghHu9OzGudyMg__original/img/LsObjLfIcsi73GiSm13ZFDEqIjM=/0x0/filters:format(jpeg)/pic5391652.jpg"},{"bggId":"273272","name":"Hell in the Holy Land: The First and Second Battles of Gaza, March-April 1917","description":"&lsquo;Then from the little hills, the Desert Column called down joyful greetings to this splendid army. What boyish-faced, cheerful lads they are! And so on, right until after the sun dimmed down, tramp, tramp, tramp. It is late now, we feel that Constantinople is ours.&rdquo; &ndash;March 25, 1917 diary entry by Trooper Ion Idriess of the 5th Light Horse Regiment, ANZAC Division.&#10;&#10;Hell in the Holy Land: The First and Second Battles for Gaza is a wargame simulation of the first major offensives by Allied forces in in Palestine during World War. Following defeats along the Suez Canal the Ottoman government forcibly evacuated the civilians of Gaza and began fortifying the town and nearlby high ground. The Allied forces occupied the Sinai but could only slowly build up forces for a sustained offensive, and only after extensive work was completed on rail lines and water pipeline from Egypt. In the Spring of 1917 this work was completed and both sides prepared for a fight. In the meantime the Ottoman Empire had won significant victories over the Allies at the Gallipoli peninsula, and in Iraq where a British and Indian army were compelled to surrender after a grueling siege. The Allies brought to Gaza hundreds of artillery, the largest concentration of this weaponry outside of the Western Front, including gas chemical shells, as well as tanks. The Ottomans had also rushed reinforcements, including veterans who were at Gallipoli, German advisors, and aircraft.&#10;&#10;Can you do as well or better than your historical counterparts? Learn and enjoy!&#10;&#10;-description from pubisher&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":120,"maxPlayTime":240,"minAge":12,"categoriesAndMechanics":["Wargame","World War I","Chit-Pull System","Dice Rolling","Hexagon Grid","Simulation"],"rating":3.875,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/2o4z49AMcWa445kMDYv_cQ__thumb/img/A0pL2YY1HXZSNz2WeRL3o-jDlIY=/fit-in/200x150/filters:strip_icc()/pic4603075.jpg","urlImage":"https://cf.geekdo-images.com/2o4z49AMcWa445kMDYv_cQ__original/img/OuHvP_hr5Pl9jx7DDu-L3s9mAIU=/0x0/filters:format(jpeg)/pic4603075.jpg"},{"bggId":"273276","name":"トライアングル (TRIANGLE)","description":"User summary&#10;&#227;&#131;&#136;&#227;&#131;&#169;&#227;&#130;&#164;&#227;&#130;&#162;&#227;&#131;&#179;&#227;&#130;&#176;&#227;&#131;&#171; (Toraianguru) TRIANGLE is a co-operative card game where players try to release captured people of their kingdom. The game allows solitaire play.&#10;&#10;In this game, there are 55 cards numbered 1-10, and the number on the card equals to the number of that card in the game. Of these 55 cards, the deck is shuffled and thirty-five cards are placed on the table. Players take turns playing cards from their hand to remove cards from the table.&#10;&#10;Before the game starts, the players make a tableau of 35 cards, in overlapping skewed rows. Some are face up, some are face-down. (Place five of them in the first row. Then place next five cards in the second row, covering half of the previous row, sliding half of the card length rightward. Continue placing until the seventh row is made. By doing so, only the bottom (seventh) row is fully visible, and most of the cards are partially hidden by two cards of the next row.)&#10;&#10;During your turn, you play a card from your hand to remove a fully visible card of the same value. Alternatively, you play two cards from your hand to remove a fully visible card whose value equals to the sum or difference of your two cards.&#10;&#10;After you remove a card from the table, new cards can be fully visible. If there is a pair of fully visible cards of the same value, they are removed immediately. Continue this chain reaction until no pair is made.&#10;&#10;When you can't remove any card by playing from your hand, you must spend a joker to remove any one card. All players lose the game if five jokers are spent and still you can't remove any card.&#10;&#10;All players win the game when all cards are removed from the table.&#10;&#10;Publisher's summary&#10;Rescue the people trapped in the kingdom! A co-operative card game using a total of 55 cards, from one &ldquo;1&rdquo; card to ten &ldquo;10&rdquo; cards.&#10;&#10;Each player in turn uses cards to make pairs with the cards in the center to remove them. The players are considered as the winners if all the cards in the center are removed. Although you may not talk about the numbers in your hand, you may form a strategy based on the number of cards of each type and aim for a win by communicating with your fellow players. It feels wonderful when you get a chain reaction!&#10;&#10;Aim for a high score by using techniques such as adding/subtracting the numbers of two cards from your hand.&#10;&#10;&#233;&#150;&#137;&#227;&#129;&#152;&#232;&#190;&#188;&#227;&#130;&#129;&#227;&#130;&#137;&#227;&#130;&#140;&#227;&#129;&#159;&#231;&#142;&#139;&#229;&#155;&#189;&#227;&#129;&#174;&#228;&#186;&#186;&#227;&#128;&#133;&#227;&#130;&#146;&#230;&#149;&#145;&#229;&#135;&#186;&#227;&#129;&#151;&#227;&#130;&#136;&#227;&#129;&#134;&#239;&#188;&#129;&#227;&#128;&#128;1&#227;&#129;&#140;1&#230;&#158;&#154;&#239;&#189;&#158;10&#227;&#129;&#140;10&#230;&#158;&#154;&#232;&#168;&#136;55&#230;&#158;&#154;&#227;&#129;&#174;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#130;&#146;&#228;&#189;&#191;&#227;&#129;&#163;&#227;&#129;&#159;&#229;&#141;&#148;&#229;&#138;&#155;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#130;&#178;&#227;&#131;&#188;&#227;&#131;&#160;&#227;&#128;&#130;&#10;&#233;&#160;&#134;&#231;&#149;&#170;&#227;&#129;&#171;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#130;&#146;&#229;&#135;&#186;&#227;&#129;&#151;&#227;&#129;&#166;&#227;&#129;&#132;&#227;&#129;&#141;&#227;&#128;&#129;&#229;&#160;&#180;&#227;&#129;&#174;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#129;&#168;&#227;&#131;&#154;&#227;&#130;&#162;&#227;&#130;&#146;&#227;&#129;&#164;&#227;&#129;&#143;&#227;&#129;&#163;&#227;&#129;&#166;&#229;&#143;&#150;&#227;&#130;&#138;&#233;&#153;&#164;&#227;&#129;&#132;&#227;&#129;&#166;&#227;&#129;&#132;&#227;&#129;&#141;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#229;&#160;&#180;&#227;&#129;&#174;&#227;&#129;&#153;&#227;&#129;&#185;&#227;&#129;&#166;&#227;&#129;&#174;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#130;&#146;&#229;&#143;&#150;&#227;&#130;&#138;&#233;&#153;&#164;&#227;&#129;&#145;&#227;&#129;&#159;&#227;&#130;&#137;&#227;&#131;&#151;&#227;&#131;&#172;&#227;&#130;&#164;&#227;&#131;&#164;&#227;&#131;&#188;&#229;&#133;&#168;&#229;&#147;&#161;&#227;&#129;&#174;&#229;&#139;&#157;&#229;&#136;&#169;&#227;&#128;&#130;&#229;&#144;&#132;&#232;&#135;&#170;&#227;&#129;&#174;&#230;&#137;&#139;&#230;&#156;&#173;&#227;&#129;&#174;&#230;&#149;&#176;&#229;&#173;&#151;&#227;&#130;&#146;&#232;&#168;&#128;&#227;&#129;&#134;&#227;&#129;&#174;&#227;&#129;&#175;&#231;&#166;&#129;&#230;&#173;&#162;&#227;&#129;&#167;&#227;&#129;&#153;&#227;&#129;&#140;&#227;&#128;&#129;&#229;&#144;&#132;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#129;&#174;&#230;&#158;&#154;&#230;&#149;&#176;&#227;&#130;&#146;&#227;&#130;&#130;&#227;&#129;&#168;&#227;&#129;&#171;&#228;&#189;&#156;&#230;&#136;&#166;&#227;&#130;&#146;&#231;&#171;&#139;&#227;&#129;&#166;&#227;&#128;&#129;&#229;&#163;&#176;&#227;&#130;&#146;&#227;&#129;&#139;&#227;&#129;&#145;&#229;&#144;&#136;&#227;&#129;&#163;&#227;&#129;&#166;&#227;&#130;&#175;&#227;&#131;&#170;&#227;&#130;&#162;&#227;&#130;&#146;&#231;&#155;&#174;&#230;&#140;&#135;&#227;&#129;&#151;&#227;&#129;&#190;&#227;&#129;&#151;&#227;&#130;&#135;&#227;&#129;&#134;&#227;&#128;&#130;&#228;&#184;&#138;&#230;&#137;&#139;&#227;&#129;&#143;&#233;&#128;&#163;&#233;&#142;&#150;&#227;&#129;&#140;&#230;&#177;&#186;&#227;&#129;&#190;&#227;&#129;&#163;&#227;&#129;&#159;&#227;&#129;&#168;&#227;&#129;&#141;&#227;&#129;&#174;&#231;&#136;&#189;&#229;&#191;&#171;&#230;&#132;&#159;&#227;&#129;&#175;&#230;&#160;&#188;&#229;&#136;&#165;&#227;&#129;&#167;&#227;&#129;&#153;&#239;&#188;&#129;&#227;&#128;&#128;&#230;&#137;&#139;&#230;&#156;&#173;&#227;&#129;&#174;2&#230;&#158;&#154;&#227;&#129;&#174;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#129;&#174;&#230;&#149;&#176;&#229;&#173;&#151;&#227;&#130;&#146;&#232;&#182;&#179;&#227;&#129;&#151;&#229;&#188;&#149;&#227;&#129;&#141;&#227;&#129;&#151;&#227;&#129;&#166;&#229;&#135;&#186;&#227;&#129;&#153;&#227;&#131;&#134;&#227;&#130;&#175;&#227;&#131;&#139;&#227;&#131;&#131;&#227;&#130;&#175;&#227;&#129;&#170;&#227;&#129;&#169;&#227;&#130;&#130;&#233;&#167;&#134;&#228;&#189;&#191;&#227;&#129;&#151;&#227;&#129;&#166;&#227;&#128;&#129;&#233;&#171;&#152;&#229;&#190;&#151;&#231;&#130;&#185;&#227;&#130;&#146;&#231;&#155;&#174;&#230;&#140;&#135;&#227;&#129;&#157;&#227;&#129;&#134;&#239;&#188;&#129;&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":20,"minAge":6,"categoriesAndMechanics":["Card Game","Fantasy","Medieval","Number","Party Game","Puzzle","Cooperative Game","Hand Management","Modular Board"],"rating":3,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/UOx8amO9-Twab7pnuZ_z0A__thumb/img/Ahl9sKurHLEB-dXpuL6GpmXqnAo=/fit-in/200x150/filters:strip_icc()/pic5150360.jpg","urlImage":"https://cf.geekdo-images.com/UOx8amO9-Twab7pnuZ_z0A__original/img/xuwk9BJD-ztBoEBC6YYSqMYjcn0=/0x0/filters:format(jpeg)/pic5150360.jpg"},{"bggId":"273277","name":"The Little Game of Beer","description":"This beer-themed trivia/party game can be played in two teams or with at least two players.&#10;The object of the game is to win as many cards as possible, by answering questions about beer and performing tasks from the activity cards. Each card is worth 1 point. The first player to reach the finish space on the board wins the game.&#10;&#10;Activity cards come in two types: &quot;Picture memo&quot; and &quot;Anagrams&quot;. &quot;Picture memo&quot; means the active player has to memorize the picture on the card. After 30 seconds, the player on the left makes up a question about the picture, which the active player has to answer. In the &quot;Anagrams&quot; activity, there are three words on the card, with their letters jumbled. The active player has to guess the words while the timer is running.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":99,"minPlayTime":30,"maxPlayTime":30,"minAge":18,"categoriesAndMechanics":["Memory","Party Game","Trivia","Word Game"],"rating":2.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/iAwp2U_5dic5Bp5sjJPdvw__thumb/img/9pwIJkCKuH8goQw2qhCVq4QaXRM=/fit-in/200x150/filters:strip_icc()/pic4610137.jpg","urlImage":"https://cf.geekdo-images.com/iAwp2U_5dic5Bp5sjJPdvw__original/img/KtcxsZe31gI86L8l0jTSegGcSCE=/0x0/filters:format(jpeg)/pic4610137.jpg"},{"bggId":"273278","name":"Doodad","description":"doodad is a captivating card game that requires strategy, creativity and a bit of malicious maneuvering.   The object of the game is to spell &lsquo;doodad&rsquo; with the Letter cards you collect &ndash; with the challenging twist that you can&rsquo;t put one Letter card next to another unless the symbol and/or color on the cards match. The dastardly Strike card allows you to steal cards from your opponents and ruin their best-laid plans, but remember that turnabout is fair play! Play it safe with a quick easy score&hellip; or go all in with a more difficult scheme to get extra points!   How will you doodad?&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":3,"maxPlayers":8,"minPlayTime":15,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Party Game","Word Game","Open Drafting","Set Collection","Take That"],"rating":2.43182,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/2ClUgxDWsfd6be0pOR4Zcg__thumb/img/4ox9CMKOYZfR5cD1LkopNz3L664=/fit-in/200x150/filters:strip_icc()/pic4842478.jpg","urlImage":"https://cf.geekdo-images.com/2ClUgxDWsfd6be0pOR4Zcg__original/img/3fAWvVJ89dHW7qoIpIYT6OfJGf8=/0x0/filters:format(jpeg)/pic4842478.jpg"},{"bggId":"273279","name":"Cryptid Clash","description":"Cryptid Clash! is a fast-paced, two-player card game that features clean, simple rules and uncomplicated game mechanics. Each player plays groups of Cryptids from their hand that battle in one of three different environments. Winners keep defeated Cryptids as Victory Points. The winner is determined after several rounds of play.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":45,"minAge":5,"categoriesAndMechanics":["Card Game","Mythology"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/ukQPrz5KBpPJNbIJQJoo3g__thumb/img/Rj2cOQQulIQK8-b1zzE7aI4_m-c=/fit-in/200x150/filters:strip_icc()/pic4590464.jpg","urlImage":"https://cf.geekdo-images.com/ukQPrz5KBpPJNbIJQJoo3g__original/img/gl_a0l3UsN7I-5fiGO-HZLpGFqA=/0x0/filters:format(jpeg)/pic4590464.jpg"},{"bggId":"273280","name":"Bezzerwizzer Bricks: Krimi","description":"A small 60 card quiz game about crime fiction.&#10;Also has a category tile to make this an expansion for the big Bezzerwizzer games.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":15,"categoriesAndMechanics":["Party Game","Trivia","Betting and Bluffing","Simultaneous Action Selection"],"rating":3,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/kwH1v2EsGlqN4NtJzq34Fw__thumb/img/X1rJn_q7fx31gqW68QX_XFClCu8=/fit-in/200x150/filters:strip_icc()/pic6210432.jpg","urlImage":"https://cf.geekdo-images.com/kwH1v2EsGlqN4NtJzq34Fw__original/img/xflRP8iR4oRaOcCmhluxb93LgoI=/0x0/filters:format(jpeg)/pic6210432.jpg"},{"bggId":"273281","name":"Bezzerwizzer Bricks: Sportens triumfer","description":"A small 60 card quiz game about sports.&#10;Also has a category tile to make this an expansion for the big Bezzerwizzer games.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":15,"categoriesAndMechanics":["Party Game","Trivia","Betting and Bluffing","Simultaneous Action Selection"],"rating":1.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/x1gLVFaeV6Av2ccVVOu6qQ__thumb/img/_l2HV32_t0gxVF2rCCXVBTgRoMY=/fit-in/200x150/filters:strip_icc()/pic6210448.jpg","urlImage":"https://cf.geekdo-images.com/x1gLVFaeV6Av2ccVVOu6qQ__original/img/SltCFv0eAikF5Xlnbp00A2za5ic=/0x0/filters:format(jpeg)/pic6210448.jpg"},{"bggId":"273282","name":"Bezzerwizzer Bricks: Rock","description":"A small 60 card quiz game about rock music.&#10;Also has a category tile to make this an expansion for the big Bezzerwizzer games.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":15,"categoriesAndMechanics":["Party Game","Trivia","Betting and Bluffing","Simultaneous Action Selection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/qjZ3Z4If_RR0M9vbPe8aqw__thumb/img/9x4-uvmk45pbtxx9U9hQWQkeOwQ=/fit-in/200x150/filters:strip_icc()/pic6210450.jpg","urlImage":"https://cf.geekdo-images.com/qjZ3Z4If_RR0M9vbPe8aqw__original/img/1Uhl7pmqk3aLvYiaejetivL_9HM=/0x0/filters:format(jpeg)/pic6210450.jpg"},{"bggId":"273338","name":"Pick Your Brain","description":"Pick Your Brain is a family based trivia game consisting of 52 trivia cards with each card having 4 categories totaling 208 trivia questions in each deck, currently we have one deck available but I&rsquo;ll be expanding in the near future. The game is designed for 2 or more players, we suggest ages 8 and up.  The object of the game is to reach 100 points first. What&rsquo;s in the box: 52 card deck, 5 pencils, 1 (30 second) timer, answer tablets, 1 rule sheet and score sheet.&#10;&#10;GAME PLAY: at the beginning of the game a &ldquo;game moderator&rdquo; is picked and supplies are handed out to each player.  The moderator picks a category card from the deck and chooses one of the 4 categories I.e. state nicknames. Once the moderator has told the players the category the moderator will announce begin, at that point the moderator will start the sand timer. Each player with a moderator approved correct answer will be awarded a point. First player to 100 points wins.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":99,"minPlayTime":45,"maxPlayTime":1,"minAge":8,"categoriesAndMechanics":["Trivia"],"rating":5,"complexity":0},{"bggId":"273339","name":"Home from Oz","description":"Get ready for an adventure through the land of Oz. As you make your way home by following the Yellow Brick Road, you will encounter both friends and enemies. Beware the Winged Monkeys or the Fighting Trees that will try to keep you from reaching home.  Gain protection from obstacles by befriending the Cowardly Lion, Tin Woodman, and Scarecrow. The Wicked Witch will try to stall your progress, but just as your friend Dorothy realized in her own journey through Oz, a simple bucket of water will get you back on your way.  What happens when you encounter the Wizard or try to make your way through the Poppy Field?  Find out when you get swept away by the tornado into this mystical land.&#10;&#10;Home from Oz is a card game for 2-4 players, ages 8-adult.&#10;&#10;Note: The expanded edition which goes up to 6 players is found here: Home from Oz: Expanded Starter Set&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":90,"minAge":0,"categoriesAndMechanics":["Card Game","Lose a Turn","Race","Trading"],"rating":3.65,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/SzTSYKFvNx87ur6Is3zXSA__thumb/img/RbnTpwDUtHZdAg7oLZlHqB57AIY=/fit-in/200x150/filters:strip_icc()/pic7045691.jpg","urlImage":"https://cf.geekdo-images.com/SzTSYKFvNx87ur6Is3zXSA__original/img/Jjj13E74v0_u7l5X0jIcW3GakxE=/0x0/filters:format(jpeg)/pic7045691.jpg"},{"bggId":"273371","name":"The Crazy Horse Game","description":"This game can be played in 5 minutes. You will need a die and a PanzerBlitz or Blitzkrieg board or a blank hex sheet. It simulates an Indian boy on a pony hunting a Buffaloe. [sic]&#10;&#10;&mdash;description from the publisher&#10;&#10;This simple hex-and-counter game has only two counters, the Indian and the &quot;Buffaloe.&quot; The Indian player wins by killing the buffalo. The buffalo player wins by goring the Indian boy or his pony. There are three different types of buffalo (calf, cow, and bull) distinguished by a Power Factor number, which also represents how much damage the buffalo can sustain. Terrain types include trees, slopes, and ditches.&#10;&#10;Published in issue #2 of JagdPanther magazine which has been rereleased in PDF format by Amarillo Design Bureau.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":5,"maxPlayTime":5,"minAge":0,"categoriesAndMechanics":["American West","Fighting","Hexagon Grid"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/3EsiMR698OQ1UDorMsmwHg__thumb/img/6CTkqk0iSk5PCnu_AFMujG5Udv0=/fit-in/200x150/filters:strip_icc()/pic4604391.png","urlImage":"https://cf.geekdo-images.com/3EsiMR698OQ1UDorMsmwHg__original/img/nbe42wnlRY9vC6oPGJIMBNiy4AU=/0x0/filters:format(png)/pic4604391.png"},{"bggId":"273386","name":"RN: Naval Superiority Game of World War II","description":"This Game attempts to simulate the conflict between the Royal Navy and the Kriegsmarine during WWII. Also included are the ships projected in Admiral Raeder's &quot;Z&quot; plan before the War.&#10;&#10;&mdash;description from the publisher&#10;&#10;A ship-to-ship miniatures game of surface combat using written orders for movement and firing. There are four scenarios. Statistics are included for over 30 classes of ships.&#10;&#10;Published in issue #5 of JagdPanther magazine which has been rereleased in PDF format by Amarillo Design Bureau.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":90,"maxPlayTime":90,"minAge":0,"categoriesAndMechanics":["Miniatures","Nautical","Wargame","World War II","Simulation"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/QoSsYbaTJ_fA0aiZOJ3UHg__thumb/img/q8UVae-PWa_lE-1px6L8MAN5hZ8=/fit-in/200x150/filters:strip_icc()/pic4583033.png","urlImage":"https://cf.geekdo-images.com/QoSsYbaTJ_fA0aiZOJ3UHg__original/img/I5MaRXsOJD1PqOHBNADvFJNhL7I=/0x0/filters:format(png)/pic4583033.png"},{"bggId":"273389","name":"Fantascatti Express","description":"Tommy is a smart boy. He wants to become a detective, specialized in &ldquo;peculiar&rdquo; cases. Therefore, despite his young age, he bravely explores an old abandoned castle, armed only with his camera, looking for naughty ghosts.&#10;It will not be easy because ghosts will try to confuse the young detective.&#10;&#10;Will you help him?&#10;&#10;Initially, players spread all ghost cards in the middle of the table facing up. Cards show different combinations of the 4 colored ghosts. At the beginning of each round players roll all 4 colored dice. Then, by simultaneously picking ghost cards, they try to collect a ghosts' combination that exactly matches with the dice result. Fast reasoning and a sharp eye will turn out to be crucial, as taken cards can't be put back on the table. &#10;As soon as a player feels satisfied, he/she calls for the round's end. Then all players stop picking cards and see what they got. Players get minus points for each ghost over or less than the dice result.&#10;At the end of the fifth round, the player with the least minus points wins the game.&#10;&#10;2 optional rules are included. They help change the game mechanics.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":15,"maxPlayTime":30,"minAge":7,"categoriesAndMechanics":["Dice","Real-time","Dice Rolling"],"rating":3.20647,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/Y2MCcGOoTsQeiXvfKci76A__thumb/img/RxUlgGX_pTx3on_Vj8tCywQhwy4=/fit-in/200x150/filters:strip_icc()/pic4642907.png","urlImage":"https://cf.geekdo-images.com/Y2MCcGOoTsQeiXvfKci76A__original/img/ZNcZNubzYyirVy4FUK4qGeCjHmI=/0x0/filters:format(png)/pic4642907.png"},{"bggId":"273391","name":"Kamikaze","description":"A battle royal in wich all the crazy things are permitted!&#10;&#10;Kamikaze it's a fast and dinamyc card game for two players. The game is a duel where you can use a huge, crazy and variated weapons arsenal like explosives, fire weapons, biological attacks... even you can manipulate the weather conditions or taming wild animals to achieve your evil purposes.&#10;&#10;GAME GOAL&#10;&#10;Be the first in eliminate the 20 lives of your opponent.&#10;&#10;To destroy your adversary take attention to the almost infinite objects combinations that will make each game unpredictable. The combos will raise the damage points, the more cards you use the more lethal attack will be.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":10,"maxPlayTime":20,"minAge":12,"categoriesAndMechanics":["Action / Dexterity","Animals","Card Game","Dice","Fighting","Humor","Party Game","Acting","Dice Rolling","Hand Management","Pick-up and Deliver","Player Elimination","Set Collection"],"rating":3.1875,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/aqcyF-aRKttCJsGfNiPl8A__thumb/img/0Sw5WPx0V5-30u1f3BfQndlr2kM=/fit-in/200x150/filters:strip_icc()/pic4602476.jpg","urlImage":"https://cf.geekdo-images.com/aqcyF-aRKttCJsGfNiPl8A__original/img/5zzDDYL1q9xauKwJklR_QWAIHwU=/0x0/filters:format(jpeg)/pic4602476.jpg"},{"bggId":"273396","name":"Chameleon","description":"Chameleon is a chess-like strategy game, played on a 5 x 5 grid,  where each piece's movement capability changes based on the color of the tile where it lands.&#10;&#10;In traditional Chess the black and white checkerboard pattern only determines starting positions.  Chameleon's pieces each have a central color or nature.   This nature changes the way each piece can move based on the tile where it sits.  Like a Chameleon, each piece changes based on it surroundings creating a dynamic and fun game experience.&#10;&#10;All pieces can always move one space in any of eight directions like the King in Chess. But they have additional Chameleon movement capability that changes according to their nature color and tile color where they are placed - either like a Bishop when on a like colored square, or a Knight when on a square of the opposite color.&#10;&#10;There are three winning goals:&#10;&#10;&#10;     A player who captures all opponent's pieces wins the game.&#10;     A player who moves any one of their own piece to the opponent's area (farthest five tiles), and it isn't recaptured immediately, wins the game.&#10;     If a player who has only one active piece on the board and moves it onto the opponent's area they win the game immediately without waiting for the opponent's next turn.&#10;&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":5,"maxPlayTime":15,"minAge":0,"categoriesAndMechanics":["Abstract Strategy","Point to Point Movement","Square Grid"],"rating":4.041665,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/TotL4V1YiM016BQ8nMTvMw__thumb/img/QHCC-bhyVyQLABw5RDDYqC03sQ4=/fit-in/200x150/filters:strip_icc()/pic4589898.jpg","urlImage":"https://cf.geekdo-images.com/TotL4V1YiM016BQ8nMTvMw__original/img/vbeFUBl2cUCnVUj9QDRfahJ-esk=/0x0/filters:format(jpeg)/pic4589898.jpg"},{"bggId":"273408","name":"Mosaic","description":"Mosaic is a roll-and-write game, like Yahtzee. You supply the dice and the pencils, and print off one copy of the first page for each player. The second page has the rules.&#10;&#10;Object&#10;To score the most Victory Points (VPs) by reconstructing only the genuine portions of ancient mosaic, while avoiding the fake regions.&#10;&#10;Setup - Each Player Does This Separately:&#10;&#10;     Roll a die and mark off the entire row of tiles corresponding to that number&#10;     Roll the die again and, counting from left to right, mark off the corresponding column of tiles. Then, mark off the arrows pointing to that tile, and continue marking off arrows so that every column is pointed to by only one arrow.&#10;     Place all the dice in the dice bag and pick a starting player, who draws three dice (two in solo play). You are now ready to begin play.&#10;&#10;&#10;How To Play&#10;The active player takes the die passed to her, draws two dice and rolls them. On the first turn of the game, roll all three dice drawn in setup). She selects one die. Using the color to determine column and the number to determine row, she marks off the corresponding tile, and draws that tile on her mosaic. The other players do the same, selecting only from the two dice she did not select. Multiple players may select the same die from the remaining two. When you select a die pointing to a tile that is already marked out mark out a different tile in that column, and mark off and place a 1-stone tile from your reserve. After all players are done, the active player passes her die to the next player, and discards the other two dice. If the dice bag is empty. place all discarded dice back in the bag. Pass the bag to the next player, going clockwise, and continue playing. In Solo play, draw two dice per turn, do not keep any dice from turn to turn, and refill the bag when there is only one die left in the bag.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":10,"maxPlayTime":20,"minAge":8,"categoriesAndMechanics":["Dice","Print & Play","Paper-and-Pencil"],"rating":2.27778,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/CR83Dtk7INNdxWsrbcDChQ__thumb/img/fD9Pf6yEbLOWlYmraxOQYDrrZhk=/fit-in/200x150/filters:strip_icc()/pic4608161.jpg","urlImage":"https://cf.geekdo-images.com/CR83Dtk7INNdxWsrbcDChQ__original/img/PTbWZ0Amuy3Afle371A9nIJzjqo=/0x0/filters:format(jpeg)/pic4608161.jpg"},{"bggId":"273436","name":"Rebel Fury","description":"Rebel Fury, Volume I of the Civil War Heritage Series, uses the low-complexity Gettysburg system featured in C3i #32. The Battles featured are Chickamauga, Chattanooga, Wilderness, Spotsylvania, Chancellorsville, and Fredericksburg (solitaire).&#10;&#10;This design features a new system on Civil War combat akin to the old SPI Blue and Gray Quads. Each game in Rebel Fury is quick-set-up, quick-playing, and deeply interactive. The density of counters in each scenario is low, allowing you to see and experience the big picture of the battle.&#10;&#10;Rebel Fury places you, the player, in the role of the Army Commander (Lee, Burnside, Hooker, Bragg, Rosecrans, Grant).  You maneuver your army to find the enemy&rsquo;s flanks, concentrate your forces for an attack, and determine where to commit your artillery assets.&#10;&#10;Units are portrayed at the Infantry/Cavalry division level. The Civil War Heritage Series game system features a new Zone of Influence/Zone of Control mechanic that controls unit formation (March/Battle) based on their proximity to your opponent. As your units close with the enemy, your forces naturally break into battle formation, where they then maneuver the last distance to engage. Unlike most hex and counter wargames, this system allows you total freedom to move units in any order multiple times, unleashing the full range of historical tactics in a simple and clean format.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["American Civil War","Civil War","Post-Napoleonic","Wargame","Dice Rolling","Grid Movement","Hexagon Grid","Movement Points","Simulation","Zone of Control"],"rating":4.5,"complexity":2.1667,"urlThumb":"https://cf.geekdo-images.com/3RfuiUj5HDqdtCW3g_1u0A__thumb/img/RiNbi34zBXxr8VhSoZLRENz6R3w=/fit-in/200x150/filters:strip_icc()/pic7886897.png","urlImage":"https://cf.geekdo-images.com/3RfuiUj5HDqdtCW3g_1u0A__original/img/JOKJNIGgclPzZAkdbOjEl6u5tZ4=/0x0/filters:format(png)/pic7886897.png"},{"bggId":"273438","name":"Jafabit","description":"Jafabit is a player elimination board-game designed for 2 or more players. It combines elements of Chess with resource gathering and dice rolling mechanics on a 3D hexagonal tile map. It gracefully balances strategy and luck.&#10;&#10;Jafabit is simple to set up and learn! Everything is color-coded and just makes sense. Maps look like maps complete with mountains and valleys. Everyone has a set of Chess-Dice they use to gather resources and dominate the map. Combining polyhedral dice and Chess pieces is what really brings Jafabit to a new level.&#10;&#10;Jafabit is modular, with countless possible game maps to play on. A typical game lasts between a half an hour and a full hour, but can go a little longer. Jafabit is designed for ages 10 and up.&#10;&#10;Jafabit is more than just a game it&rsquo;s a game system. There are numerous optional expansions already in the works. The first of these optional expansions is The Mists expansion and will be included in the initial release.&#10;&#10;Layering new rules and pieces on top of Jafabit can result in an infinite world of possibilities - entirely new games with a simple and fun interface to tie them all together! The base mechanics just meld so nicely and are completely open to expansion.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Dice","Exploration","Farming","Print & Play","Territory Building","Wargame","Area Majority / Influence","Deck, Bag, and Pool Building","Dice Rolling","Modular Board","Player Elimination"],"rating":5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/SZttAZxab-cHQ3AQBAIpvA__thumb/img/7ENBYzuwdImXO-iEr-i7PeJhjaE=/fit-in/200x150/filters:strip_icc()/pic7158447.jpg","urlImage":"https://cf.geekdo-images.com/SZttAZxab-cHQ3AQBAIpvA__original/img/oVCpPt_JiM_PW4OjJPpPiIUxwuE=/0x0/filters:format(jpeg)/pic7158447.jpg"},{"bggId":"273439","name":"Libertadores del Sur: The Wars for South American Independence, 1809-1824 (Vol. I)","description":"Libertadores del Sur is a two-player military simulation wargame of the Southern Theater of the Latin American Wars for Independence. The Patriot player controls the Argentine Ruling Directory forces and various federated and allied forces, while the Royalist player controls Spanish Regular Army, trained Loyalist South American forces and militia units. Several other historical armed factions contend for each player's attention when formulating strategy, from a land grabbing Portuguese-Brazilian Imperialist army, to local guerrilla units, breakaway Federal Republics, and a native Incan Rebellion in the Andes Highlands. Each player will face similar daunting logistical and political challenges as they attempt to impose their military will on their opponents over a vast theater of operations spanning Argentina, Chile, Paraguay, Uruguay, and parts Bolivia &amp; Brazil.&#10;&#10;Libertadores del Sur is an operational level simulation with a point to point card driven game system. Each turn represents one year's campaigning season. The players have a chance to raise and reorganize new forces prior to beginning operations, and reset their sides' morale, depending on how many provinces they control. During the Operations phase, players take turns playing cards causing historical events and/or activate forces to move and attack. Operations continue until the player's run out of cards, or run out of morale. When operations end, the players have a chance to consolidate political control over provinces where they drove out enemy forces, and combat units fall back to controlled areas. There are three scenarios allowing the players to start at different points of the campaign. The 1810 scenario starts with the first of the local juntas establishing themselves in response to Napoleon's invasion of the Iberian Peninsula. The 1814 scenario begins with Argentine General San Martin superseding Argentine General Belgrano, and the Patriots attempting to recover from various strategic set-backs. The 1817 scenario is a mini-game covering only the liberation of Chile.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Napoleonic","Post-Napoleonic","Wargame","Area Majority / Influence","Campaign / Battle Card Driven","Dice Rolling","Movement Points","Point to Point Movement","Simulation"],"rating":4.2,"complexity":2.25,"urlThumb":"https://cf.geekdo-images.com/9EjDzo7d4hhPvTfDSuNJgQ__thumb/img/SDfVBNQ-SmLrXOKV1_QIvztf3Lw=/fit-in/200x150/filters:strip_icc()/pic5404616.jpg","urlImage":"https://cf.geekdo-images.com/9EjDzo7d4hhPvTfDSuNJgQ__original/img/PUoiANfwmtIEdHRt7tf_M7mJfLg=/0x0/filters:format(jpeg)/pic5404616.jpg"},{"bggId":"273447","name":"Beat The Bookie","description":"Beat The Bookie is the highly entertaining, sociable and strategic board and card game depiction of a day at the races.&#10;&#10;Celebrating a race days three main characters; the Bookie, the Punter and the Horse Owner, players can purchase and sell horses, win prize money and gamble on the Bookie's odds on each of the eight races at the race meet.&#10;&#10;The aim of the game is to collect the highest value combination of trophies from the eight races. Trophies are awarded to the player who makes the most profit from each race, either through prizemoney, bet winnings, payouts from players' cards or through horse sales.&#10;&#10;There are three types of trophies on offer. Races 1-3 are known as Maiden Races, and are the least valuable. Trophies awarded for these races are bronze in colour and worth only 1 point each. &#10;Prize money for winning owners in the three maiden races are 1x the Profits (100k for a win, 75k for second place and 50k for third).&#10;&#10;Races 4-6 are known as Handicap races, and are more valuable. Trophies awarded for each of these three races are silver in colour and worth 2 points each. Winning horse owners get 2 x the profits if their horses finish top 3 (200k for a win, 150k for second and 100k for third).&#10;&#10;Finally, races 7 and 8 are known as the Feature Races and are the most valuable, worth three points. Prizemoney is tripled for these two races (300k for a win, 225k for second place and 150k for third). The trophies awarded for these two races are gold in colour.&#10;&#10;Beat The Bookie can be played with 2-8 players. At the beginning of a race meet, a player is nominated to act as the Bookie. The Bookie is a banker of sorts, and is responsible for auctioning the horses, collecting money, calling the horses, laying the horse cards on the track and settling any successful or unsuccessful bets. The Bookie also assigns the trophies are the end of each of the 8 races, but counting up the winnings of each player. The Bookie can also play as a player, but must keep their cash wallet and assets separate from that of the main 'bank'.&#10;&#10;Once a Bookie has been assigned, each player is provided with 300k of Beat The Bookie currency. This is to form each players 'cash wallet'. Player are also given six Bet Slip cards, which depict the names and pictures of each of the horses in the field. These cards are used to place the players' bets.&#10;&#10;The Bookie then conducts the pre-meet auction, and auctions off each of the six horses in the race, with a reserve price of 100k. Players may or may not bid on the horses, with the successful/highest bidder awarded an ownership card for the particular horse bought. The new owner must keep the ownership card until he/she elects to sell the horse to another player or back to the Bookie.&#10;&#10;Once the pre-meet auction has concluded, all players must draw a players card from the left hand panel of the game board. If a player owns a horse, they must draw an Owners Card, which features any fees due or payable to/from the Bookie for their horse. Even if a player owns multiple horses, they need only draw one Owners Card. If a player does not own any horses, they must draw a Punters Card, which offers a special or exotic for the upcoming race. Finally, the Bookie must draw a Bookies Card, which features the odds for the upcoming race. Players can then bet on the odds provided by the Bookies Card, by overturning their Bet Slip Card to reveal the name of the horse they intend to bet on, and placing their chosen bet amount on top of the Bet Slip Card.&#10;&#10;Once all bets are placed and accepted by the Bookie, the Bookie then shuffles the Horse Card deck. There are six cards for each of the six different horses. The Bookie then lays the cards out in order of the Horse, with each horse advancing once space down the game board each time it is drawn. The Bookie draws all the Horse Cards until there is a winner, a second place getter and a third place getter.&#10;&#10;At the conclusion of the race. The Bookie pays out the prize money to the winning owners. If a horse, that finishes first, second or third, is not owned, no prizemoney is awarded in respect of that horse. For races 1-3 (Maiden Races), the Bookie awards 1x the Profits. For races 4-6 (Handicap Races) the Bookie awards 2x the Profits and for races 7 and 8 (Feature Races), the Bookie awards 3 x the Profits.&#10;&#10;The Bookie must then payout any prizemoney owed under Punters Cards. Once done so, or if no prizemoney is awarded, the Punter must place his Punters Card back under the pile.&#10;&#10;Once prizemoney and punters payouts are awarded, the Bookie either pays out or collects on players' bets on the calculation provided for by the Bookies Card. If the Bookies Card showed odds of 4:1, and the player bet 10k, the Bookie must pay the player 40k. Unsuccesful bets are collected by the Bookie and placed back in the 'bank'.&#10;&#10;When all prize money and bet money is awarded, players must count their profits. A trophy (bronze for Maiden Races, silver for Handicap Races and gold for Feature Races) is provided to the player with the most profit from that race. The player keeps the trophy with their cash wallet for counting at the end of the game.&#10;&#10;Once trophies are awarded, all players draw their players cards again ahead of the next race.&#10;&#10;At the end of the game, the players then count the value of their trophies. Bronze trophies are worth 1 point, Silvers are worth 2, and Golds are worth 3. A Player could win the game by not having won any feature races. Conversely, a player might head into race 7 not having won any races for the entire meet, and could win races 7 and 8 and win the game.&#10;&#10;Players can trade their horses with other players at the conclusion of any races for an agreed price. Horses are valuable as they provide an alternative revenue stream. Horses drawn frequently in races may be worth selling, as chance would mean it's unlikely to win again. Players who do not purchase horses at the initial pre-meet auction may wish to purchase horses ahead of the more valuable Feature Races.&#10;&#10;A player is eliminated if they are declared bankrupt and have no more money or horses to play.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":30,"maxPlayTime":90,"minAge":14,"categoriesAndMechanics":["Party Game","Sports"],"rating":0,"complexity":0},{"bggId":"273448","name":"Cthulhu: The Great Old One – Deluxe Edition","description":"Cthulhu: The Great Old One (Deluxe Edition) is a quick-play card game based around the characters and mythology of the writings of H.P. Lovecraft.&#10;&#10;In Cthulhu: The Great Old One (Deluxe), each player takes their turn in order; first drawing, then stealing, then recruiting cards, and finally playing any Pairs they might hold, as well as any one Horror or Cultist card.&#10;&#10;Matched Pairs give 2 victory points, Linked Pairs give 1 victory point, as does any played Horror cards.&#10;&#10;Once any player completes their 7th pair, the game ends and players count up their victory points.&#10;&#10;If any player holds the Great Old One card, they lose the game regardless of points. However, if a player holds the Great Old One and has already played the Cultist card in their play area, they win! Otherwise, the player with the most victory points wins!&#10;&#10;With the Horror cards and game mechanics, there are a lot of fun strategies to keep the fast-paced action going, but there still remains a luck element as well to help give less experienced players a fighting chance against players who are more familiar with game possibilities.&#10;&#10;The Deluxe version is basically a whole new game drawing inspiration from the original, but re-implementing the system with new cards, new card types, new turn style and play mechanics, and updated card looks and text.&#10;&#10;-description from designer&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":15,"maxPlayTime":25,"minAge":10,"categoriesAndMechanics":["Card Game","Horror","Hand Management","Set Collection","Take That"],"rating":2.975,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/Sstvw21Pqc2x8sG3X2W2NA__thumb/img/RHckVg_-1Flv1pbA1RY9t-fpX0Q=/fit-in/200x150/filters:strip_icc()/pic4844855.jpg","urlImage":"https://cf.geekdo-images.com/Sstvw21Pqc2x8sG3X2W2NA__original/img/hcy_hsyLrKAjZ83CMLeDVWjFPM4=/0x0/filters:format(jpeg)/pic4844855.jpg"},{"bggId":"273466","name":"Dark Flow","description":"Dark Flow takes place on a planet that is located in the confines of the universe. This planet is the door to the multiverse. Different factions have converged on this planet to fight to take control of its domain.&#10;&#10;We are facing a competitive game, in which players must manage resources to win victory.&#10;&#10;Gameplay&#10;The game is divided into 5 Eras. Each Era consists of 3 phases:&#10;MAINTENANCE, SETTING UP, and ACTIONS, being the ACTIONS phase where the main dynamics of the game are found. Starting with the initial player and following clockwise each player performs 1 action among the following:&#10;Upgrade;&#10;Extract Resources;&#10;Recruit;&#10;Move;&#10;Attack;&#10;Build.&#10;&#10;Winning conditions&#10;After finishing the 5th Age, players will check the game board to check majorities, constructions and to that they will add several points (unused power up tokens, constructions on the game board, monsters eliminated, final score cards,extra portal construction, recruitment of the faction leader, ...).&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Miniatures","Science Fiction","Area Majority / Influence","Area Movement","Dice Rolling","Modular Board"],"rating":4.260415,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/wvM6WPiN48lyU0I_TR0Jmw__thumb/img/64TkwZkhxF1DQuQIihmr2jfPZYI=/fit-in/200x150/filters:strip_icc()/pic4886638.jpg","urlImage":"https://cf.geekdo-images.com/wvM6WPiN48lyU0I_TR0Jmw__original/img/HwCLH0eMTAyBWqcyyAjhTPdWVLc=/0x0/filters:format(jpeg)/pic4886638.jpg"},{"bggId":"273469","name":"Der Elektro-Kühlschrank","description":"Each player has his own track from space 1 to space 100, the fridge. Movement is determined by a die. The first player to reach space 100, wins the game. On some spaces events hinder or benefit the player.&#10;&#10;This game was published about 1929-1931 to promote electric fridges in Germany.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Racing","Dice Rolling","Point to Point Movement","Roll / Spin and Move"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/d9vKpwqsTUlBemIXCSxQzw__thumb/img/nsOx9wgnAdlSn7QEYhpAqi6XG-U=/fit-in/200x150/filters:strip_icc()/pic4604861.jpg","urlImage":"https://cf.geekdo-images.com/d9vKpwqsTUlBemIXCSxQzw__original/img/MoUUhhd8WD2lhnRk5UtvGWxatr4=/0x0/filters:format(jpeg)/pic4604861.jpg"},{"bggId":"273474","name":"Les saisons","description":"Les saisons is a loto game base game. Each player has a board. At his turn, he choose a hidden tile. If it fits his board, he can plug it and play again, if not an other player plays. The first to finish his board wins.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":4,"categoriesAndMechanics":["Memory","Memory","Tile Placement"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/z_wku9S7T6hNt3xz3ZtaYg__thumb/img/N_B961N5MLxSXyslMx3GZ55W0fc=/fit-in/200x150/filters:strip_icc()/pic4618236.jpg","urlImage":"https://cf.geekdo-images.com/z_wku9S7T6hNt3xz3ZtaYg__original/img/9n68aPUW2eD0NsED-x2kIYycfeM=/0x0/filters:format(jpeg)/pic4618236.jpg"},{"bggId":"273476","name":"Tempus Quest: Episode 1 – Uninvited Guests","description":"The crew makes their escape from Athena colony in the freshly rebuilt Tempus. Before they can make the jump to metaspace, however, the crew is boarded by Dyanstic scout drones.&#10;&#10;Games in the Tempus series work similarly to roll and write games where players roll dice and use the results to fill in a sheet. In the Tempus System, instead of using dice, players will use the date and time to randomize setup and available actions.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":15,"maxPlayTime":15,"minAge":10,"categoriesAndMechanics":["Print & Play","Puzzle","Science Fiction","Grid Movement","Network and Route Building","Paper-and-Pencil","Set Collection"],"rating":3.714285,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/8GoMxSOdtVZj1p6-BRBl-A__thumb/img/JVWkOxTs-q2SeSURboLbDp4EYrI=/fit-in/200x150/filters:strip_icc()/pic5758053.png","urlImage":"https://cf.geekdo-images.com/8GoMxSOdtVZj1p6-BRBl-A__original/img/4vo5YP_LMMeYm_MTPF5BicA_QjA=/0x0/filters:format(png)/pic5758053.png"},{"bggId":"273478","name":"Ilmajääkärit","description":"War-themed abstract game published during the Second World War, where one player controls 8 paratroopers that are randomly placed in the center of the board by rolling dice, then try to move to place demolition charges in marked locations in each corner of the board. In each corner begins 4 defending guards, mechanics, pilots, or gunners, for a total of 16 defenders, that are played by one to four players. All pieces are paper standees and the rules for all types are identical. Surrounded pieces surrender, and no piece can move in the gap between two enemy pieces. The board is laid out with white circles that only paratroopers use for movement and red circles used by the defenders. Dice are only used for the paratrooper set up, with the rest of the game being deterministic each player allowed to make 4 moves, divided to 1-4 pieces as they wish.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Wargame","World War II","Dice Rolling","Point to Point Movement"],"rating":2,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/jrrAQvTu7fF3Pu66wHpsYA__thumb/img/0LzRpZ7jZHAEMQwPbUUzJqBpA9w=/fit-in/200x150/filters:strip_icc()/pic4605063.jpg","urlImage":"https://cf.geekdo-images.com/jrrAQvTu7fF3Pu66wHpsYA__original/img/QUP1UOzLHG-67qPtL4jFDbMlAwU=/0x0/filters:format(jpeg)/pic4605063.jpg"},{"bggId":"273479","name":"Das verwunschene Schloss","description":"The players start at space 1. Movement is determined by a die. On some spaces events hinder or benefit the player. The first player to reach the treasure vault on space 50 wins the game.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Children's Game","Medieval","Racing","Roll / Spin and Move"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/YcI7OCX2ExMY9WGFKh3JIg__thumb/img/3zLelWD_qUOaBnPgykOTAmCA9kY=/fit-in/200x150/filters:strip_icc()/pic4604785.jpg","urlImage":"https://cf.geekdo-images.com/YcI7OCX2ExMY9WGFKh3JIg__original/img/MGs3sDLpX2J2QkeNAde_X38i6jE=/0x0/filters:format(jpeg)/pic4604785.jpg"},{"bggId":"273480","name":"La main dans le sac","description":"Each player has the alphabet in raised letters in a plastic bag hanging around his neck and with two openings on the sides.&#10;&#10;A card representing a word is drawn and the player must be the first to compose this word in front of us by leaving the good letters one by one. Bad letters count in negative.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":6,"categoriesAndMechanics":["Action / Dexterity","Word Game","Hand Management"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/eJgcsyDMhXSwfrHaG3RdDQ__thumb/img/nJ4BDL18rFOZEgcCB6-aRsWuYX4=/fit-in/200x150/filters:strip_icc()/pic4618235.jpg","urlImage":"https://cf.geekdo-images.com/eJgcsyDMhXSwfrHaG3RdDQ__original/img/fENEqpbK3slnU5SK2Hv8_dgpRrQ=/0x0/filters:format(jpeg)/pic4618235.jpg"},{"bggId":"273489","name":"Word for Word","description":"Contents: &#10;&#10;     54 cards, each with a letter and point value, or a wild card&#10;     Pencil&#10;     Score Pad&#10;     Carrying Case&#10;&#10;&#10;The deck is dealt out to make a face-down hand for each player. For a turn a player reveals the top card of their hand and either plays it to the table, or uses it plus cards already on the table to form a word, keeping all the cards used. After all cards are played the player with the highest total score for the cards they gathered wins.&#10;&#10;There are also detailed rules for a solitaire game, whose object is to go through the deck in a similar manner and use all the cards to form words.&#10;&#10;(The rules say &quot;for two players&quot; for the regular game, but this is playable just as easily with more than two. The older game Logomachy has similar game play and deck size, and it allows for more players, though it recommends teams for an even numbers of players, and two decks for six or more.)&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":10,"categoriesAndMechanics":["Card Game","Word Game","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/IzKVae_wY73UhVRcWFDkLA__thumb/img/pwBUGZ_QqM_CH0n47s9LiIVkL9A=/fit-in/200x150/filters:strip_icc()/pic4644724.jpg","urlImage":"https://cf.geekdo-images.com/IzKVae_wY73UhVRcWFDkLA__original/img/MehhLmFToHaEamOC_AEfRiUKWmo=/0x0/filters:format(jpeg)/pic4644724.jpg"},{"bggId":"273492","name":"Combat Infantry: EastFront 1941-43","description":"Combat Infantry: EastFront is a fast-paced World War II tactical level game that employs wooden blocks providing a fog-of-war element to game play.  The game system features innovative and interactive rules for Fire Combat, Close Combat, Morale, and Leaders. The game delivers a high level of tactical realism, yet is very playable with only 12 pages of rules.&#10;&#10;Control up to three German or Russian companies fighting in close quarter scenarios on the Eastern Front in WWII.  Scale is at 100 meters per hex and the maps integrate with the previously released Combat Infantry game covering the Western Front of operations.&#10;&#10;&mdash;description from the publisher&#10;&#10;&#10;Microbadge available: &#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Wargame","World War II","Action Points","Hexagon Grid","Modular Board","Secret Unit Deployment"],"rating":4.07768,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/akkXiqpP0FBg25FEEtT_JA__thumb/img/gisBZAwPTNe1LyO3pwm992sItHw=/fit-in/200x150/filters:strip_icc()/pic5068446.png","urlImage":"https://cf.geekdo-images.com/akkXiqpP0FBg25FEEtT_JA__original/img/_LUS7MOCbA0Zf2hvtdqgaT8PfZ4=/0x0/filters:format(png)/pic5068446.png"},{"bggId":"273494","name":"Table Fighter","description":"Table Fighter is a fast paced fighting card game for 2 or more players. It's easy to pick up and play, but has enough depth to keep even the most skilled players hooked. Table Fighter is inspired by traditional fighting games: you are rewarded for anticipating what your opponent will do and your skill completely replaces randomness. &#10;In Table Fighter, both players have a deck of six cards that they arrange before playing, and a super card which sits face up on the table. Because each player chooses the order of their deck, there is no randomness created in shuffling.&#10;&#10;Players can intentionally rearrange their decks using a &quot;betting&quot; mechanic to super-charge their moves and avoid their opponent memorizing their order, but the order of one's deck is always a direct result of their actions and combos.&#10;&#10;Players select actions in their hand and then simultaneously reveal them. The winning card is chosen through a rock-paper-scissors-like mechanic. Each player starts with 20 health, last player standing wins!&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":5,"maxPlayTime":10,"minAge":8,"categoriesAndMechanics":["Card Game","Fighting","Video Game Theme","Hand Management","Rock-Paper-Scissors","Simultaneous Action Selection","Variable Player Powers"],"rating":3.5,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/U8xG0p5FnkVVyblQDy0x_g__thumb/img/DIBjwaKXe4Y4D_MEeAsozbIzuPA=/fit-in/200x150/filters:strip_icc()/pic4607547.png","urlImage":"https://cf.geekdo-images.com/U8xG0p5FnkVVyblQDy0x_g__original/img/vW2RON-5dr7VdK1sdasVFK3T_NE=/0x0/filters:format(png)/pic4607547.png"},{"bggId":"273518","name":"Antony and Cleopatra","description":"John Theissen&rsquo;s streamlined approach to operational warfare in the nineteenth century in games such as Hood&rsquo;s Last Gamble and Campaign of Nations has won him a number of admirers. Now he turns his attention to the last war of the Roman Republic, to the marching of Legions and the sailing of fleets, to the rise of Augustus and the fall of Marc Antony and the savvy Queen of Egypt, Cleopatra.&#10;&#10;In &quot;Antony and Cleopatra&quot; each player must raise troops and build ships, using these military forces to enact their will and conduct campaigns against the enemy. Along the way, they will face the challenges inherent in ancient warfare: the difficulty of keeping troops supplied, perilous storms at sea, the spreading of plagues, and the opportunistic assaults of Rome&rsquo;s external enemies. As the war wears on, both sides will attempt to chip away at the other&rsquo;s prestige and standing. If your prestige falls low enough, your troops and provinces might defect, tipping the balance. And should it fall to zero, you lose this high stakes battle. The winner shall rule over an empire. The loser? Well, as Octavian said before Cleopatra&rsquo;s son was strangled, two Caesars are one too many.&#10;&#10;The spoils of victory and the consequences of defeat might not be quite as serious as all that when the troops are made of cardboard, but Antony and Cleopatra allows you to refight this epic contest for ultimate power in the relative safety of your home or gaming club.&#10;&#10;Though somewhat more granular and detailed than Mr. Theissen&rsquo;s other games for Hollandspiele, this remains a quick, compelling, and accessible exploration of this fascinating subject.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":120,"maxPlayTime":120,"minAge":0,"categoriesAndMechanics":["Ancient","Wargame","Dice Rolling","Grid Movement","Hexagon Grid","Movement Points","Ratio / Combat Results Table","Scenario / Mission / Campaign Game","Simulation"],"rating":3.43421,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/UpIeuzFzZvN1vpeQ4hFSDg__thumb/img/4rH8IiFvylioT6JCYv4GYlQ04b8=/fit-in/200x150/filters:strip_icc()/pic4621091.jpg","urlImage":"https://cf.geekdo-images.com/UpIeuzFzZvN1vpeQ4hFSDg__original/img/--K0zXAUwtujqnClR7pVsSGAkt4=/0x0/filters:format(jpeg)/pic4621091.jpg"},{"bggId":"273520","name":"Dirty Pooch","description":"Dirty Pooch is a strategic card game that allows flea flinging amongst your opponents&rsquo; dogs. Who says this has to be realistic? The premise of the game is to get rid all of your initial fleas via action cards by either flinging them to your best friend&ndash;to-be-friendemy or discarding them back to wherever fleas come from. You can either try to win the entire the game by being the first owner to get rid of all their dogs&rsquo; fleas or obstruct your friend from getting rid of their dogs&rsquo; fleas. This game can be as nice or mean as you wish for it to be.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":25,"maxPlayTime":45,"minAge":8,"categoriesAndMechanics":["Animals","Card Game","Humor","Party Game","Hand Management","Lose a Turn","Player Elimination","Take That"],"rating":0,"complexity":0},{"bggId":"273521","name":"Cadbury's Space Game","description":"A spin and move game produced by the Cadbury Chocolate company in Australia.&#10;&#10;The game sees players starting on earth and traversing a path to the moon. Along the way a number of detours can be encountered as well as things like cosmic rays, sun spots and magnetic deviations that will cause delays in reaching the moon. The winner is the first to reach the moon.&#10;&#10;The game is similar in graphics to another space game of the 1950's called A trip to the Moon by the English chocolate company Fry's.&#10;The promotional game was included in an Cadbury showbag from the Adelaide Royal Show in the 1950's. Showbags are a very popular and distinctive feature of Australian shows (the Australian term for fairs or carnivals) and confectionery and toy manufacturers are keen to promote products, samples and brands in their Showbags.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":10,"maxPlayTime":30,"minAge":5,"categoriesAndMechanics":["Children's Game","Space Exploration","Roll / Spin and Move"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/dqOAwWgaZE9uE-gPAMadTQ__thumb/img/yHKn_FzKLPfYNMSjX8eS3SSYxA4=/fit-in/200x150/filters:strip_icc()/pic4613954.jpg","urlImage":"https://cf.geekdo-images.com/dqOAwWgaZE9uE-gPAMadTQ__original/img/HWsdZqHWzP6cUBTtXz5LjTSAs-g=/0x0/filters:format(jpeg)/pic4613954.jpg"},{"bggId":"273539","name":"Sea of War","description":"Sea of War is a tactical naval warfare card game, based in the age of the wooden battleships, that you can take anywhere and play with anyone!&#10;&#10;Each game is made for 2-4 players, but you can combine game sets and expand play space to add in as many players as you would like.&#10;&#10;The object of the game is simple... Destroy all of your enemies ships before they destroy yours! Be the victor by rolling attack dice against their ships and hope they don't succeed on their rolls to defend.&#10;&#10;The game includes rules for beginner, intermediate, and advanced play, so your game can be changed to fit your desires!&#10;This rule set allows for approachable, exciting, and challenging strategy based play!&#10;&#10;It is a turn based game. Each turn you will roll a die to see how many of your ships (cards) will move . Will you get to move your entire fleet? Or will you hit the Doldrums and just twiddle your thumbs?&#10;&#10;Once your ships have moved into firing range of an enemy ship, you can send a cannonball volley over to the enemy ships! Roll to attack! &#10;It is that simple. Well... So it seems.&#10;&#10;The beginner rules are great for those new to tactical style games.  &#10;Those more familiar with Tactical warfare games will enjoy the intermediate and advanced rules.  These rules allow you to make the game a little more difficult, testing the strategy skills of your friends and yourself! &#10;Will you use tactical ramming to cause more damage before you give the full broadside? Or will you use a hit and run tactic with your small, fast ships?&#10;  &#10;Finally, the versatile campaign options let you have a fleet you can boast over&hellip;! Until they are sent to Davy Jones&rsquo; Locker, that is!&#10;&#10;Sea of War was created to give those that love tactical play a chance to get their friends involved without having to spend hours to learn. A game that you can learn quickly and play anywhere.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":90,"minAge":8,"categoriesAndMechanics":["Age of Reason","Nautical","Wargame","Dice Rolling","Point to Point Movement","Roll / Spin and Move"],"rating":4.31923,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/9_HDqEJ1vdQLybyQ2Anv4g__thumb/img/kxN6oQH1SLKREo0t6b848cgVb_0=/fit-in/200x150/filters:strip_icc()/pic4613072.jpg","urlImage":"https://cf.geekdo-images.com/9_HDqEJ1vdQLybyQ2Anv4g__original/img/xOmfn511W1xbmPYYL8XH4apNteY=/0x0/filters:format(jpeg)/pic4613072.jpg"},{"bggId":"273565","name":"Trivial Pursuit: Volume III","description":"This is it, the Genus Edition successor to the original Trivial Pursuit game &mdash; and still the one to beat! Because Volume III covers all those challenging subject areas that let you prove you're a real know-it-all!&#10;&#10;How are you on Geography, Entertainment, History, Art &amp; Literature, Science &amp; Nature and Sports &amp; Leisure? These questions and answers will tackle your brain and tickle your fancy. So join all those trivia buffs who've helped make Trivial Pursuit the best-selling trivia board game of all time!&#10;&#10;Think you've got all the answers? Then prove it!&#10;&#10;&mdash;description from the back of the box&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":60,"maxPlayTime":90,"minAge":0,"categoriesAndMechanics":["Trivia"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/cf_iohP6Gvmc_tsRhFt9Aw__thumb/img/mY8QzCEVT2iBQ5_H0Mpt2rPNp7s=/fit-in/200x150/filters:strip_icc()/pic6419040.jpg","urlImage":"https://cf.geekdo-images.com/cf_iohP6Gvmc_tsRhFt9Aw__original/img/-dxAeTBdiD5iXeRmDqU72ZQ8-nI=/0x0/filters:format(jpeg)/pic6419040.jpg"},{"bggId":"273573","name":"Anarcade 8-Bit Rummy","description":"Shuffle your way through classic gaming with Anarcade 8-Bit Rummy!  Play a set of cards from your hand with matching lines or mix up existing sets to find the matches you need.  Score by playing all your cards first and the first player with 8 points wins!&#10;&#10;Anarcade 8-Bit Rummy is based on familiar rummy card game rules with a few twists.   All cards have a number (1-8) in each of three rows (top, middle or bottom).  The objective is to play cards from your hand by making sets of cards that have matching numbers in the same row.  You can also play cards directly to extend existing sets or rearrange sets into new ones using cards from your hand.  The winner of the round gets points for each of their opponents' remaining cards.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":30,"minAge":12,"categoriesAndMechanics":["Card Game","Video Game Theme","Hand Management","Pattern Recognition"],"rating":5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/G2IS89tY-ls7ih26jBossA__thumb/img/sL0Qma5fJyEasNDOUETMyWDdMjk=/fit-in/200x150/filters:strip_icc()/pic4647288.jpg","urlImage":"https://cf.geekdo-images.com/G2IS89tY-ls7ih26jBossA__original/img/EOPACw4mVJgTq0zdZEX7Ka97y_I=/0x0/filters:format(jpeg)/pic4647288.jpg"},{"bggId":"273575","name":"Dice Phalanx!","description":"Summer has come, the season of WAR!&#10;&#10;Two greek city-states face off, their battle lines of dice-based units eager to do battle with their rival and force them to a route.&#10;&#10;As the generals of these armies, players can reshape and tend to their unit formations in this gridless/boardless dice game before attacking their enemy's army with their disciplined troops. The resolution of attacks is determined by a simple cancelled-value system between both the attacker's and defender's dice pools.&#10;&#10;Once a single player has defeated a total of 12 points worth of enemy units, the rival army's morale is shattered and flees in terror, leaving the scoring player as the victor.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":10,"maxPlayTime":20,"minAge":12,"categoriesAndMechanics":["Ancient","Dice","Wargame","Dice Rolling"],"rating":3.166665,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/maN2YrfLEzLqvYpZ62mqdA__thumb/img/THmYnrO_UN0Iclgq16ZsOQR1Bj0=/fit-in/200x150/filters:strip_icc()/pic4614393.jpg","urlImage":"https://cf.geekdo-images.com/maN2YrfLEzLqvYpZ62mqdA__original/img/X8ogmZH4n1dlZlmSBEGQX5wlvXA=/0x0/filters:format(jpeg)/pic4614393.jpg"},{"bggId":"273578","name":"Optio","description":"Optio is a quick-play set of miniatures rules for Ancient battles. It's played on a square grid - so no measuring - and eschews dice or other randomizers for a purely deterministic combat system. It's thus &quot;chesslike&quot; in a sense.&#10;&#10;The name comes from optio, the title for a centurion's second-in-command in the Roman army.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Ancient","Miniatures","Wargame","Grid Movement","Simulation"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/esaL12jWW0DSEZQp7UKRoQ__thumb/img/j0Wk4lMLXfirC2i55QyaVLsH0wg=/fit-in/200x150/filters:strip_icc()/pic4606665.png","urlImage":"https://cf.geekdo-images.com/esaL12jWW0DSEZQp7UKRoQ__original/img/SXiUA6VVK0ebGsLtVGLAs0YrACw=/0x0/filters:format(png)/pic4606665.png"},{"bggId":"273580","name":"Yunnan Forest","description":"In Yunnan Forest, players roll the dice to match up animals and earn leaf tokens. If you are unable to make a match, grab a binoculars token that may help you later in the game. Play continues until after all of the binoculars have been claimed, and the player with the highest score from leaf tokens at the end of the game wins!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":7,"categoriesAndMechanics":["Animals","Children's Game","Dice","Dice Rolling","Push Your Luck","Re-rolling and Locking","Set Collection"],"rating":3.25,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/lbYjT5epbWF7ZP-D5XEVuA__thumb/img/46lrzIxlgvuv6-MPjsQbYYn4POQ=/fit-in/200x150/filters:strip_icc()/pic5202786.png","urlImage":"https://cf.geekdo-images.com/lbYjT5epbWF7ZP-D5XEVuA__original/img/yN3YRAWYIiS1bJIMyazL7njl_bs=/0x0/filters:format(png)/pic5202786.png"},{"bggId":"273586","name":"18IN: Railways Across Indiana","description":"18xx Series Game designed and published by Gary Mroczka located in Indiana. 2-6 players. Game is ready to play. Wood tokens, laminated tiles and charters, game board and stock table mounted on foam board. This is a fun and enjoyable game with (16) Minor Companies able to convert or merge into one of the 8 Major Corporations.  One Government Company.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":12,"categoriesAndMechanics":["Economic","Trains","Transportation","Network and Route Building","Stock Holding","Tile Placement"],"rating":3.208335,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/8uYlVvM3tdRgvNhgNdco9w__thumb/img/L87uRc6eGU_ygbgZ3omiyD574-M=/fit-in/200x150/filters:strip_icc()/pic4606884.png","urlImage":"https://cf.geekdo-images.com/8uYlVvM3tdRgvNhgNdco9w__original/img/hyda2Bm84Fq4zXAgaYrQ5jiy1S0=/0x0/filters:format(png)/pic4606884.png"},{"bggId":"273622","name":"Bumpers","description":"Bumpers is a board game that incorporates card counting, collusion, competition, bluffing, and risk taking. A complete Bumpers set includes 1 game board, 12 game pieces (called bumpers), and a 52-card deck.&#10;&#10;The 12 bumpers are divided among 4 teams, which each team starting with 1 large bumper and 2 small bumpers (3 bumpers per team, 4 teams, so 12 bumpers total). The board displays a series of spaces connected by lines; bumpers move to and from said spaces along said lines.&#10;&#10;The goal of the game is to be the player the holds the only large bumper on the board for 1 full turn. No bumper can pass any other bumper, large bumpers can only land on (capture) other large bumpers, and small bumpers cannot capture or be captured any other bumpers.&#10;&#10;Players take turns drawing a card from the draw deck and playing cards from their hand. Players then move their bumpers based on the cards they played, corralling, controlling, and capturing their opponents' large bumpers.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":45,"minAge":5,"categoriesAndMechanics":["Bluffing","Children's Game","Maze","Memory","Area Majority / Influence","Campaign / Battle Card Driven","Cooperative Game","Hand Management","Memory","Player Elimination","Point to Point Movement","Take That"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/Nk4mwW_shg73ePjb20adHg__thumb/img/mVRbX9XQPpVO6hqGM3DHuilQHxk=/fit-in/200x150/filters:strip_icc()/pic4642084.jpg","urlImage":"https://cf.geekdo-images.com/Nk4mwW_shg73ePjb20adHg__original/img/UWbcsH7UExDkYJZ2Nxb60IHmfyY=/0x0/filters:format(jpeg)/pic4642084.jpg"},{"bggId":"273626","name":"Chanciee","description":"Chanciee is a 4 dice based game with a mathematical thinking and luck roll factor! The game is very simple to play and perfect for kids, teens, and parents.&#10;&#10;Parents who want to demonstrate to the kids how easy to calculate numbers and think about combinations trough choice, luck, and thoughts!&#10;&#10;All you need to do is roll dice and make your own choice how many dice would you like to roll. You will be surprised, how different thinking bring different outcomes!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":10,"maxPlayTime":20,"minAge":8,"categoriesAndMechanics":["Math","Dice Rolling"],"rating":0,"complexity":0},{"bggId":"273630","name":"What's Your Point?","description":"Given a style of presentation, and a suggestion of a topic to present on, you have to extemporaneously give a power-point style presentation using 3 image cards - slides - in your presentation that you don't get to look at before you place them on your easel. Players take turns being judges; each judge draws a new style, and each player gets a new suggestion when they get their three slides. Whoever wins that round - it can be Judge's Choice, like Apples to Apples, or the point system suggested in the rules, or some other criteria - gains the style card from that round.  At the end of play - decided on by the players, how many rounds they go - the person with the most style cards wins.&#10;&#10;","minPlayers":2,"maxPlayers":10,"minPlayTime":30,"maxPlayTime":120,"minAge":14,"categoriesAndMechanics":["Party Game","Cooperative Game"],"rating":4.5,"complexity":0},{"bggId":"273646","name":"Word Hunting","description":"'Word Hunting' (FA: &#216;&#167;&#216;&#179;&#217;&#133;&zwnj;&#218;&#169;&#216;&#167;&#216;&#177;&#216;&#170;&#219;&#140;&#217;&#132;) is a card game based on the well-known traditional pen and paper game of The Categories (DE: Stadt, Land, Fluss).&#10;&#10;The box consists of two decks of cards: The Alphabet deck, and the Subject deck. The main goal of the game is to find a word that starts with a specific letter and related to a specific subject!&#10;&#10;Word Hunting can be played in 4 different ways including a real-time version, a turn-based push your luck version, and a team-based version where one of the team members holds his breath (as teams timer!) while his partner tries to match the letters with subjects as fast as she can!&#10;&#10;","minPlayers":1,"maxPlayers":12,"minPlayTime":15,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Party Game","Real-time","Word Game","Open Drafting","Push Your Luck","Team-Based Game"],"rating":3.708335,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/I4zRMQDrbTUtTUuSk3k-Lw__thumb/img/X2NxMof7V0MQ0134c6Kqpzjg71g=/fit-in/200x150/filters:strip_icc()/pic4611787.jpg","urlImage":"https://cf.geekdo-images.com/I4zRMQDrbTUtTUuSk3k-Lw__original/img/xzjBu2WBOXxhim0D3c5L3R1IZgE=/0x0/filters:format(jpeg)/pic4611787.jpg"},{"bggId":"273661","name":"Lords & Servants: Medieval Skirmish Rules","description":"Lords &amp; Servants is a game system designed to recreate skirmish games with 28, 20 or 15mm miniatures. It covers the Medieval period and it shares the mechanics of our popular system Smooth &amp; Rifled.&#10;&#10;In the Appendix you will find all the information that you need to create your games, from simple clashes involving a few men per side to bigger encounters with 60-80 miniatures per side. This system is ideal for multiplayer games.&#10;&#10;You&rsquo;ll need a few miniatures for the period (based singly, both 2x2cm or 1-inch diameter round bases are ok), some rulers or other measuring sticks and a few 6-sided dice, which we&rsquo;ll call d6. You&rsquo;ll also need markers to show who is &ldquo;Shaken&rdquo; and a figure&rsquo;s weapon reloading status. Some markers are available&#10;in the appendix.&#10;&#10;The game can be played on 90x90cm or 120x120cm tables with 28mm miniatures or 60x60cm when using 15mm.&#10;&#10;The scale of the game is: 1 figure = 1 man; 1cm is equivalent to 2m in real-life when using 20mm or 25/28mm miniatures, while it is 4m when using 15mm models. A turn represents 10-20 seconds. You can halve the distances when using 15mm miniatures. All measurements are taken from base to base. A miniature can shoot with a 180&deg; arc, Groups with a 90&deg; arc (45&deg; per side). In order to simplify the rules we ask players to use their common sense to decide shooting priorities. There must not be any intervening miniatures on the shooting line unless they are in base contact as in a 2nd rank (only) shooting. In theory, you should give priority to the target that is in front of you rather than one that is behind. You can always target a mounted miniature behind a foot figure.&#10; Additionally rules are provided for: Cavalry, Artillery, Religion, Weather all manner of Medieval Things!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":8,"minPlayTime":60,"maxPlayTime":240,"minAge":12,"categoriesAndMechanics":["Book","Medieval","Miniatures","Renaissance","Wargame","Area Majority / Influence","Dice Rolling","Line of Sight","Role Playing","Variable Player Powers"],"rating":3.5,"complexity":2.5,"urlThumb":"https://cf.geekdo-images.com/pIu15Enc0VHJO8PQVPhZEQ__thumb/img/9D8PPtoQCV9dHy38wSI-9Q-2Rsw=/fit-in/200x150/filters:strip_icc()/pic4608381.png","urlImage":"https://cf.geekdo-images.com/pIu15Enc0VHJO8PQVPhZEQ__original/img/S1US4eLzLdYcCwKaZUSSgeQuhIU=/0x0/filters:format(png)/pic4608381.png"},{"bggId":"273662","name":"Panzer Orders Tank Battles","description":"Welcome to Panzer Orders Tank Battles, a World War 2 card game. This is a stand alone game for solitaire and two-players and is fully compatible with the other Panzer Orders games and expansions. This game also includes some new gameplay mechanics and special scenarios to add to the Panzer Orders range.&#10;&#10;The game is quick to setup and play, it takes around 30 minutes to play a game and comes complete with everything you need.&#10;&#10;You can combine two copies of the game to make either larger or tank-vs-tank games for both solo or multiplayer games or combine this game with existing Panzer Orders games.&#10;&#10;With the game you will receive two decks of cards - one deck for the Soviets and one for the Germans, plus rule summary cards (56 cards in total). You also get a full set of the rules plus a dice - everything you need to play.&#10;&#10;Each card has a points value based on the card characteristics and special rules. The players agree a point based battle and then build their decks, spending points on specific cards.&#10;&#10;Each player must form two columns of any mixture of tanks and then attack the opponents columns. The first player to defeat both their opponents columns or force the opposing player to draw their last card, wins the game.&#10;&#10;During the player turn you can choose to dig and defend with your card, moves cards from one column to another or attack with ling range or close combat. Non of these are without their risks and weighing up the risk vs the strategic gain is part of the decision making elements of the game.&#10;&#10;Combat is fast, simple but very brutal with all the dice rolls required on the cards - no charts or looking up in the rules. Damaged cards are suppressed first before being removed from the game and can still make a free saving throw on the dice to keep in the fight.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":30,"minAge":0,"categoriesAndMechanics":["Card Game","Wargame","World War II"],"rating":3.4,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/rbLpKQ7LKHreRa74I9ZOFQ__thumb/img/MCeoFL5rF6Lf5gwpaEUphdx1ySI=/fit-in/200x150/filters:strip_icc()/pic4679455.jpg","urlImage":"https://cf.geekdo-images.com/rbLpKQ7LKHreRa74I9ZOFQ__original/img/QPR6czyRgOEnSTSHaQk7kxoQVPU=/0x0/filters:format(jpeg)/pic4679455.jpg"},{"bggId":"273685","name":"Crystal Stones","description":"In the Age of Dragons, comes four to the land of crystals.&#10;Player get to play the role of one of the dragons collecting crystals. The objective is collecting 20 crystal stone without losing all six health points. First player gets 20 crystal stones wins.&#10;&#10;Every dragon get started with two same colored crystals and one black die representing six health points. Each turn players roll 5 pink dice determining the type of action they can take. Dragons get one action on their turns.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":30,"minAge":12,"categoriesAndMechanics":["Dice","Fantasy","Mythology","Dice Rolling"],"rating":0,"complexity":0},{"bggId":"273714","name":"Metro","description":"Welcome to 1997 in the beautiful city of Montreal Canada. You will compete with up to 5 other players in a race around town and try to be the first to complete all your itineraries.&#10;&#10;Each player will receive destinations that they will need to get to before the other players get to theirs. Once you completed your trip around the city you need to race back to the starting point to win the game.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":15,"maxPlayTime":15,"minAge":8,"categoriesAndMechanics":["Racing","Roll / Spin and Move"],"rating":2.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/fiU_Zxe-N9tus-0Y4YGfOA__thumb/img/wKtxBrtwWC26dNFn9MzF76h-RU8=/fit-in/200x150/filters:strip_icc()/pic4611329.jpg","urlImage":"https://cf.geekdo-images.com/fiU_Zxe-N9tus-0Y4YGfOA__original/img/aDFMdgUO7Sspu_7w0BGQYAWGz4w=/0x0/filters:format(jpeg)/pic4611329.jpg"},{"bggId":"273755","name":"OverBattle: The All War","description":"Wargaming 4X Refined! by Syther Gaming&#10;Area control, tabletop space warfare... with a twist!!&#10;&#10;Includes a unique utilization of cross-genre gaming mechanics generally un-used in wargaming such as drafting, engine building, worker placement and semi co-op components... all wrapped inside of a classic area-control wargame wrapper.&#10;&#10;Visually stunning, 2 to 4 player gaming, with a 5th and 6th player via an expansion add-on.&#10;&#10;All-new game mechanics such as zero-setup time, and brand new characters unlike anything in gaming that brings the story into the game and the game into the story in a brand new gaming way.&#10;&#10;While you come to play &quot;OverBattle: The All War&quot; you leave with an experience that stays with you and drives an exciting level of replayability. Each game is unique and no two setups or experiences will ever be the same.&#10;&#10;Over 1000+ pieces, Full color game mats and elements, 40xD12 &amp; 4x D6 color specific dice, 4-Piece Modular Game mats at 30&quot; x 72&quot; total size via 4 sections (76cm X 183cm) for the full deployment, 30&quot; x 36&quot; for 1v1 play (76cm X 92cm). Modular system fits a standard US folding pop-up 6 foot table exactly.&#10;&#10;Also utilizes the all-new, multi-tier / multi-dimensional 3D playing combat surface known as the &quot;CASy: Combat Assault System&quot;.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":120,"maxPlayTime":360,"minAge":14,"categoriesAndMechanics":["Adventure","Dice","Economic","Negotiation","Science Fiction","Space Exploration","Territory Building","Wargame","Action Queue","Area Majority / Influence","Area Movement","Area-Impulse","Dice Rolling","Modular Board","Point to Point Movement","Secret Unit Deployment","Simultaneous Action Selection","Team-Based Game","Worker Placement"],"rating":3.789475,"complexity":3.3333,"urlThumb":"https://cf.geekdo-images.com/-JMGPGLFw65nfXoXidObrA__thumb/img/0h0pjGZOKwlt86zgCFyrkMJapSk=/fit-in/200x150/filters:strip_icc()/pic4624380.png","urlImage":"https://cf.geekdo-images.com/-JMGPGLFw65nfXoXidObrA__original/img/-hv37r4CKVI2-me1D23KIhM67qU=/0x0/filters:format(png)/pic4624380.png"},{"bggId":"273756","name":"Dracomania","description":"The cards for this game were given with the purchase of some chips/crisp brands, namely Elma Chips (Portugal-Brasil), Mr. Snaki (Poland), Cheetos (Greece), and Dini (Serbia). Each bag contained a single card. It was produced by Degoes&copy;, in 2008. Some of the cards have spot uv and some are foil. The simple game is played with a deck of 32 cards for both players, while the advanced game also includes the board. The game reminds of Top Trumps - you and your opponent must compare a single value that one of you chooses: magic, power, or fire, and he who has the greatest value wins the battle.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Card Game","Fantasy"],"rating":3,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/8ASkgtu7cjBsf45gcb5Mmw__thumb/img/IhULbmJ1YdnlnnffG_yBdpF25IM=/fit-in/200x150/filters:strip_icc()/pic4622463.jpg","urlImage":"https://cf.geekdo-images.com/8ASkgtu7cjBsf45gcb5Mmw__original/img/ME8-gAR3gMd3UORkrKjuTsQsygw=/0x0/filters:format(jpeg)/pic4622463.jpg"},{"bggId":"273757","name":"Perpetual Anarchy","description":"Perpetual Anarchy is a game for the &quot;2019 Two-Player PnP Design Contest&quot;.&#10;&#10;&#10;&#10;OVERVIEW&#10;Perpetual Anarchy is a strategic 2-player game using a standard 52-card deck. Players are states in a world of international anarchy, attempting to impose their supremacy on the other state. Choose the money allocation between immediate benefit with armaments and wealth and long-lasting benefit with military and civil technologies. Finally, establish the state policy: focus on producing, defensing or attacking.&#10;&#10;Perpetual Anarchy features bluff, push-your-luck and simultaneous action selection.&#10;&#10;GAME THEORY&#10;Perpetual Anarchy was inspired by game theory researches, especially by the PhD student in political science Nathan Alexander Sears' article: Simulating War and Peace in IR Theory with a Classroom Game&#10;&#10;COMPONENTS&#10;1 scoring board&#10;1 technology board&#10;28 cards (from an ordinary 52-card deck)&#10;6 tokens&#10;&#10;SETUP&#10;Each player has 3 personal tokens (one for the scoring board and two for the technology board) and 14 cards in hand:&#10;&#10;     11 numbered cards: two 0s (10s), two 1s, two 2s, two 3s, one 4s, one 5, one 6.&#10;     3 action cards: attack (King), defense (Jack), production (Queen).&#10;&#10;&#10;GAMEPLAY&#10;The game is divided in multiple rounds. In each round, there are three phases. At the end of a round, players pick up all of their played cards back into their hands ready for immediate re-use.&#10;&#10;Phase 1: Card Playing&#10;Players place 5 face-down card in a row on the table simultaneously. From left to right:&#10;&#10;1. the action card (attack, defense or production);&#10;2. it is a numbered card representing wealth allocation;&#10;3. it is a numbered card representing armament allocation;&#10;4. it is a numbered card representing civil tech allocation;&#10;5. it is a numbered card representing military tech allocation.&#10;&#10;There are some restrictions on playing numbered cards:&#10;&#10;     Each state has a budget of 7 billion per round, so they have to choose how to allocate it: the sum of number of the player&rsquo;s cards has to be 7 or less. Unused budget is lost.&#10;     The maximum military tech allocation is 2, so it is possible to play only 0, 1 or 2 for military tech&#10;     The maximum civil tech allocation is 2, so it is possible to play only 0, 1 or 2 for civil tech&#10;&#10;&#10;When both players have placed their cards, every card is turned face-up. If a player wrongly played cards exceeding the sum limit of 7, the opponent decides which card or cards to decrease in order to be within 7. If both players make a mistake in the same round, the round is considered null and void.&#10;&#10;Phase 2: Peace/War Scoring&#10;If a state attacks the other one or both states attack, a war begins. Otherwise, states are at peace.&#10;Based on the cards played and the tech levels, states score points as explained below.&#10;&#10;Phase 3: Tech Increasing&#10;If a state didn&rsquo;t lose the war in the round, it can increase its tech levels based on its tech allocations.&#10;&#10;PEACE&#10;If a state at peace chooses the production action, he scores as many points as the value on its played wealth card + civil tech level.&#10;&#10;If a state at peace chooses the defense action, he scores as many points as the value on its played wealth card -1 (reputation cost).&#10;&#10;WAR&#10;A state&rsquo;s firepower is the sum of its armament allocation, military tech level and action bonus:&#10;&#10;     Production: +0 action bonus.&#10;     Attack: +1 action bonus.&#10;     Defense: +2 action bonus.&#10;&#10;&#10;If states are at war, whoever has the higher firepower wins the war.&#10;&#10;If production or defense wins the war: it scores its own wealth allocation + the opponent&rsquo;s one.&#10;If attack wins the war: it scores its own wealth allocation + the opponent&rsquo;s one - 1 (reputation cost).&#10;&#10;When production or defense lose the war, it scores nothing and it loses its tech allocations.&#10;When attack loses the war, it scores -1 and it loses its tech allocations.&#10;&#10;ARMISTICE&#10;In case of equal firepower, the war ends with an armistice: attack scores its own wealth allocation &ndash; 1; production and defense score their own wealth allocation. Tech allocations are not lost.&#10;&#10;MILITARY TECH&#10;A state can allocate part of its budget researching tech for military purposes. The number on the military tech card, namely the military tech allocation, determines how many steps a state can progress on the military tech board. The resolution of military tech cards occurs after the peace/war scoring.&#10;&#10;Initially, the military tech level is 0; then, every 4 steps, a state increases its military tech level by 1. The military tech level contributes to a state&rsquo;s firepower.&#10;&#10;If a state is defeated, he loses its military tech allocation (but it doesn&rsquo;t lose its military tech level).&#10;&#10;CIVIL TECH&#10;A state can allocate part of its budget researching tech for civil purposes. The number on the civil tech card, namely the civil tech allocation, determines how many steps a state can progress on the civil tech board. The resolution of civil tech cards occurs after the peace/war scoring.&#10;&#10;Initially, the civil tech level is 0; then, every 3 steps, a state increases its civil tech level by 1. The civil tech level contribute to increase the efficiency in the production processes: the civil tech level contributes to the score of a production state at peace.&#10;&#10;If a state is defeated, he loses its civil tech allocation (but it doesn&rsquo;t lose its civil tech level).&#10;&#10;END OF THE GAME AND SCORING&#10;The game ends when the first player gets 50 or more. Before the beginning of the game, players may arrange to play for less or more points.&#10;At the end of the game, the player who has more points wins.&#10;&#10;&mdash;description from the designer&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":40,"minAge":10,"categoriesAndMechanics":["Bluffing","Card Game","Civilization","Math","Print & Play","Hand Management","Push Your Luck","Rock-Paper-Scissors","Simultaneous Action Selection"],"rating":0,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/gbDC89OvsoEBu9PIUMWoKg__thumb/img/NkxD1UQ0q5RkyR_axzn7kx1VMCg=/fit-in/200x150/filters:strip_icc()/pic4676973.png","urlImage":"https://cf.geekdo-images.com/gbDC89OvsoEBu9PIUMWoKg__original/img/VskjhXNEZjWcfeWVP8jqnM-jVx4=/0x0/filters:format(png)/pic4676973.png"},{"bggId":"273758","name":"Planetary Destruction","description":"The game Planetary Destruction was inspired by the dark forest version of the Fermi Paradox.&#10;&#10;In its simplest form, it asks the question: 'If odds are good that many advanced alien races exist, how come none have been discovered?'&#10;&#10;The answer, according to the dark forest theory, is that all civilizations that are found to exhibit intelligent life are immediately and utterly destroyed. Why bother facing a potential enemy tomorrow, when they can be turned into ash today.&#10;This game captures some of that sense of desperation, but remains simple in its implementation.&#10;&#10;As such, there are three actions to choose from each turn: bomb one planet, search a general area for enemy colonies nearby, and search two planets for enemy colonies to confirm their specific location.&#10;&#10;The galaxy is a dark forest, filled with ravenous enemies.&#10;There can only be one victor.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":30,"minAge":16,"categoriesAndMechanics":["Deduction","Science Fiction","Action Points","Modular Board","Player Elimination"],"rating":4.25,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/nGoeX_OBhj78D_6WDjMQyw__thumb/img/MZxjU36pTVFKal17tyV7B6_pByg=/fit-in/200x150/filters:strip_icc()/pic4613403.png","urlImage":"https://cf.geekdo-images.com/nGoeX_OBhj78D_6WDjMQyw__original/img/-mjyHRfzD_fDFhlUspfJ50zxIbM=/0x0/filters:format(png)/pic4613403.png"},{"bggId":"273762","name":"Zone Raiders: Deadly Skirmishes of the Post-Singularity","description":"'Zone Raiders is a fast-paced tabletop skirmish game where small groups of hardened survivors battle against each other in an unforgiving post-technological world called the Matroshka. Within an unending world of inscrutable science, radiation storms and machines dedicated to exterminating life, players create narrative stories and rewarding tactical gameplay in an open-model skirmish ruleset.&#10;&#10;Distinct in our design is an emphasis on mobility, vertical space, and accomplishing asymmetrical objectives before escaping to safety. Your tactical decisions and smart positioning will decide every encounter with the enemy. The world itself is lethal, but can you adapt your strategy, characters and exotic weapons to meet the challenge against both other players, and solo/cooperative scenarios?&#10;&#10;Combining inspirations from small-scale tabletop wargames, campaign skirmish games, RPGs and tactical turn-based video games, Zone Raiders is a fusion of what we love best about all of these.&#10;&#10;We wanted to strike the right chord between tactical depth of play, narrative campaigns and character development along with a commitment to streamlined rules while maintaining sophistication. Combined with a stunningly alien scifi setting that is vast enough to encompass many themes as a player's imagination can conjure, it's a game meant to scratch an itch we've felt for ages.&#10;&#10;Or on a more direct note Have you ever wanted to play a game where you could...&#10;&#10;&#10;     Grappling Hook to tall ledges, snipe foes, then dive to safety?&#10;     Wallrun up a steep slope, and kick a bad guy over a railing to their doom?&#10;     Fight AI Monsters issuing from an automated factory, then lure them into a nest of explosive barrels before blowing the lot up?&#10;     Open an cryo-vault to rescue an ancient survivor with lost knowledge?&#10;     Project force-field bridges across vast gaps, only to turn them off when foes set foot on them?&#10;     Combine versus and cooperative play into a single ruleset, with stealth and objective focused mechanics?&#10;&#10;&#10;All of these are within the domain of Zone Raiders.&#10;&#10;We are an Open-Model game, meaning that the rules and setting are designed for what miniatures you may have and adore. There's numerous fantastic manufacturers out there, and many of us certainly have collections ourselves. Additionally, creating your own group and their stories is all the easier as inspiration can be drawn from all the beautiful models our greater gaming community has created.&#10;&#10;Game Features&#10;&#10;Zone Raiders has a mixture of elements veteran players will both feel familiar with, and refreshed by. In our ruleset, you will find:&#10;&#10;&#10;      Rich, Easy to Learn Rules - Combine easy to learn core gameplay with mechanics that reward tactical positioning, maneuver, and applied firepower to outfox your opponents. Practical rule design ensures that no decision is without appropriate consequence.&#10;      Tactical Team Skirmish - Build a Raid Team of 6-12 hardened survivors in your quest to endure. Equip each one with different weapons and specialized skills and watch them grow... or die.&#10;      Dynamic Movement - Feel the mobility of our unique Dynamic Movement system, where your Raiders can be equipped to parkour, wallrun, grapple or powered vault across broken terrain and lethal gaps. Smash opponents off tall ledges, or create forcefield walls to trap them in place!&#10;      Deadly Environments - Your opponent is not the only threat on the battlefield. Protecting ancient relics and scavenge are automated exterminator machines, psionic mind-scorchers, fierce nano-contaminant storms and radiation fluxes. When the lights vanish or unexpected snipers arise during a Dark Emergence Event, can your forces adapt?&#10;      Diverse Factions - Command 7 unique factions with engaging playstyles, from the regimented Reclaimers, the agile Technomads, cunning Zone Stalkers to the evolving robotic NthGen, each force is dripping with flavor and tactical options as well as unique researchable doctrines and equipment.&#10;      Campaign System - Lead your team beyond a single battle, but to victory in a campaign where your strategic decisions have great importance. Will you build up your team's tech skills, or abort the mission to retrieve an ancient cryopod? Should your team construct a mighty industrial robot, or develop maps of the battleground for a tactical edge? &#10;      Asymmetric Missions - Winning a battle isn't the same as winning a war. Players can elect  different goals during a mission, from capturing prisoners to hacking an automated train. Perhaps it's worth it to cut your losses during a failed mission, or even change objectives mid game as a new, more valuable prize is discovered!&#10;      Exotic Equipment - Featuring over 100 different types of weapons, armor and survival gear, you will have numerous options on how to equip and defeat your foes. &#10;      Merciless AI Enemies - The Immunocytes are merciless machines that are anathema to all intelligent life. Destroy or outmaneuver their AI-controlled agents during battle, or perhaps even trick them to tie up your opponents!&#10;      Cooperative Play System - Sometimes the enemy of my enemy is my friend. Join forces with other players to take on thrilling Cooperative Missions, where you must employ speed and stealth to defeat overwhelming numbers of AI foes to accomplish cinematic objectives as either single missions or campaign play.&#10;&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":45,"maxPlayTime":90,"minAge":12,"categoriesAndMechanics":["Book","Miniatures","Science Fiction","Wargame","Action Points","Dice Rolling","Simulation","Variable Player Powers"],"rating":4.5,"complexity":2.5,"urlThumb":"https://cf.geekdo-images.com/7QaH-uLhlc6fV_L1BeRXBQ__thumb/img/wb-9bj2egZcEfmAUUx11XAiVc5U=/fit-in/200x150/filters:strip_icc()/pic4611771.jpg","urlImage":"https://cf.geekdo-images.com/7QaH-uLhlc6fV_L1BeRXBQ__original/img/D-IWZPska9FJH2qbEpiLtOL67QA=/0x0/filters:format(jpeg)/pic4611771.jpg"},{"bggId":"273820","name":"Gangster Paradise","description":"You play a mob boss who manages a clan and tries to defeat other clans by gathering the most money.&#10;&#10;In Gangster Paradise, you collect money which you have to launder so that it counts for your score.&#10;On your turn, you will be able to negotiate with your opponents in order to exchange anything you own: money or cards.&#10;&#10;Play lasts 8 rounds, divided into 5 phases: each player plays the first phase, then all play a second phase, etc.&#10;&#10;During phase 1, each clan collects its own type of goods.&#10;During phase 2, players participate in as many auctions as there are players less one, each collecting 1 good among those offered, the last player receiving money.&#10;During phase 3, players sell their goods, trying to make sets of different goods.&#10;During phase 4, players will hire new gang members, by paying sets of similar goods. Members of different types will trigger special effects during the game.&#10;During phase 5, players first launder their dirty money, collect some extra money and pay their gang members&rsquo; salaries.&#10;&#10;When all 8 rounds have been played, laundered money is counted and the winner declared.&#10;&#10;","minPlayers":3,"maxPlayers":5,"minPlayTime":60,"maxPlayTime":60,"minAge":14,"categoriesAndMechanics":["Mafia","Negotiation","Auction/Bidding","Set Collection"],"rating":3.333335,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/PQt_dVJGumFqwOByF3qNXw__thumb/img/IcpKscGcgoXy0bCXhC4I28SaxYM=/fit-in/200x150/filters:strip_icc()/pic6756047.jpg","urlImage":"https://cf.geekdo-images.com/PQt_dVJGumFqwOByF3qNXw__original/img/5Pn6T4sCNeIgsic5pXZGaYAveEA=/0x0/filters:format(jpeg)/pic6756047.jpg"},{"bggId":"273830","name":"Drekki","description":"A push-your-luck game where you try to survive the dragon&rsquo;s breath by bluffing and bidding against your opponents.&#10;&#10;Over a determined series of rounds, players get attacked by the dragon: upon a given round, a dragon attack tile is positioned in front of the active player. Each tile shows the amount of possible dammage, as well as who will suffer the dammage in function of an auction result.&#10;&#10;During the auction, each player secretely selects one among their hand of value tokens (6 ascending values in 3 color ranges). Then, in a sequence depending on the dragon tile, players will bid a number which has to be lower than the total of all value tokens. When all have passed, tokens get revealed, and the result is applied: either the highest bidder is lower or equal to the total and receives victory points, then the tile effect is applied in function of the total; or the highest bidder is higher than the total value of tokens, and the bidder suffers the attack.&#10;&#10;When all dragon attack tiles have been played, the game ends and score is computed to determine the winner.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":20,"minAge":12,"categoriesAndMechanics":["Bluffing","Auction/Bidding","Push Your Luck"],"rating":2.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/tG2aUswbDi135TqWsTw-1Q__thumb/img/Ko6XV2UQKE82j1-HIbkEnpXdJ_I=/fit-in/200x150/filters:strip_icc()/pic4765485.jpg","urlImage":"https://cf.geekdo-images.com/tG2aUswbDi135TqWsTw-1Q__original/img/iIrvzDFcLUkGIlmun1gsIAlMLP8=/0x0/filters:format(jpeg)/pic4765485.jpg"},{"bggId":"273831","name":"Pug Time","description":"In Pug Time, players take on the role of pug owners. Each pug is different, but the goal for each pug is the same: achieve maximum happiness. To do this, players play cards that earn points in the three areas of pug happiness: eating, sleeping, and playing.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":10,"maxPlayTime":30,"minAge":9,"categoriesAndMechanics":["Animals","Card Game"],"rating":3,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/x0tZDpTIBHSxHm4Yfy5u7w__thumb/img/Zw55FZkX0wPPKkPkJmRvTDOF3kU=/fit-in/200x150/filters:strip_icc()/pic7192030.jpg","urlImage":"https://cf.geekdo-images.com/x0tZDpTIBHSxHm4Yfy5u7w__original/img/tQActbI0i7KfSW3Iw25Oz0sLs80=/0x0/filters:format(jpeg)/pic7192030.jpg"},{"bggId":"273850","name":"Viva la Fotosíntesis","description":"An educational game for the class where you can learn the basics of how photosynthesis and cellular respiration works&#10;&#10;You are a plant in this game and you need to grow your leaves and roots and for that, you need to work inside your cells to do the photosynthesis.&#10;&#10;Collect elements while you are growing, to win the game you need to grow your roots until the other plant.&#10;&#10;Its a 2 to 5 players game.&#10;&#10;Each player has a cellular card to work with in order to produce more glucose to be used as root or leaf.&#10;&#10;You don't have dice in the game, you just follow the 3 steps in your turn as follow:&#10;&#10;Start with a cellular card with full elements inside, so the first step is to decide to place, the second step is to collect elements depending on how many roots or leaves you have, and thirst step is done chemistry to produce more glucose for your next turn.&#10;&#10;In the chemistry phase, you need to choose between do photosynthesis or cellular respiration, this will depend on the development of the game and elements, chemistry will be carry on several steps described in the cellular card.&#10;&#10;You can produce as many chemicals energy you want but you have to keep in mind that the water is a finite element, so be gentle while using the water to grow because perhaps your plant can get dry and die soon.&#10;&#10;On the board which is hexagonal divided locate your roots close to your other roots, you can place them over the other player roots and &quot;draw&quot; its water. You can not locate a root on a roc, you need to surround them.&#10;&#10;And the first player who locate 3 of its roots close to the other player plant base win the game.&#10;&mdash;description from the designer&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":40,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Educational","Environmental","Area Movement","Enclosure","Grid Movement","Network and Route Building","Tile Placement"],"rating":4.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/cDUh0uCo806wfrPnUrHHeQ__thumb/img/fUUK9c_goJLNsxWYA1RKa4QEIuo=/fit-in/200x150/filters:strip_icc()/pic4614677.png","urlImage":"https://cf.geekdo-images.com/cDUh0uCo806wfrPnUrHHeQ__original/img/4Dbxzi5FmUL7pBH9DiYMkTAGoU8=/0x0/filters:format(png)/pic4614677.png"},{"bggId":"273855","name":"Phantom . Crown . Detective","description":"Phantom . Crown . Detective is a 4-10 player reasoning party game. Player will get and pass the cards through the game. During the card passing player may change their identity and winning condition. Seven different identity in the game with different winning condition.&#10;&#10;At the beginning of the game, you will receive an identity card and an action card. All the cards will shuffled together to form the deck. Using the basic action or card ability, you will check and pass your and other players' card(s), including you identity card to the other player. During the game, you should try to get information which help you win the game. For example, the Phantom wins when he can locate the crown; or the Detective and his assistant win when he locate the phantom. Or YouTuber wins when the party she support win (Detective or Phantom).You will have a new experience on reasoning game after playing this game.&#10;&#10;&mdash;user summary&#10;&#10;","minPlayers":4,"maxPlayers":10,"minPlayTime":10,"maxPlayTime":20,"minAge":8,"categoriesAndMechanics":["Card Game","Deduction","Party Game","Hand Management"],"rating":2.7875,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/_2lKhUFyGqDsGa9S9kxUFw__thumb/img/UcOrJhxipvrR4CIl0b3VFwKOSK0=/fit-in/200x150/filters:strip_icc()/pic4625542.jpg","urlImage":"https://cf.geekdo-images.com/_2lKhUFyGqDsGa9S9kxUFw__original/img/ABRnAAbrVLWoH3-WuGbgFUJivZI=/0x0/filters:format(jpeg)/pic4625542.jpg"}]