[{"bggId":"65539","name":"The Games We Play","description":"The students will get hands-on experience in a section of game-theory that models many common situations in which two parties make a decision with an outcome that depends on the other parties choice. They will understand the four cell matrix often used to model games in game theory, and learn how different configurations of the scores in this matrix affect the tactics.&#10;&#10;The aim of the game is to gain as many points as possible during the game. The score can be compared both to the other players and to own highest score in previous games.&#10;&#10;Components:&#10;52 cards&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":18,"categoriesAndMechanics":["Card Game","Educational"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/Dcse7HYPBGvgr7QjPJnkmw__thumb/img/bpupXehU54RhlLKKukxeKHmQZYw=/fit-in/200x150/filters:strip_icc()/pic667409.jpg","urlImage":"https://cf.geekdo-images.com/Dcse7HYPBGvgr7QjPJnkmw__original/img/564nHnEx2Reu5PlTpYqJr7UkXIw=/0x0/filters:format(jpeg)/pic667409.jpg"},{"bggId":"65540","name":"Minutspelet","description":"This is a game about mathematics. Each round the active players throws 14 6-sides dice marked with numbers between 1 and 15. The goal is then to use these numbers in 4 mathematical calculations using addition, subtraction, multiplication and division. A timer is used to determine time allowed. All numbers in the used dice will added together and all unused dice is then subtracted to produce the score. Each players plays a number of rounds, but the actual winning conditions isn't specified in the rules, this must be agreed upon in advance.&#10;&#10;You need to be fairly good at counting to be successful in this game. For that reason it usually isn't fun for kids under 10 or so, even if the rules are very simple.&#10;&#10;Similar to Laskutaituri which is for 1 to 8 players&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":20,"maxPlayTime":20,"minAge":10,"categoriesAndMechanics":["Math","Dice Rolling"],"rating":2.425,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/Tao34cmSqEtMOhTWod1R9A__thumb/img/QO_0P22oxAzT-v3tgHyMXUPSpf4=/fit-in/200x150/filters:strip_icc()/pic649979.jpg","urlImage":"https://cf.geekdo-images.com/Tao34cmSqEtMOhTWod1R9A__original/img/ZDP27U5plTfYCF6u4vxpJYRrVrU=/0x0/filters:format(jpeg)/pic649979.jpg"},{"bggId":"65546","name":"22 Ku-du","description":"From the Publishers web site: &#10;In Brief: 22 Ku-du is the wood tile math crossword game that's fun for all ages.  Easily adaptable to all skill levels.  Make all your rows and columns total 22. Learn while you play.  108 all-wood tiles&#10;&#10;In Detail&#10;Each player draws 7 tiles to begin play. Players make crosswords of numbers so that each grouping adds up to 22. As tiles are used to make a &quot;22&quot; a player yells &quot;Ku-Do&quot; and draws more tiles so that they are always working with 7 tiles. Play continues until all tiles are gone. Each &quot;22&quot; scores 1 point. Use of two of the same number in the same equation scores an extra point and three of the same number scores two extra points. Each player checks the other player's crossword and scores if they find any errors.&#10;&#10;Many variations of play are left to the player or teams, depending on age or desire. Players can determine the number of rounds for each game, can use dice to set a new &quot;goal&quot; number in each round, or can use the color number tiles as either positive or negative numbers. Many different variations are possible to enhance the game and match the players skill level.&#10;&#10;","minPlayers":1,"maxPlayers":8,"minPlayTime":10,"maxPlayTime":10,"minAge":0,"categoriesAndMechanics":["Math","Tile Placement"],"rating":1.75,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/HyXJnnkmEQn9QmKCCxOu3Q__thumb/img/KpW13l2SHmJWS1WVr-SGGIUszE0=/fit-in/200x150/filters:strip_icc()/pic1166180.jpg","urlImage":"https://cf.geekdo-images.com/HyXJnnkmEQn9QmKCCxOu3Q__original/img/ovp0aTPqmQSSwlVDBUje6MAJ6KI=/0x0/filters:format(jpeg)/pic1166180.jpg"},{"bggId":"65548","name":"Step Lively Shuffleboard","description":"Step Lively is a shuffleboard game. Instead of flicking or pushing the pucks. You use the ramp on the end of the playing board to launch your pucks into the scoring areas. Instead of a flat playing surface the gameboard is made up of stepped areas. You can adjust the height of the ramp to adjust the speed, at which your puck will launch and you can also turn the ramp to adjust the angle, to aim your shots more accurately.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":5,"maxPlayTime":5,"minAge":0,"categoriesAndMechanics":["Action / Dexterity"],"rating":2.625,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/zC1iPAODoEgwTHhNsmSiPw__thumb/img/aZBDaLqUPYjsjyE9tppdor2uEYQ=/fit-in/200x150/filters:strip_icc()/pic651990.jpg","urlImage":"https://cf.geekdo-images.com/zC1iPAODoEgwTHhNsmSiPw__original/img/6ZgGfqEKvDxdo60m-3iazaB9ogk=/0x0/filters:format(jpeg)/pic651990.jpg"},{"bggId":"65550","name":"Book of Mormon Characters","description":"Book of Mormon Characters is a simple card game for LDS families in which players attempt to complete the &quot;Books&quot; of various Book of Mormon prophets. Each prophet has four cards with various facts about his life as well as an Aztec-style illustration. Players seek to collect all four cards of a prophet by asking other players for cards the contain the image, fact, or name of the prophet they are missing. The winner is the player with the most books completed once the game is completed.&#10;&#10;The rules include four variants that decrease difficulty for children and increase it for experts.&#10;&#10;","minPlayers":2,"maxPlayers":10,"minPlayTime":30,"maxPlayTime":30,"minAge":6,"categoriesAndMechanics":["Card Game","Children's Game","Religious","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/GHh39jWu6hCc40HeCs6F6g__thumb/img/ys4bc5oojPqauB8sLa41xzFB68U=/fit-in/200x150/filters:strip_icc()/pic663927.jpg","urlImage":"https://cf.geekdo-images.com/GHh39jWu6hCc40HeCs6F6g__original/img/OVUEK1_-EpJJjGthA7JQdxb4j_Q=/0x0/filters:format(jpeg)/pic663927.jpg"},{"bggId":"65551","name":"Letterbox","description":"Each player begins the game with a set of tiles. Each set contains every letter of the alphabet with the vowels repeated for a total of thirty one. Players alternate turns playing tiles in a three-by-three grid. Players score for each two and three letter word they make during their turns. The player with the most points when both players have used all their tiles is the winner.&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":20,"maxPlayTime":20,"minAge":6,"categoriesAndMechanics":["Word Game","Tile Placement"],"rating":0,"complexity":0},{"bggId":"65552","name":"Six Day Bike Race","description":"Bike racing game where you spin a wheel to determine movement and points. Comes with a small metal board (24x38cm). Published by the Lindstrom Tool &amp; Toy Co. from Bridgestone, Connecticut, US.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":20,"minAge":0,"categoriesAndMechanics":["Racing","Sports"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/DoRl_ABNE1wLT--pBhQ_xQ__thumb/img/tGNx3C_y09509pIt2spxU4y3lnE=/fit-in/200x150/filters:strip_icc()/pic1198772.jpg","urlImage":"https://cf.geekdo-images.com/DoRl_ABNE1wLT--pBhQ_xQ__original/img/xVq7QKWeBQM63k9DvtP218lUyek=/0x0/filters:format(jpeg)/pic1198772.jpg"},{"bggId":"65566","name":"Battles of 1866: Frontier Battles","description":"One of the three games split off from the earlier Battles of 1866: Frontier Battles project from APL, this game covers five different smaller battles from the Austro-Prussian War.  These battles are... Trautenau, Soor, Nachod, Skalitz, and Gitschin.&#10;&#10;This game uses the same system as War of the States: Gettysburg, 1863 and War of the States: Chickamauga & Chattanooga which is similar to the Rome at War and Eagles Of The Empire series as well. In this game, the units are Prussian, Austrian, and Saxon infantry brigades artillery batteries, and cavalry regiments.  The pieces are moved around topographic maps of the various battlegrounds.   Combat is resolved using by rolling a number of dice equal to the total combat strength of units involved in combat, with hits scored on a result of 6.&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Post-Napoleonic","Wargame","Action Points","Area-Impulse","Dice Rolling","Simulation"],"rating":2.97396,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/L2BgEfdb8wGVUTF41XqUNQ__thumb/img/VpfeaVDBDYV6icf6oiGM6yPkdA0=/fit-in/200x150/filters:strip_icc()/pic1263505.jpg","urlImage":"https://cf.geekdo-images.com/L2BgEfdb8wGVUTF41XqUNQ__original/img/vd9vdGHHbVqHsLYDYNzRK1dyeKM=/0x0/filters:format(jpeg)/pic1263505.jpg"},{"bggId":"65567","name":"Just Typical","description":"Just Typical is a party game where players controversial statements about men and women.  Those who find themselves in agreement with the other players more often will win.&#10;&#10;Each turn, the active player draws a card from the deck, which could be a Controversy Card or a Just Typical Card - which is which is marked on the back of the card.  In either case, the active player chooses one of three statements on the card and reads it aloud.&#10;&#10;Controversy Cards have statements that refer to women, men, or relationships, such as &quot;Women make better diplomats.&quot;, or &quot;More alcohol is consumed on a hen night than a stag night.&quot;  Players then secretly vote, using voting cards, as to whether they Agree or Disagree with the statement.&#10;&#10;Just Typical Cards describe behaviours or situations, such as &quot;Shopping for things that are not needed.&quot; or &quot;Putting an empty milk carton back in the fridge.&quot;  Players secretly vote, this time voting for if they thing that trait is &quot;Typically Male&quot; or &quot;Typically Female&quot;.&#10;&#10;Once everyone has voted, the votes are revealed.  The players in the majority score +1 point, those in the minority score -1 point (but never going below 0).  In the case of a tie, the active player's choice  is considered the majority for scoring purposes.&#10;&#10;The first player to reach 14 points wins.&#10;&#10;","minPlayers":3,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":15,"categoriesAndMechanics":["Card Game","Humor","Party Game","Voting"],"rating":1,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/aLrSbTkjGmpUEoxCgxZVbA__thumb/img/AvfaM2oVzCRFmjfS6aA5CDZL5v8=/fit-in/200x150/filters:strip_icc()/pic996067.png","urlImage":"https://cf.geekdo-images.com/aLrSbTkjGmpUEoxCgxZVbA__original/img/HYRohpXgLvrm5rX4IqEjLrMI4UA=/0x0/filters:format(png)/pic996067.png"},{"bggId":"65569","name":"Geometric Gin","description":"The players will be able to calculate perimeter and area of triangles, squares, rectangles, and trapezoids. They will also be able to categorize triangles by determining whether they are right, isosceles, acute, or obtuse. In the affective domain, the players will enjoy applying their geometric skills in a fun and exciting game.&#10;&#10;The object of the game is to get 'Gin'. This entails getting a correct combination of three and four cards. As in Gin, the cards must be categorized by 'suit'. The suits for this game are perimeter, area, or triangles. The cards must first be shuffled and seven cards should be dealt to each player. The deck should then be placed face down with one card placed face up as a discard pile. The play goes in a clockwise direction and begins with the player to the left of the dealear. At each players turn, the player has the option to pick the face up card or one from the deck. The player must then discard one card in the discard (face up) pile. Play continues until someone gets 'Gin'. When a player gets 'Gin', he or she must show the cards to the other players and explain what the two groupings of the cards are. The groupings may be of similar triangles, same area, or same perimeter.&#10;&#10;Components:&#10;48 cards&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":16,"categoriesAndMechanics":["Card Game","Educational","Math","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/rBgb-qbR4uB_y9shjKMM1w__thumb/img/62qGkE0XJQ1OKTpSSFjlRy0BB2Q=/fit-in/200x150/filters:strip_icc()/pic667412.jpg","urlImage":"https://cf.geekdo-images.com/rBgb-qbR4uB_y9shjKMM1w__original/img/mJ2CrXXXk9q1yD_sQoRbcTHi5d4=/0x0/filters:format(jpeg)/pic667412.jpg"},{"bggId":"65570","name":"Goobles","description":"Goobles is a game to help students identify and learn the relational structure of knowledge in a particular domain. Students have difficulty in connecting concepts and creating a sequence of concepts. This game will help students forge ideas about relationships and to build critical thinking skills.&#10;&#10;There are two types of cards:&#10;&#10;      Category card: an umbrella concept (for example: Newton's Laws, Mechanics, Dynamics, Kinematics, etc.) that can be used to connect two sequences. There are two cards for each category.&#10;     Term card: representing a more atomic concept, such as length, mass, velocity, speed, etc. There are four cards for each term (to increase the possibility of chain building).&#10;&#10;&#10;Each subsequent player either chooses one of his or her five cards to build a sequence or starts a new sequence and scores following:&#10;&#10;      5 points for playing a card with a strongly related concept.&#10;     2 points for playing a category card.&#10;     -1 point for starting a new sequence.&#10;     2 bonus points for playing a card that joins two sequences.&#10;&#10;&#10;Components:&#10;50 cards&#10;&#10;","minPlayers":0,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":16,"categoriesAndMechanics":["Card Game","Educational","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/ftSTVSViBlvWVvLKvXYJxw__thumb/img/hXFt-yvWCRKEc05R2KEDZ_ArEaY=/fit-in/200x150/filters:strip_icc()/pic667415.jpg","urlImage":"https://cf.geekdo-images.com/ftSTVSViBlvWVvLKvXYJxw__original/img/UkQwVj5VrlPv86PuW0d0lNj7uJ0=/0x0/filters:format(jpeg)/pic667415.jpg"},{"bggId":"65571","name":"Go Reduce","description":"Given a fraction, the player will be able to reduce the fraction to its lowest terms. The learner will then multiply the reduced fraction by 2, 3, 4, 5, 6, 7, 8, or 9 to produce an equivalent fraction.&#10;&#10;The game design is similar to that of the children's game, &quot;Go Fish.&#10;&#10;     If the player has pairs of equivalent fractions he/she can start their own &quot;count&quot; of pairs. If the player can find no matches he/she will ask any player by name, for an equivalent fraction. For example: &quot;Adam, do you have an equivalent fraction to 1/2?&quot;&#10;&#10;&#10;If Adam does have the equivalent fraction, Adam must surrender his card. The player continues asking the others until one player has no match and will have to reply, &quot;Go Reduce.&quot;&#10;&#10;     The player will then take a card from the face down pond. The next player is on his/her left.&#10;     The play continues until all cards are matched. If players run out of cards, the game has ended for them. They will have to wait until all players have played their hands.&#10;     The winner is the player with the most pairs of equivalent fractions.&#10;&#10;&#10;Components:&#10;48 cards&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":9,"categoriesAndMechanics":["Card Game","Educational","Math","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/CP0JIziR4qr5JE8G8a4HYg__thumb/img/epS12rrorsu_LG7dZ9fZzKD5qf8=/fit-in/200x150/filters:strip_icc()/pic667417.jpg","urlImage":"https://cf.geekdo-images.com/CP0JIziR4qr5JE8G8a4HYg__original/img/x_O9px-mf0tIEfFbjym5aRlUB18=/0x0/filters:format(jpeg)/pic667417.jpg"},{"bggId":"65572","name":"Government Poker","description":"Learners will be able to match the specific number of the Bill of Rights and the Amendments to the Constitution to their content.&#10;&#10;Each player tries to pair the correct number card with its content card. Play continues until a player lays down all their cards as pairs of matching number and content cards and scores two points for a pair,plus two more points for a sequence of two pairs, or three points for a sequence of three pairs, etc.&#10;Play continues until the one player reaches a 50 points.&#10;&#10;Components:&#10;68 cards&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":16,"categoriesAndMechanics":["Card Game","Educational","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/cfkVosdS9FQ-wrmpyA4ALg__thumb/img/_X2hRH5XsU-if9fu328vm4P5kYw=/fit-in/200x150/filters:strip_icc()/pic667419.jpg","urlImage":"https://cf.geekdo-images.com/cfkVosdS9FQ-wrmpyA4ALg__original/img/fjooMzgBxAyxYDCJzUl6PigW4zQ=/0x0/filters:format(jpeg)/pic667419.jpg"},{"bggId":"65573","name":"Grocery Rummy","description":"The players will be able to organize and budget for grocery shopping according to planned menus. They will attain mastery of monies calculation skills. In the affective domain, the students will acquire an understanding of how complex planning and budgeting can be when wants and needs meet prices and paychecks.&#10;&#10;The object of the game is to get the Groceries needed for specified Menus within a predetermined budget. The teacher will determine the budget based on the number of Menus each student must &quot;shop&quot; for - approximately $12-$15 per Menu.&#10;If the player/shopper has overspent or forgotten an item on the Menu, that amount is deducted from the player's &quot;savings,&quot; i.e., score total. Likewise, if the player has money left over in the budget, that surplus is added to the player's score total. The game is over when a player reaches a predetermined score, e.g., $50. If a time limit is set instead, e.g. 20 min., the winner is the player with the highest score at the end of the period.&#10;&#10;Components:&#10;- The deck contains 72 cards: &#10;- six different Menu cards, &#10;- 54 Grocery cards (including generic, lower-priced alternatives to brand names), &#10;- six Non-Food Grocery cards, &#10;- three Coupon cards, &#10;- three &quot;1/2 Off&quot; cards&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":20,"minAge":12,"categoriesAndMechanics":["Card Game","Economic","Educational"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/gd5KrimmdkLvspxs-B-fsQ__thumb/img/-EcqOuLKaaYr2nwlraVxU-6HKz4=/fit-in/200x150/filters:strip_icc()/pic667425.jpg","urlImage":"https://cf.geekdo-images.com/gd5KrimmdkLvspxs-B-fsQ__original/img/6_wPmDvrqMNdLdZy27f_QXbnEj0=/0x0/filters:format(jpeg)/pic667425.jpg"},{"bggId":"65579","name":"K'Dak's Tower of Confusion and Camel Wash","description":"You and your best buddy, Kaka, are two young dudes cruising the back streets of ancient Egypt looking for a cheap double-hump wash and blow dry for your camel, Phredd. Unfortunately, being somewhat shy of means (i.e., broke), you are unable to afford the more reputable establishments. Acting on Kaka&rsquo;s dubious suggestion, you&#10;head out to the edge of town to a place your mother told you never to go: the old, abandoned tower built by that nutcase, K&rsquo;Dak. K&rsquo;Dak was a washout from pyramid building school. He just could never get the pyramid concept straight. Big on the bottom and small on top. How is this hard? Anyway, his attempt at building a small summer&#10;pyramid for the pharaoh ended up as a six-story, straight up and down tower. The pharaoh was not amused and K&rsquo;Dak was banished from the community in disgrace. That should have been the end of it, but K&rsquo;Dak had in mind one last futile gesture before he left. He returned to the tower, hid small amounts of gold throughout the structure and then set up a booby trap for anyone who tried to retrieve the gold. However, before he could spread a story of a fabulous treasure residing in his tower, he was run out of town by the authorities and never seen again. The pharaoh intended to condemn the place for demolition, but got distracted with a border war and K&rsquo;Dak&rsquo;s tower was largely&#10;forgotten. And now, you and Kaka are heading to this questionable monument on the outside chance that there is something inside that you can barter for a camel makeover.&#10;&#10;K&rsquo;Dak&rsquo;s Tower of Confusion and Camel Wash is a game of exploration. You and your opponent climb through an abandoned tower hoping to collect enough treasure in order to pay for a bath for Phredd. Things go just fine until one of you reaches the top layer, at which time the tower starts shaking itself apart. You then have to get out before the whole structure collapses on you while still finding enough treasure to make the expedition worthwhile.&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":20,"minAge":0,"categoriesAndMechanics":["Exploration","Area Movement"],"rating":3.125,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/1zDMiqOTtWBIQ1RbovlpkQ__thumb/img/IUaxvcLNWYFyDM7TORHxP3904mg=/fit-in/200x150/filters:strip_icc()/pic987997.png","urlImage":"https://cf.geekdo-images.com/1zDMiqOTtWBIQ1RbovlpkQ__original/img/v9_WT2dMmAoCrUWKnAQwUR3SQHU=/0x0/filters:format(png)/pic987997.png"},{"bggId":"65580","name":"Űrkaland","description":"This is a Hungarian space strategy game created in the 80's. One of the players, Captain John Konig protects the valuable energy packages while the others trying to get those from him. To achieve this he has to stop the other players, who have to get over various obstacles such as meteoric zones, narrow pass-through gates. These obstacles form concentric circles, the attacking players start on the outside, and their goal is to get to the center, get the energy packets, and take one of them to the starting zone. The quickest one wins the game. Each of the attacking players as well as Captain John Konig are controlling four spaceships.&#10;&#10;","minPlayers":3,"maxPlayers":5,"minPlayTime":60,"maxPlayTime":60,"minAge":6,"categoriesAndMechanics":["Science Fiction","Space Exploration","Pick-up and Deliver","Point to Point Movement"],"rating":1.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/NsaHDJz_GzWxgNsyXrGZpQ__thumb/img/T6Ejv85Qd2RuAsv_0gFGTrobBqU=/fit-in/200x150/filters:strip_icc()/pic659650.jpg","urlImage":"https://cf.geekdo-images.com/NsaHDJz_GzWxgNsyXrGZpQ__original/img/81HvSMsnsCDtfNOKmXgI3s3Bvq4=/0x0/filters:format(jpeg)/pic659650.jpg"},{"bggId":"65586","name":"Splotch","description":"Splotch is played on a 4x4 hexagonal board.There are a sufficient number of black,white and red stackable stones off-board.These stones are shared by both players.&#10;On each turn,each player drops a stone of either color on a cell.&#10;After each drop,the adjacent cells are adjusted.&#10;After the adjust,the player captures any stack with all the three colors.&#10;Wins the player that makes 10 captures.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":20,"minAge":0,"categoriesAndMechanics":["Abstract Strategy"],"rating":0,"complexity":0},{"bggId":"65588","name":"Stucco","description":"This game is played with 32 cards from a standard deck of cards, with cyclic ranking AKQJ10987. Both players are dealt 16 cards (therefore they know the cards of the other player).&#10;&#10;To decide who starts, both players select a card from their hand and reveal them simultaneously. If both cards are the same colour (red or black) then non-dealer starts; if different, dealer starts. The starter's card is left face up on the table as the first card played and the other is returned to its player's hand. The non-starter then plays the second card to the spread, and play thereafter alternates.&#10;&#10;A player in his turn can play a card which is either the next higher card of the same suit, or the next lower card of the other suit of the same colour, or a card of the same rank but opposite colour. If the player does not have any of these, has to pass. The play continues until nobody can play any more cards. Whoever plays the last card scores 1 point for each card he played, multiplied by the number of cards he played consecutively on the last turn.&#10;&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Card Game","Hand Management","Simultaneous Action Selection"],"rating":3.166665,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/D0cExMfW5MGhZrFEB3_T0g__thumb/img/7Oq72q__YGrpnWv_bGKW802Fzo8=/fit-in/200x150/filters:strip_icc()/pic4853636.jpg","urlImage":"https://cf.geekdo-images.com/D0cExMfW5MGhZrFEB3_T0g__original/img/C9Gycv9vaFRdwm7vtVOJgTV1TJ8=/0x0/filters:format(jpeg)/pic4853636.jpg"},{"bggId":"65589","name":"Tantony","description":"This game is played with a standard deck of cards. With four players, the game consist of four deals, but cards are actually dealt only at the beginning. After each round players have 13 cards and use them in the next round.&#10;&#10;Tricks are played and the highest card in the suit led wins; the value of the trick is the smallest card in that suit. However, winner of the trick can either keep it, or give it to anyone else. Everybode can get at most three tricks, this way they have 12 cards after 12 tricks. The winner of the last trick scores for it, but every player keeps the last card. Then a new round starts.&#10;&#10;Each player leads the first trick once in the four round. However, a game ends in an earlier &quot;sudden death&quot; win if one side has reached 60 at the end of the first hand, 120 at the end of the second, or 180 at the end of the third.&#10;&#10;","minPlayers":3,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Card Game","Hand Management","Team-Based Game","Trick-taking"],"rating":3.241665,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/3uDslAQAO7va3X67QRceCg__thumb/img/uX2vT4u-xgFNuqDCJ2DtZB9B1s4=/fit-in/200x150/filters:strip_icc()/pic4923127.jpg","urlImage":"https://cf.geekdo-images.com/3uDslAQAO7va3X67QRceCg__original/img/Gwbw-8rUVLK4qPfiMhQ0ftVd1fo=/0x0/filters:format(jpeg)/pic4923127.jpg"},{"bggId":"65595","name":"Mouse-Party","description":"Players are mice who are tossing paintballs at cats, with the paintballs being represented by colored sticks. When someone knocks over one or more sticks with the wooden cheese disk pictured below, players must race to locate the cat covered with those colours and grab the tile before anyone else.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":15,"minAge":5,"categoriesAndMechanics":["Action / Dexterity","Children's Game","Pattern Recognition"],"rating":2.59091,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/yVTS6FwjqPXrUisNGC3NoQ__thumb/img/V2hzO21O_XlDVbgsKrWu9sL7XAs=/fit-in/200x150/filters:strip_icc()/pic1182312.jpg","urlImage":"https://cf.geekdo-images.com/yVTS6FwjqPXrUisNGC3NoQ__original/img/TVy0k60cUNXyDpn1aWQb4RPUPNY=/0x0/filters:format(jpeg)/pic1182312.jpg"},{"bggId":"65596","name":"Bauernschlau","description":"Players take turns selecting plots of land from a 6x6 grid. As soon as a row or column is completed, points are awarded to the player owning the most land.&#10;&#10;This game has nothing to do with Bauernschlau.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":15,"minAge":8,"categoriesAndMechanics":["Farming","Area Majority / Influence","Modular Board"],"rating":3,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/euanKkf4qif4F8Q8MA4IUQ__thumb/img/EAFnKhuESM9nj5WGUxdB5PW8jy0=/fit-in/200x150/filters:strip_icc()/pic1589597.jpg","urlImage":"https://cf.geekdo-images.com/euanKkf4qif4F8Q8MA4IUQ__original/img/myotOsN-htzRZS4SrJpz7Tkmw2k=/0x0/filters:format(jpeg)/pic1589597.jpg"},{"bggId":"65599","name":"Turi-Tour","description":"The farm animals are going on holiday! But alas, the farmer has messed up everyone's tickets and it's not clear to him who's going where. Thankfully you and your fellow players can lend a hand, but the sorting challenge won't be easy. When you're the active player, you must wear glasses that cover your eyes; the player to your left then draws a task card and places the animal pictured on it in your hand. You try to identify the animal by touch and announce what animal you think you hold. The player then explains your task and you try to perform it, such as placing the animal in the correct location (as marked on the gameboard that game). You can feel the gameboard and other animals already in place, but knock any of them over and your turn ends immediately.&#10;&#10;Other tasks include removing the proper animal from the gameboard and stating how many are currently on the board. The animals on parade change nearly every turn, so you'll need sensitive fingers and a good memory if you want to help them see the world...&#10;&#10;Available in English, German, French, Dutch, Spanish, Italian.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":20,"minAge":5,"categoriesAndMechanics":["Action / Dexterity","Animals","Children's Game","Memory","Memory","Pattern Recognition"],"rating":3.227275,"complexity":1.3333,"urlThumb":"https://cf.geekdo-images.com/ug5tWnx1MFTWlqnxPCpDRg__thumb/img/Y2f9ovPotZerqGLwMRLAMIcPB_A=/fit-in/200x150/filters:strip_icc()/pic651185.jpg","urlImage":"https://cf.geekdo-images.com/ug5tWnx1MFTWlqnxPCpDRg__original/img/jDNHyIRbc_SxEpEJKwYQPBMJhzw=/0x0/filters:format(jpeg)/pic651185.jpg"},{"bggId":"65600","name":"Blocks City","description":"You would think being a real-estate developer in this city would be easy, since there are only three building codes in the city. But nooo, you have to deal with the other real-estate developers trying to take over your buildings, an Arsonist that would love to see one of your buildings burn to the ground and that pesky Building Inspector that just seems to either waste your time or make you redo the work you have already done. But despite all that, it is worth it once you get that nice tall building overlooking the park completed. Blocks City is a three dimensional game. Players use their blocks to build the city, your goal is to score the most prestige points at the end of the game.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":45,"maxPlayTime":45,"minAge":12,"categoriesAndMechanics":["Abstract Strategy","City Building","Action Points","Dice Rolling","Hand Management"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/hXOD9mjn_Xw2WqTKZ97A3A__thumb/img/z1qpbnd6BYlxChGkeSRiO_vbSVs=/fit-in/200x150/filters:strip_icc()/pic650239.jpg","urlImage":"https://cf.geekdo-images.com/hXOD9mjn_Xw2WqTKZ97A3A__original/img/pxzusjMzNxwyvl8oeJnn4ZDqxJQ=/0x0/filters:format(jpeg)/pic650239.jpg"},{"bggId":"65601","name":"Drachenland","description":"Players command the forces of one of the Clans at the island of Drachenland (Dragonland), trying to dominate the island by using different troop types like Heavy infantry, Light cavalry etc., lead by a clan leader and a clan sorcerer. An unbesieged clan castle yields income to (re-)build units.&#10;Each clan has also his own mythical creature (e.g. the Bear Clan a Bear), which can be summoned at its sanctuary for support.&#10;&#10;The island is represented by a hex grid with terrain and location features, the counters have to be mounted and cut, all components are in black and white on paper only.&#10; Drachenland was published in the German Fantasy Pulp Magazine Mythor in &#10;the Magazines No. 150 to 156, each containing a double page with map &#10;parts and counters on one side and rules (beside with some &#10;advertisements) on the other. Published in six parts the second one was &#10;published corrupted, so in No. 156 part two was published again, this time correctly.&#10;&#10;The Drachenland novel consists of Magazine No. 150 to 162.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":120,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Dice","Fantasy","Novel-based","Dice Rolling","Hexagon Grid"],"rating":3,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/f1DzQZL8Izg8nKRvRYQg5g__thumb/img/Tn3wORArsi4QBznUEsSNgxq3A14=/fit-in/200x150/filters:strip_icc()/pic650660.jpg","urlImage":"https://cf.geekdo-images.com/f1DzQZL8Izg8nKRvRYQg5g__original/img/9wlYENsZPPIZj58UMw7lc-WQxSo=/0x0/filters:format(jpeg)/pic650660.jpg"},{"bggId":"65603","name":"Grips Champion","description":"Train your memory, so that you can store data, lists, numbers and names easily and permanently. You will be astonished, how fast you are able to achieve true master achievements and this easy, but effectively. Profit from a good memory at your job, at school as well as in the everyday life. The game contains different variants with different levels of difficulty. (Text from the box)&#10;&#10;Components: 1 two sided board, 100 Memory-Cards, 4 Pawns, 4 Tokens, 1 six sided Die, Rules&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Memory","Memory"],"rating":2.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/zP3P4vHLnydiygSOtFAldw__thumb/img/-paUbftd-xDoYyZiFx4i0JklNY4=/fit-in/200x150/filters:strip_icc()/pic656755.jpg","urlImage":"https://cf.geekdo-images.com/zP3P4vHLnydiygSOtFAldw__original/img/khcrBBS4idOf63jgn8tm9afQH6U=/0x0/filters:format(jpeg)/pic656755.jpg"},{"bggId":"65606","name":"Gypo Logging Board Game","description":"This is a roll-and-move game in the style of Monopoly. It has an &quot;Inner Board&quot;, similar to Careers, where you roll only one die, rather than two. It has no well-defined end-game conditions: simply play for a set period of time and then total up your assets (cash, businesses and equipment), with the win going to the player with the highest total value.&#10;&#10;From the back of the box:&#10;&#10;Between the 1930's and late 80's was the heyday of the Gypo Logger. This was an era when a man, with very little or no formal education could get very rich in a short time, with a lot of backbreaking work, some good luck and with a highball crew working for him. Many more Gypo loggers also went broke in their ventures due to poor planning, unforeseen expenses, plain old 'bad luck' and a multitude of pitfalls which this game only touches the surface of. The term 'Gypo' refers to &quot;haywire&quot; or make do methods that are not necessarily proper--in other words lots of duct tape and haywire is holding everything together and you&rsquo;re probably not using the right machine or tool anyway but somehow you're still getting the wood out.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":180,"maxPlayTime":180,"minAge":13,"categoriesAndMechanics":["Dice","Economic","Environmental","Dice Rolling","Roll / Spin and Move"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/M42Ogp8lL0GJxBW6stCOxg__thumb/img/Gh-NACPpoq4KGgneZzmI2tsooMw=/fit-in/200x150/filters:strip_icc()/pic735027.jpg","urlImage":"https://cf.geekdo-images.com/M42Ogp8lL0GJxBW6stCOxg__original/img/Bdb1UFDv-ojQOzo8soZ4jzL7nKI=/0x0/filters:format(jpeg)/pic735027.jpg"},{"bggId":"65607","name":"Radio Flash","description":"The game comes with a spinner that matches Morse code signals. Each Radio Flash spin results in a code which causes different things to happen during your voyage. i.e. roll the letter k (-.-) and be subjected to a blizzard that requires you to go back 2 spaces. Some squares have 2 letters in the codes which have differing effects. J(.---)Q(--.-) results in,  on the next spin requiring you to change course and take the Western Course via Cook and Fiji Islands.&#10;&#10;You move your ship from port beginning in Bermuda, to the North Pole by either the Western or Eastern route. These routes can go all around the world.&#10;&#10;To win the player must spin exactly enough to reach the North Pole.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Adventure","Exploration","Roll / Spin and Move"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/iHj_e8mkEPlMfQuFiyo3_A__thumb/img/u-F2j8t_2XamHr2ba34Z35ky-zQ=/fit-in/200x150/filters:strip_icc()/pic1712965.jpg","urlImage":"https://cf.geekdo-images.com/iHj_e8mkEPlMfQuFiyo3_A__original/img/nwOO9GELa32nPUHEAzh_QFRguRM=/0x0/filters:format(jpeg)/pic1712965.jpg"},{"bggId":"65609","name":"Sudoku: Tactics","description":"In Sudoku: Tactics, players take turns drawing 1-5 number tiles and place them in any order to complete rows, columns and 3x3 sub-grids following the rules of Sudoku. Each completion scores one point, and the tiles in the completed areas are removed and returned to the tile pile.  If a player is unable to legally place a number, a &quot;Sudoku Jam&quot; occurs; all tiles with that number are returned to the pile and the previous player scores a point.  Since the board is never entirely filled up, the game is played to an arbitrary number of points or time limit agreed to in advance.&#10;&#10;Similar to other Blue Panther products, the box, nine-piece board, scoreboard and 81 tiles are all laser-etched wood.  The board pieces fit together like a jigsaw puzzle. The game also comes with a printed paper instruction sheet and five pairs of plastic cubes to mark player scores.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Number","Puzzle","Tile Placement"],"rating":3.3,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/vhsdF0uzoh_vClTlaWU0Gg__thumb/img/4J9gTC_bRkPzK5jr_OCGprKtsEM=/fit-in/200x150/filters:strip_icc()/pic952825.jpg","urlImage":"https://cf.geekdo-images.com/vhsdF0uzoh_vClTlaWU0Gg__original/img/6Bn90B1GsM9EiZJtNMZPeWp6aLA=/0x0/filters:format(jpeg)/pic952825.jpg"},{"bggId":"65615","name":"The Habit Challenge","description":"The players shall be able to become more aware of what constitutes both good and bad habits.&#10;&#10;Players must try to get as many Good Habit cards as possible and discard all Bad Hait cards. The game ends when one player acquires four Good Habit cards in one category and three in the other, with no Bad Habit cards. The winning player then announces, &quot;Good Habits,&quot; he shows his seven winning cards, and the game is over.&#10;&#10;Components:&#10;56 cards in 2 categories: Character or Hygiene + 4 Good Karma bonus cards&#10;&#10;","minPlayers":0,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":7,"categoriesAndMechanics":["Card Game","Educational","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/nDKYHC7_UtzTNaF0-c680w__thumb/img/XlJRh_GklAkw1Oq0-CymZ-g4hNQ=/fit-in/200x150/filters:strip_icc()/pic667429.jpg","urlImage":"https://cf.geekdo-images.com/nDKYHC7_UtzTNaF0-c680w__original/img/JmgHDDPqm11aqd-2TCJUW5CmUck=/0x0/filters:format(jpeg)/pic667429.jpg"},{"bggId":"65616","name":"HeadGames","description":"This is educational cardgame for veterinary students.&#10;&#10;Game play is similar to Rummy. The object of the game is to make melds of related cards to earn points and to be the first to reach 500 points.&#10;&#10;Components:&#10;52 cards&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":18,"categoriesAndMechanics":["Animals","Card Game","Educational","Medical","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/vzJxRITD-8bhDvvphJ_Efw__thumb/img/Seu5ylQZLjFjCtzwzAcpWlIKVkU=/fit-in/200x150/filters:strip_icc()/pic667434.jpg","urlImage":"https://cf.geekdo-images.com/vzJxRITD-8bhDvvphJ_Efw__original/img/LOrj76y2fmUUGKnu61gQp2yTtf8=/0x0/filters:format(jpeg)/pic667434.jpg"},{"bggId":"65619","name":"La Historia de México","description":"The players will be able to review the major events in Mexican history and the order in which the events occurred. Non-native Spanish speakers will also practice understanding written Spanish. They should also be able to enjoy this activity and enjoy working within the group of players.&#10;&#10;The object of the game is to get two runs of three and four cards representing the sequential order of the events from Mexican history.&#10;&#10;components:&#10;52 cards&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":15,"categoriesAndMechanics":["Card Game","Educational","Set Collection"],"rating":0,"complexity":0},{"bggId":"65625","name":"Battles of 1866: Koniggratz","description":"One of the three games split off from the earlier War of the Empires: Battles of 1866 project from APL, this game covers the most famous battle from the Austro-Prussian War... Koniggratz.  Rather than the five smaller battles in the Frontier Battles installment, this game focuses on one huge battle between the Prussians and Austrians.&#10;&#10;This game uses the same system as War of the States: Gettysburg, 1863 and War Of The States: Chickamauga &amp; Chattanooga which is similar to the Rome at War and Eagles Of The Empire series as well. In this game, the units are Prussian, Austrian, and Saxon infantry brigades artillery batteries, and cavalry regiments. The pieces are moved around topographic maps of the various battlegrounds. Combat is resolved using by rolling a number of dice equal to the total combat strength of units involved in combat, with hits scored on a result of 6.&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Wargame"],"rating":4,"complexity":0},{"bggId":"65626","name":"Battles of 1866: Custoza","description":"The last of the three games split off from the earlier Battles of 1866: Frontier Battles project from APL, this game covers the First and Second Battles of Custoza in northern Italy. The first battle pits Josef Graf Radetzky against Carlo Alberto's crack Piedmontese forces while the second takes place on the same battlefield nearly 20 years later.&#10;&#10;This game uses the same system as War of the States: Gettysburg, 1863 and War of the States: Chickamauga & Chattanooga which is similar to the Rome at War and Eagles Of The Empire series as well. In this game, the units are Austrian, Italian, and Piedmontese infantry brigades, artillery batteries, and cavalry regiments.  The pieces are moved around topographic maps of the various battlegrounds.   Combat is resolved using by rolling a number of dice equal to the total combat strength of units involved in combat, with hits scored on a result of 6.&#10;&#10;This game does not yet have its own webpage on the APL site.&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Wargame"],"rating":3.75,"complexity":3},{"bggId":"65629","name":"Voice Sea Battle II","description":"Electronic game, both French and English voices, b Saitek.  Includes not only regular ships, but different shaped spaceships for use.  Similar to Electronic Battleship, but the space version used different shaped ships.  Voice can be in either English or French.  Standard battleships are the naval version, oddly shaped ships are the space based version.&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":20,"minAge":10,"categoriesAndMechanics":["Abstract Strategy","Electronic","Nautical","Science Fiction","Secret Unit Deployment"],"rating":4,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/NAf0Ci1I7fQ2jhOtVUzAPw__thumb/img/GbAdjslntsKha47UiNiH9usDJ8c=/fit-in/200x150/filters:strip_icc()/pic655504.jpg","urlImage":"https://cf.geekdo-images.com/NAf0Ci1I7fQ2jhOtVUzAPw__original/img/q8dNezAh0efJVMVLqrn4Xyoa80I=/0x0/filters:format(jpeg)/pic655504.jpg"},{"bggId":"65630","name":"Tipi","description":"Players assemble a circle of tepees (tents), each made from two slotted playing cards. Dice are rolled, and players race to claim a tepee with the most matching symbols -- both inside and outside the tent! However, if an &quot;X&quot; (taboo!) is rolled the goal is reversed.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":15,"minAge":5,"categoriesAndMechanics":["American West","Children's Game","Dice Rolling","Pattern Recognition"],"rating":2.555555,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/W7qhx_miqmWb2R2UTQVDfA__thumb/img/tv6mTBwptPmfsZh7XDJiVQpeAug=/fit-in/200x150/filters:strip_icc()/pic749686.jpg","urlImage":"https://cf.geekdo-images.com/W7qhx_miqmWb2R2UTQVDfA__original/img/zxwWKMNDbrbZTaN0nIBjjb9_MSY=/0x0/filters:format(jpeg)/pic749686.jpg"},{"bggId":"65632","name":"Landlocked: Hither and Yon","description":"Travel as you please, from hither to yon. Just don&rsquo;t become  Landlocked!&#10;&#10;The goal is to construct a correct path through 12 locations. Moving orthogonally, move your pawn from the upper left to the null tile of your outbound suit. You may move  your pawn through a higher-valued outbound tile en route to the current value your pawn is heading towards. However you may not pass through any tile on your inbound suit. Once this is done, you must mark each tile you passed through  After all the tiles you passed through are marked, move on to the ace tile of your outbound suit, marking each tile you passed through as before. Continue on in this manner and in order to tiles Ace-5 of the outbound suit to 5-Null of the inbound suit. When you are working on your inbound suit, you may pass through any and all tiles on your outbound suit. However you may not pass through an inbound tile that has a value lower than the current value your pawn is moving towards.&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":7,"maxPlayTime":7,"minAge":0,"categoriesAndMechanics":["Abstract Strategy","Maze","Area Movement"],"rating":2.57143,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/HBND9eakCpytjSAKx2mHNw__thumb/img/74kEVoSPqZ-XZQdclo1YgpkKdko=/fit-in/200x150/filters:strip_icc()/pic3880727.jpg","urlImage":"https://cf.geekdo-images.com/HBND9eakCpytjSAKx2mHNw__original/img/X29dVeMXtSY_kQHhDClCyVUzuNY=/0x0/filters:format(jpeg)/pic3880727.jpg"},{"bggId":"65637","name":"HTML Double Solitaire","description":"The game is designed to promote a holistic view of html programming. Beginning learners often practice the parts that make up a html document, but many times, do not put together entire documents. The game will help students see how to construct entire documents. It will provide opportunities to try various ways of constructing html documents. It will also serve to aid retention of the structure of html.&#10;&#10;The object of the game is to play all of the cards in your pile. All players use the center piles to build documents. There may be up to four documents in the center area. When a document is closed, by playing a card, the cards are removed from the center area and a new document can be built in its place. Documents begin with a card. All documents must have: a title, a header, a picture, text, a link. Play continues until one player has played the last card in their pile and become a winner.&#10;&#10;Components:&#10;212 cards&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Card Game","Educational","Set Collection"],"rating":0,"complexity":0},{"bggId":"65638","name":"Hypertalk Scripting","description":"The learners will be able to write simple HyperTalk scripts.&#10;&#10;Players must build coherent sequences of cards into HyperTalk scripts. This is similar to a straight in the card game &quot;Rummy&quot;. Cards are marked with individual HyperTalk commands such as &quot;On MouseUp&quot;, or &quot;visual dissolve&quot;. A dealer gives each players 10 cards from a deck of 60. The dealer places the rest of the deck face down, with the top card turned face up to begin the discard stack. The players take turns choosing either a card from the deck, the top discard, or the entire discard stack. The first player to use all of their cards to build coherent scripts, wins.&#10;&#10;Components:&#10;60 cards&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":15,"categoriesAndMechanics":["Card Game","Educational","Set Collection"],"rating":0,"complexity":0},{"bggId":"65639","name":"Ich Zweifle Es","description":"When shown a sample color, the learner will be able to say the German word for this color. The learner will be able to say the German words for the numbers 1, 2, 3, and 4.&#10;&#10;The dealer shuffles the cards and deals the whole deck of cards one at a time to each player. Players group their cards by color. The first player to discard all of their cards is the winner. Starting with the player at the dealers left, players must discard from one to four cards. The first player to discard must discard aces (blue cards), the second player two's (red cards), the third player three's (green cards), etc.&#10;&#10;The players say in German how many and what color of cards they are discarding. If a player doesn't have the color to discard for that turn, the player must bluff. The player puts other cards down, but says the color of card for his or her turn. Other players can then say &quot;Ich Zweifle Es&quot;, or I doubt it. The first player to accuse is the one who calls the bluff. A player who is caught bluffing must pick up the whole discard pile. A player wrongly accusing another player of bluffing must pick up the discard pile instead. Play then continues to the next player who must discard the next color in order. Remember to practice your German!&#10;&#10;","minPlayers":3,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":16,"categoriesAndMechanics":["Bluffing","Card Game","Educational","Set Collection"],"rating":0,"complexity":0},{"bggId":"65640","name":"INTERNET Deck","description":"The learners will be able to identify legitimate INTERNET command sequences. The game will focus on basic VAX Notes, Telnet, and e-mail commands.&#10;&#10;There are two variations to the INTERNET Deck. The first is a competitive game played like Rummy with the following variations. Players receive one point for each card in any trick that they lay down. Players may pick up more than one card from the discard pile. Players can void tricks laid down by other players by placing a &quot;Disconnect&quot; card on the trick.&#10;&#10;The second variation to INTERNET Deck is facilitative. It is meant for students who are not yet familiar with INTERNET commands. This variation is played like Rummy with the following variations. The dealer is always the instructor. All cards are shown face up. The instructor and other participants help the current player figure out if there is a legitimate sequence in his or her hand. Score is not kept. Only a few hands of this version should be played before switching to the competitive version of the game.&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":18,"categoriesAndMechanics":["Card Game","Educational","Set Collection"],"rating":0,"complexity":0},{"bggId":"65641","name":"It's Elemental","description":"Depending on the level of play, the learners will be able to a.) Recognize and state the name of a chemical element from its chemical symbol (Elemental Go Fish!), b.) Accomplish part a.), and combine them and &quot;multipliers&quot;to form proper chemical molecules (It's Elemental!), c.) Accomplish parts a.) and b.), and group them into their chemical families (Molecular Poker), or d.) Accomplish part a.), and compose and write pertinent clues regarding the identity of specific chemical elements (Elemental Trivia).&#10;&#10;Components:&#10;84 cards&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":15,"categoriesAndMechanics":["Card Game","Educational","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/G8BPYMtTazfxVD8HID2X2w__thumb/img/XL0LkJCHWaMt0gNe1ohES30entc=/fit-in/200x150/filters:strip_icc()/pic667447.jpg","urlImage":"https://cf.geekdo-images.com/G8BPYMtTazfxVD8HID2X2w__original/img/Xt5ELvVMiBOE7hQ5XUE48560KDE=/0x0/filters:format(jpeg)/pic667447.jpg"},{"bggId":"65642","name":"Jungle Gin","description":"The learner shall be able to identify plants according to classification and location on nursery grounds.&#10;&#10;Gameplay is similar to Gin. Player who has successfully collected 4 cards from one suit and 3 cards from a different suit is winner.&#10;&#10;Components:&#10;56 cards&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":19,"categoriesAndMechanics":["Card Game","Educational","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/w8UOk15vhHxwdyUTgrndiQ__thumb/img/d0T16MmIegwyq_jeZ2lWCY8AqgY=/fit-in/200x150/filters:strip_icc()/pic673589.jpg","urlImage":"https://cf.geekdo-images.com/w8UOk15vhHxwdyUTgrndiQ__original/img/jMoyu6P79oxXzg4sLLEBjuNwQuk=/0x0/filters:format(jpeg)/pic673589.jpg"},{"bggId":"65643","name":"Kanji","description":"The players shall be able to recognize the meanings of Japanese 'kanji' (ideographic characters adopted from the Chinese language), create 'kanji' compounds when appropriate, and classify 'kanji' into related semantic groups.&#10;&#10;This game is based on rummy. The object of the game is to get rid of your cards by laying down sets of cards which are categorized into semantic groups or families. For example, a family called 'human relations' may be made with 'kanji' cards meaning 'father, mother, son, daughter, and child'. &#10;Players try to group the cards into semantic cards to e scored. The first player to reach a total of 400 points or more wins the game.&#10;&#10;components:&#10;ca 400 cards&#10;&#10;","minPlayers":0,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":18,"categoriesAndMechanics":["Card Game","Educational","Set Collection"],"rating":0,"complexity":0},{"bggId":"65658","name":"Vitorlázz velünk!","description":"This is a Hungarian game. Players are sailing, headed toward destinations shown on cards.  destinations on drawn cards. Players must complete a circuit, but there are some event card that affect areas of the board that influence the travel and route.&#10;&#10;1 gameboard&#10;1 dice&#10;6 sailing ship&#10;18 marker (flag)&#10;10 destination-card&#10;10 event-card&#10;1 rule&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Educational","Nautical","Travel","Roll / Spin and Move"],"rating":1.666665,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/37qHlkL17dgs17GgnsTS3g__thumb/img/yLR4hfyEozUIbbSuCnJ1H5jeVtY=/fit-in/200x150/filters:strip_icc()/pic656177.jpg","urlImage":"https://cf.geekdo-images.com/37qHlkL17dgs17GgnsTS3g__original/img/n7JC4Nf2lXQFsiL41f559avsUac=/0x0/filters:format(jpeg)/pic656177.jpg"},{"bggId":"65659","name":"Ninjistics","description":"Ninjistics is a fun family-friendly game of stupid human tricks. Each player is a ninja in training to become a master ninja. In order to prove that you are a master ninja you must complete a series of challenges ranging from reading minds to feats of stunning acrobatics.&#10;&#10;You need no special skills or knowledge to play Ninjistics. In addition, you are at no more advantage or disadvantage based upon your age or physical state. Challenges range from being able to predicting the outcome of a dice roll to being able to rub your belly and pat your head at the same time. There are 36 challenges in all, but in a typical game you usually only need to complete 5 or 6 to win.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Action / Dexterity","Humor","Dice Rolling","Modular Board","Rock-Paper-Scissors","Variable Player Powers"],"rating":3,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/4Acy5WS8aiUZVL9Fnq_zjQ__thumb/img/-Cn1sWMWJ1kY-WG6ldxcJPLbID4=/fit-in/200x150/filters:strip_icc()/pic650674.jpg","urlImage":"https://cf.geekdo-images.com/4Acy5WS8aiUZVL9Fnq_zjQ__original/img/zr9vJlmP8eGFX7NswlkV--yWiZE=/0x0/filters:format(jpeg)/pic650674.jpg"},{"bggId":"65660","name":"American Girl Card Game Collection","description":"The American Girls star in three exclusive new card games! In Kit&rsquo;s Frame Game players compete to hang all of Kit&rsquo;s family portraits in order. In Trivia Challenge girls test their knowledge of the American Girls and their stories. And finally, in the rummy-style &quot;Three Please game participants collect sets of cards to win. &#10;Game contents &#10;1 small game board, &#10;7 portrait movers, &#10;25 pattern cards, 3&#10;1 direction cards, &#10;72 trios cards,&#10;72 trivia cards.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":8,"categoriesAndMechanics":["Card Game","Trivia","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/PujG38q2bVc-F_tR3VUEzQ__thumb/img/u7yLqIXfMK11TWhBJVsWgz4SANU=/fit-in/200x150/filters:strip_icc()/pic576346.jpg","urlImage":"https://cf.geekdo-images.com/PujG38q2bVc-F_tR3VUEzQ__original/img/TewivDCQIFcktgNusIlxh8M0yeo=/0x0/filters:format(jpeg)/pic576346.jpg"},{"bggId":"65663","name":"Battle of Waterloo: Hougoumont (1815 AD)","description":"&quot;Napoleon's stunning comeback from exile faced its great test when his French army fought the British near Waterloo in Belgium. The British line was anchored on the right at the walled farm known as Hougoumont.&quot;&#10;&#10;&quot;The French started the battle with an attack on the farm designed to draw British reserves away from the center, where the main French attack was planned . . . Wellington, the British commander, credited the defense of Hougoumont with being the key to the victory.&quot;&#10;&#10;A miniatures wargame intended for classroom use with two teams of students (grades 6-8). The game is designed to be played on a 7.5x5 foot table using 1/72 scale plastic miniatures mounted two per base.&#10;&#10;As an alternative, free print-and-play paper miniatures are also provided for use with the rules. Print-and-play walls are also available for use to recreate the boundaries of the farmhouse.&#10;&#10;The rules encompass ranged and melee combat, morale, charges, reserves, and breaking down doors and gates.&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Educational","Miniatures","Napoleonic","Wargame","Dice Rolling"],"rating":2.75,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/VBd799738Bf3k7-Nkl6zwA__thumb/img/dz3kBbYke5xZ6H8PssuzQ9J6ZUc=/fit-in/200x150/filters:strip_icc()/pic651299.jpg","urlImage":"https://cf.geekdo-images.com/VBd799738Bf3k7-Nkl6zwA__original/img/9zaB6LU6nlsV1mWw7eTPthnoJsk=/0x0/filters:format(jpeg)/pic651299.jpg"},{"bggId":"65664","name":"Why, These are Regulars!","description":"&quot;The battle of Chippawa (1814) was a landmark victory for the US army, marking the first time it defeated the veteran British regulars in open combat.&quot;&#10;&#10;&quot;When Winfield Scott's grey jacketed 1st Brigade was first seen the British may have mistaken them for militia. Watching them under fire, however, it became obvious that they were in fact well trained regulars. The US and British lines faced each other at close range, exchanging musket and cannon fire. After both sides suffered terrible casualties it was the British that withdrew.&quot;&#10;&#10;A miniatures wargame intended for classroom use with two teams of students (grades 6-8). The game is designed to be played on a 7.5x5 foot table using 1/72 scale plastic miniatures mounted two per base (except for Commanders, who are based singly). Free print-and-play paper miniatures are also provided for use with the rules.&#10;&#10;These streamlined &quot;fast play&quot; rules encompass unit formations, charges, commanders, morale, and terrain.&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Educational","Miniatures","Wargame","Dice Rolling"],"rating":2.75,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/NS7mowaP3R65OTDyInQXdw__thumb/img/icSY2Fbh8QUvDXuQELS41U4ZHJk=/fit-in/200x150/filters:strip_icc()/pic651298.jpg","urlImage":"https://cf.geekdo-images.com/NS7mowaP3R65OTDyInQXdw__original/img/K2UWX2IXn5wQsXbE7VfjXmuXedA=/0x0/filters:format(jpeg)/pic651298.jpg"},{"bggId":"65666","name":"Ratz Fatz auf den Bauernhof","description":"This installment in the &quot;Ratz-Fatz&quot;-series revolves around the farm and eveything around that. Like the other Ratz Fatz games Ratz Fatz auf den Bauerhof is an educational game and it actually includes several games aimed at children of different ages. Game play revolves about recognizing the animals, and machines on the cards and making connections between them as fast as possible, another version of the game is a fairly straightforward memory game; yet another version that can be played and which is suitable for slightly older children (5-6) makes the game into a storytelling game.&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":10,"maxPlayTime":10,"minAge":3,"categoriesAndMechanics":["Action / Dexterity","Animals","Children's Game","Educational","Memory","Storytelling"],"rating":1.25,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/QSlhicFUpLSH-lapjL7BLQ__thumb/img/BMUYP9w4I2GnW-Zy3xd6F_t5pVo=/fit-in/200x150/filters:strip_icc()/pic678103.jpg","urlImage":"https://cf.geekdo-images.com/QSlhicFUpLSH-lapjL7BLQ__original/img/MMEpcAXTl31SYgO-tLYpJBpPyj0=/0x0/filters:format(jpeg)/pic678103.jpg"},{"bggId":"65667","name":"Battle of Lake Erie, September 1813","description":"&quot;The Battle of Lake Erie, sometimes referred to as the Battle of Put-In-Bay, was fought on September 10, 1813 on Lake Erie off the coast of Ohio during the War of 1812.&quot;&#10;&#10;&quot;Under light and variable winds, nine American vessels under the command of Commodore Oliver Hazard Perry challenged the British Commander Robert Barclay&rsquo;s squadron of six vessels for control of the lake.  Whoever controls the lake controls the movement of troops and supplies along the border between British Canada and the United States.  Victory goes to the side disabling or sinking the most enemy vessels.&quot;&#10;&#10;A miniatures wargame intended for classroom use with two teams of students. The game is designed to be played on a 7.5x5 foot table using miniature ships. Free print-and-play paper miniatures designed to accommodate the unusual combat resolution system are available on the Junior General site.&#10;&#10;The British Royal Navy order of battle consists of two ships, a brig, two schooners, and a sloop. The United States Navy has three brigs, five schooners, and a sloop. Each class of ship is rated for hull strength, sail points, and salvo size.&#10;&#10;The game uses an unusual method to resolve fire combat - the players roll pennies from atop the miniature ships.&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Action / Dexterity","Educational","Miniatures","Wargame","Dice Rolling","Flicking","Movement Points"],"rating":3.083335,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/EIygHC8j-iI0WIVcAMQYaQ__thumb/img/GAoBpCNFuFCUZY8dL88mr30HjwA=/fit-in/200x150/filters:strip_icc()/pic651297.jpg","urlImage":"https://cf.geekdo-images.com/EIygHC8j-iI0WIVcAMQYaQ__original/img/x4tpxyr43H53_z3Yqw_mxytu1jY=/0x0/filters:format(jpeg)/pic651297.jpg"},{"bggId":"65668","name":"Picturesque Word Games","description":"(Text by the publisher) Bildsch&ouml;ne Wortspiele is a compact collection of 8 card games that deal with images and associated words. The set contains 100 cards (90 photos, 6 jokers, 4 blancs), 4 cards with suggestions for words, 1 booklet with rules and examples.&#10;The principal mechanism is very simple: You form compounds by combining the words that you associate with two or more photos. A photo doesn&rsquo;t represent only one word. For instance, for the photo that shows an eagle you can also say &quot;bird&quot;, or &quot;beak&quot;, or &quot;head&quot;, or &quot;feather&quot;, or &quot;claw&quot;, or &quot;animal&quot; and so on. Thus, in combination with other cards in the set, you can form numerous words such as &quot;bird bath&quot;, &quot;bird table&quot;, &quot;frigate bird&quot;, &quot;game bird&quot;, &quot;pack animal&quot;, &quot;stuffed animal&quot;, &quot;animal farm&quot;, &quot;animal world&quot; and so on.&#10;The games can be played on all language levels. The selection of the photos ensures that you can form a large number of compounds within the range of basic vocabulary. Also, you can extend the linguistic range deliberately in terms of code, style and special languages.&#10;In educational contexts the games cannot only be used for vocabulary training. It is also possible to train more subtle competences such as abstract thinking (eagle &gt; bird &gt; animal), the perception of paralleles and differences (bird: bird of prey vs. singing bird), style and narrating (you put down one card after another and let narrate / narrate yourself).&#10;You can play most of the games either in competition or in coordination. Some of the games you can even play on your own. Depending on which game is played, the emphasis is on speed, concentration, memory, or wit. All the games are a challenge to imagination.&#10;The games are suited for cross-generational, highly communicative playing within the family. They have also been designed for educational and therapeutical purposes. (End of text by the publisher)&#10;&#10;","minPlayers":1,"maxPlayers":8,"minPlayTime":10,"maxPlayTime":10,"minAge":8,"categoriesAndMechanics":["Card Game","Children's Game","Educational","Memory","Word Game","Cooperative Game","Hand Management","Memory","Pattern Recognition"],"rating":3.5,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/hj8sEvEQq7LyeLoNoxYeUg__thumb/img/Qo4nxxKW0dhqWvkbYPe-bX2YVoA=/fit-in/200x150/filters:strip_icc()/pic1628579.jpg","urlImage":"https://cf.geekdo-images.com/hj8sEvEQq7LyeLoNoxYeUg__original/img/79PySSq7ndalltqFLL1Bmp1ORZY=/0x0/filters:format(jpeg)/pic1628579.jpg"},{"bggId":"65670","name":"Ram Anything Painted Gray","description":"&quot;The Austro-Prussian War (1866) was fought between the Austrian Empire on one side, and Prussia and the Kingdom of Italy on the other side.&quot;&#10;&#10;&quot;The largest naval engagement occurred near the island of Lissa in the Adriatic Sea.  There an Austrian fleet of ironclads and steam powered wooden ships fought a larger Italian fleet.  The Austrians caught the Italians unprepared and succeeded in 'crossing the T' of the Italian fleet.  The heavy side belt armor of the ironclads was invulnerable to gunnery, and the most effect offensive tactic was ramming.  The Austrian fleet emerged victorious.&quot;&#10;&#10;A miniatures wargame intended for classroom use with two teams of students. The game is designed to be played on a 5x9 foot table using miniature ships. Free print-and-play paper miniatures are provided for use with the rules.&#10;&#10;Concepts covered in the rules include ranged combat, ramming, raking fire, turrets, and crippled ships.&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Educational","Miniatures","Nautical","Wargame","Dice Rolling"],"rating":2.75,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/faUcz1KCJKqx8CpXuAaMbA__thumb/img/7Jbij0PA3hStgK9SrseZIVXmSJc=/fit-in/200x150/filters:strip_icc()/pic651301.jpg","urlImage":"https://cf.geekdo-images.com/faUcz1KCJKqx8CpXuAaMbA__original/img/r5J1Ifr5hgZwWQNqMX636HNtNFQ=/0x0/filters:format(jpeg)/pic651301.jpg"},{"bggId":"65671","name":"By Jove That Will Do! The Battle of Salamanca (1812 AD)","description":"&quot;The battle of Salamanca in Spain was a part of the Peninsular Campaign which lasted from 1808-1814. It was as a result of Napoleon invading Spain and putting his brother on the throne of Spain. It also resulted in a British general in winning fame and glory. Wellington would begin his winning streak in Spain.&quot;&#10;&#10;&quot;Salamanca was the most decisive battle of the entire war which smashed Marshal Marmont`s French army. Although the war would continue for two more years, the French were put on the defensive, as the British, Portuguese and Spanish troops harassed the French until they were pushed back over the Pyrenees mountains into France.&quot;&#10;&#10;A miniatures wargame intended for classroom use with two teams of students. The game is designed to be played on a 1.5x1 meter table using 1/72 scale plastic miniatures mounted two per base (except for commanders and cannons). Free print-and-play paper miniatures are also provided for use with the rules.&#10;&#10;The streamlined &quot;fast play&quot; rules encompass unit formations, charges, commanders, and morale.&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Educational","Miniatures","Wargame","Dice Rolling"],"rating":2.75,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/co2LpHzF0y6ayNY92PfXaw__thumb/img/2jFuoTKCmHwDF3fno_HEr9Ee7Yw=/fit-in/200x150/filters:strip_icc()/pic651296.jpg","urlImage":"https://cf.geekdo-images.com/co2LpHzF0y6ayNY92PfXaw__original/img/Q5G8jBBs7D--BO_Oyxaa_NEcMiU=/0x0/filters:format(jpeg)/pic651296.jpg"},{"bggId":"65672","name":"Picco Sortino","description":"What a mess! Fortunately, there are the little gnomes who like to clean up. The pot is in the kitchen, but one where should the pillow go? The player who is the first to put all his goods into the right room, wins. A memory game for children.&#10;&#10;Content&#10;4 rooms made of cardboard&#10;16 counters&#10;1 dice&#10;instructions&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":15,"minAge":3,"categoriesAndMechanics":["Children's Game","Memory"],"rating":2.925,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/1i7YI1cqnfgSsVy4431lUQ__thumb/img/UYadheVNSmTO9CnXdMWnE1dsXHE=/fit-in/200x150/filters:strip_icc()/pic786788.jpg","urlImage":"https://cf.geekdo-images.com/1i7YI1cqnfgSsVy4431lUQ__original/img/4ERNTiCqYEwyQvUuis1nWH2uUx8=/0x0/filters:format(jpeg)/pic786788.jpg"},{"bggId":"65677","name":"King of the Jungle","description":"The players be able to determine which animals are mammals, birds, or reptiles and will be able to identify the continent that corresponds with the animal given its country of origin.&#10;&#10;This game is based on the card game &quot;UNO.&quot;&#10;The winner plays all of his cards first and calls out &quot;King of the Jungle&quot; when he has one card left.&#10;&#10;Components:&#10;95 cards&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":6,"categoriesAndMechanics":["Animals","Card Game","Educational","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/6bEFaB8h6-CJHnObWmlg_A__thumb/img/W-UL74AlnbF69KaPiJ_PkRqRxxI=/fit-in/200x150/filters:strip_icc()/pic673596.jpg","urlImage":"https://cf.geekdo-images.com/6bEFaB8h6-CJHnObWmlg_A__original/img/wS5vcDg0gRq2GF7CGjh2gh7ksJs=/0x0/filters:format(jpeg)/pic673596.jpg"},{"bggId":"65678","name":"Kings of France, or Charlemagne","description":"The players will be able to match the Kings of France to the appropriate royal house for each king. For example, Charles VII belonged to the house of Valois. In the affective domain, the students will have fun in learning what is considered to be an uninteresting subject.&#10;&#10;Object. The object of the game is to accumulate the most points by having the most cards discarded.&#10;&#10;Components:&#10;52 cards&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":0,"maxPlayTime":0,"minAge":18,"categoriesAndMechanics":["Card Game","Educational","Political","Set Collection"],"rating":3.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/yRZADzQI4NyuDCpV_zbkEg__thumb/img/azW_bLn_16WQ4BVYZ3eLfPHIfyU=/fit-in/200x150/filters:strip_icc()/pic673600.jpg","urlImage":"https://cf.geekdo-images.com/yRZADzQI4NyuDCpV_zbkEg__original/img/fjPfZ1YNkDNajlnTNCgpOivKCyU=/0x0/filters:format(jpeg)/pic673600.jpg"},{"bggId":"65679","name":"Least Common Multiple","description":"The players will be able to determine the least common multiple (LCM) of any two numbers between two and fifteen.&#10;&#10;Basic Game&#10;&#10;1. Remove cards numbered eleven through fifteen.&#10;   2. Deal half of the deck to each player.&#10;   3. Each player simultaneously throws down a card.&#10;   4. Each player tries to be the first to state the least common multiple of the two cards on the table. If the first player to respond is correct they get two points. If that player gives an answer that is a common multiple but not the least, they are given one point. If the first player to respond is completely wrong, the other player may get one point by answering correctly. Otherwise no points are given.&#10;The players can check their answer by looking at both lists of multiples and finding the lowest number that appears on both lists.&#10;   5. After points are awarded and the score is updated the two cards go into a discard pile.&#10;   6. The game ends when both players run out of cards.&#10;   7. The winner is the player with the most points&#10;&#10;Components:&#10;84 cards&#10;Paper and pancil&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":11,"categoriesAndMechanics":["Card Game","Educational","Math"],"rating":0,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/ZMrnZpLBDBv0p9IB3s_D3g__thumb/img/j3fdItlua1WTg9YQjAl_DN68QQU=/fit-in/200x150/filters:strip_icc()/pic673602.jpg","urlImage":"https://cf.geekdo-images.com/ZMrnZpLBDBv0p9IB3s_D3g__original/img/ThYydFoABOpls2TrxnpKmxcugnE=/0x0/filters:format(jpeg)/pic673602.jpg"},{"bggId":"65680","name":"Leonardo","description":"Art history students will classify paintings by period or artist. Using a card showing a piece of art, students will match it to another card with a picture of the same period or artist.&#10;&#10;The game follows the format of the card game &quot;UNO.&quot; &#10;Each card will contain a picture of a piece of art from one of four periods. Students will use cards from periods that are close together in time and style. The following periods could be used: Realism, Cubism, Impressionism, and Surrealism. Each card has an ID number that students may use at certain times to find information about the picture. &#10;To win, the player must get rid of all cards in his or her hand. Point values for the cards will be higher for the most recent works.&#10;&#10;","minPlayers":3,"maxPlayers":10,"minPlayTime":0,"maxPlayTime":0,"minAge":16,"categoriesAndMechanics":["Card Game","Educational","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/3A7u18bpPacSupLoZ5E6WQ__thumb/img/dlXzsg6D5RmrhEZlDbKPtw39gN8=/fit-in/200x150/filters:strip_icc()/pic673603.jpg","urlImage":"https://cf.geekdo-images.com/3A7u18bpPacSupLoZ5E6WQ__original/img/OPYw6HXx6pOE7Owz3-7cdE9FOys=/0x0/filters:format(jpeg)/pic673603.jpg"},{"bggId":"65681","name":"LRC Card Game","description":"The players are U.S. Navy Aviation Electronics Technician &quot;A&quot; (AT &quot;A&quot;) School students. Students are learning basic electronics. This game could be used for punctuation or enrichment. It would not be used to teach the objectives, but it could be used to practice and sharpen skills after the students had learned the concepts and principles. Students who had mastered the material presented in the class might play the game for enrichment while the instructor worked with those who needed more help. The entire class might be permitted to play and sharpen their skills.&#10;&#10;LRC is played like rummy. The object of the game is to get a run of three cards and a run of four cards that meet the following requirements depending on the level of play selected:&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":20,"categoriesAndMechanics":["Card Game","Educational","Nautical","Set Collection"],"rating":2.166665,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/pEbegcjQ4HbVvRyt5oJqHA__thumb/img/gtL1MShMRtT3WbvYYzdxIS0R2yI=/fit-in/200x150/filters:strip_icc()/pic673605.jpg","urlImage":"https://cf.geekdo-images.com/pEbegcjQ4HbVvRyt5oJqHA__original/img/EdBe2AMlaFd5LyxO-VF8RWF_-Pc=/0x0/filters:format(jpeg)/pic673605.jpg"},{"bggId":"65682","name":"Map Mania","description":"The player will learn the location of the seven regions of the continental United States by matching states to regions of the map.&#10;&#10;Object of play The players try to get rid of all of the cards in their hands. The first player to do this, wins.&#10;&#10;Components:&#10;52 cards&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":12,"categoriesAndMechanics":["Card Game","Educational"],"rating":0,"complexity":0},{"bggId":"65684","name":"Match `EM","description":"The player with be able to match the state's name to its picture and its picture to its name.&#10;&#10;The object of the game is to make as many matches as you can.&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":11,"categoriesAndMechanics":["Card Game","Educational","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/qb9x_E3uymfF6nga54_bog__thumb/img/RYzowrwFNCAP2cxTmAYmprxe0J4=/fit-in/200x150/filters:strip_icc()/pic3672356.jpg","urlImage":"https://cf.geekdo-images.com/qb9x_E3uymfF6nga54_bog__original/img/Oukfc4ievNjJfz5-ZFousgozIqw=/0x0/filters:format(jpeg)/pic3672356.jpg"},{"bggId":"65686","name":"Chassé-croisé","description":"Material: &#10;20 pawns (4 blue, 4 yellow, 4 white, 4 red) 1board , 21 cards.&#10;&#10;Goal : &#10;Each player tries to create the exact pattern of five pawns showed by his secret card drawn from the stock. This is done when the colors of pawns upon the board fit those of the card either horizontally, vertically or diagonally. The card is then won by the player, who draws another card from the stock.&#10;&#10;Pawns can be moved one step in every direction,  or jump above others pawns in chinese checkers style. &#10;The winner is the player who has won the most cards when the stock is empty.&#10;&#10;This game has been published in the same box that &quot;Le 5 &agrave; cinq&quot;&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":20,"minAge":7,"categoriesAndMechanics":["Abstract Strategy","Open Drafting","Pattern Building"],"rating":2.875,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/B8PZ2DL5MJbhrq6qtVWcVA__thumb/img/9RKiJi9pRx30n-kcOJzyw0klzQA=/fit-in/200x150/filters:strip_icc()/pic651226.jpg","urlImage":"https://cf.geekdo-images.com/B8PZ2DL5MJbhrq6qtVWcVA__original/img/AZ9tLBEbhaijbyLT1x6MY5nlrTE=/0x0/filters:format(jpeg)/pic651226.jpg"},{"bggId":"65687","name":"Le 5 à cinq","description":"Material: &#10;20 pawns with digits (15 blue,  5 red) 1 board.&#10;&#10;Goal : &#10;On player plays with the 5 red pawns, his opponent plays with 5 blue pawns randomly chosen. &#10;Pawns can be moved one step in every direction,  or jump above others pawns in chinese checkers style. &#10;Each time a player creates a line of three or more pawns with both colors connected, he scores the total of the values of the pawns. &#10;The first to score 200 points or more wins the game.&#10;&#10;This game has been published in the same box than &quot;Chass&eacute;- crois&eacute;&quot;&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":20,"minAge":7,"categoriesAndMechanics":["Abstract Strategy","Math","Grid Movement"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/SM4j3nJ5oCvoMpO8A-G-KQ__thumb/img/Ix-Ib4upEXiY_saViHMZEbK6hz0=/fit-in/200x150/filters:strip_icc()/pic1532590.jpg","urlImage":"https://cf.geekdo-images.com/SM4j3nJ5oCvoMpO8A-G-KQ__original/img/xXXdMd6tIOPObu4epHr-WRWKwzc=/0x0/filters:format(jpeg)/pic1532590.jpg"},{"bggId":"65690","name":"Bli Borgmästare i Uppsala","description":"This game consists of 3 more or less localized sub games.&#10;&#10;The predominant game is economic. The player moves around the board and if possible tries to buy the companies landed on. If another player already owns it, an industrial spy fine must be payed instead.&#10;&#10;The second game is a localized trivia game which kicks in at different events. Corrects answers give economic advantages.&#10;&#10;Third there is a voting process about which player should be the next mayor. The mayor has some advantages and disadvantages in the economic game. Each owned company corresponds to a number of votes. The results of each voting are kept and the final winner is the player who reaches the target number.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":100,"maxPlayTime":100,"minAge":9,"categoriesAndMechanics":["Economic","Political","Trivia","Roll / Spin and Move","Stock Holding","Voting"],"rating":2,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/hhZg6xuMDuky4gdsWHww-g__thumb/img/-zVSKgbTbADl0W6-F-gcqMT-YBg=/fit-in/200x150/filters:strip_icc()/pic654487.jpg","urlImage":"https://cf.geekdo-images.com/hhZg6xuMDuky4gdsWHww-g__original/img/hMyLnvEec4dky3somDDqvtLL9qo=/0x0/filters:format(jpeg)/pic654487.jpg"},{"bggId":"65694","name":"Cleveland Browns Sideline Football Game","description":"Offically licensed product by NFL. It is a game of strategy. Developed after hours of interviews with your favorite players and coaches. Questions are exciting and educational and are ranked by degree of difficulty. You can score by running, passing and or field goal on the 15x24 playing field. You determine yardage attempted by questions degree of difficulty.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":60,"maxPlayTime":60,"minAge":0,"categoriesAndMechanics":["Sports","Trivia"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/J6gGHLR3aN3WjmNgZ4e1BQ__thumb/img/P2YnUg2JA1eYWq9hNP2pJADtsnk=/fit-in/200x150/filters:strip_icc()/pic1467343.jpg","urlImage":"https://cf.geekdo-images.com/J6gGHLR3aN3WjmNgZ4e1BQ__original/img/yUagc-nwxn5O_6fOs99xHEuQweM=/0x0/filters:format(jpeg)/pic1467343.jpg"},{"bggId":"65696","name":"Labyrinth","description":"A young adventurer is seeking his fortune in the Labyrinth. He seeks the 3 great treasures which will allow him to live out his life in luxury. The Labyrinth is the hunting ground for 3 horrible beasts.&#10;&#10;The game board consist of 4 rings that freely rotate around each other. Roughly once per game round, the board will shift. The way the board shifts is determined by the active player. The power to control the shift is passed after the player shifts the board.&#10;&#10;One player must play as the adventurer, the remaining players may choose from an assortment of characters to play. The player playing the adventurer is trying to get 3 treasure chest and get out (gaining a new ability with each chest), while the other players are all trying to capture the adventurer and bring him/her back to their layer. They are not working together and will likely end up fighting over the adventurer.&#10;&#10;Each Character has its own special ability.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":0,"categoriesAndMechanics":["Adventure","Fantasy","Maze","Modular Board","Roll / Spin and Move","Variable Player Powers"],"rating":3,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/6fD4urUsuoTH6QANLtElXQ__thumb/img/wGxjwOT058WTeeUOXXBNpboBII4=/fit-in/200x150/filters:strip_icc()/pic651444.jpg","urlImage":"https://cf.geekdo-images.com/6fD4urUsuoTH6QANLtElXQ__original/img/drYALoRih5NBSQmjIkvQJnxz2RU=/0x0/filters:format(jpeg)/pic651444.jpg"},{"bggId":"65700","name":"Women's Lib?","description":"The game of women's rights.&#10;From a sticker included in the box: &#10;Male chauvinists, radical feminists, happy housewives, confused husbands - they're all right here in WOMEN's LIB. Each player is assigned one of these characters and tries on a whole new personality. WOMEN's LIB is a game of debates and elections, bribes and bargains. Fight for your cause, argue your point of view and everybody learns something about our changing world and it's women.&#10;&#10;The first player to accumulate 35 Persuasive Points is the winner of the game. The points are awarded to players who successfully debate and campaign to achieve the goals favored by the character they are representing.&#10;&#10;","minPlayers":4,"maxPlayers":7,"minPlayTime":90,"maxPlayTime":90,"minAge":14,"categoriesAndMechanics":["Educational","Negotiation","Role Playing","Voting"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/v7Hs_mH6HGnQ1GGi1-R6Pw__thumb/img/H0OXSG4LzCQFgT-hNmvR6JlSbd4=/fit-in/200x150/filters:strip_icc()/pic651427.jpg","urlImage":"https://cf.geekdo-images.com/v7Hs_mH6HGnQ1GGi1-R6Pw__original/img/e4zHsNazwtNp___a4hsQp6EpznI=/0x0/filters:format(jpeg)/pic651427.jpg"},{"bggId":"65701","name":"Europa viva","description":"Players draw three out of 190 cards with buildings, landmarks, food, sports or other items connected to a European country. At a player`s  turn, he describes one of his cards, but rather vaguely and personal, but still unambiguously (he can for instance also use his feelings, like: &quot;I will never climb up THERE!&quot; (Eiffel Tower)) without naming them directly. Then they place three rings onto a map of Europe, one of them including the flag of the country his item is connected with. The other players now place their pawns into the ring they think includes the correct flag. The item is revealed and the players score points tracked down around the map. The player whose pawn surrounds he map twice first, wins the game.&#10;&#10;","minPlayers":3,"maxPlayers":6,"minPlayTime":60,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Educational","Party Game","Trivia"],"rating":4,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/yOqk7bXH3wpWXgoARsnVkg__thumb/img/TEh-fL9FXd-9aM1H5xmBo-a_uiQ=/fit-in/200x150/filters:strip_icc()/pic1399424.jpg","urlImage":"https://cf.geekdo-images.com/yOqk7bXH3wpWXgoARsnVkg__original/img/PDTq_jcfmW-6mCG42COMZUGzuIc=/0x0/filters:format(jpeg)/pic1399424.jpg"},{"bggId":"65705","name":"Measurement Rummy","description":"The learner shall be able to match measurements to their corresponding equivalents.&#10;&#10;The players may lay down any equivalents that he or she has. After all matches have been made, the player discards laying the card face up. &#10;The player who gets rid of their cards first is the one who wins the game.&#10;&#10;Components:&#10;52 cards&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":10,"categoriesAndMechanics":["Card Game","Educational","Set Collection"],"rating":0,"complexity":0},{"bggId":"65706","name":"MixMania","description":"The objective of MixMania is to provide newly formed and intact groups with a fun and interactive way to get acquainted with the other members of a group.&#10;&#10;A &quot;profile&quot; consists of one answered question from each of the four suits. This equals a total of four answered questions on each of the other players. The first person to accumulate &quot;profiles&quot; for each of the players in the game is the winner.&#10;&#10;MixMania follows a rummy structure and categorizes information by the four suits. The wildcard can be used for any suit in a &quot;profile.&quot;&#10;&#10;Componets:&#10;82 cards&#10;There are four suits called Work Life, Personal Life, Childhood, and Dreams and two Wildcards.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Card Game","Educational","Set Collection"],"rating":0,"complexity":0},{"bggId":"65707","name":"The Mixology Game","description":"The playerswill be able to combine either three or four playing cards which identify the contents and quantities of fifteen drinks. The student should be able to combine the cards correctly 80% of the time when playing the game.&#10;&#10;A rummy structure is used in the design of the game.&#10;The object of the game is for each player to combine one set of four cards which define the ingredients of one drink and another set of three cards which define the ingredients of a second drink. The first player to successfully combine the two drink combinations and place the two combinations face down in front of the other player wins.&#10;&#10;Components:&#10;52 cards&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":21,"categoriesAndMechanics":["Card Game","Educational","Set Collection"],"rating":0,"complexity":0},{"bggId":"65709","name":"Multiplication Stars!!","description":"The players will be able to recite the multiplication tables from zero to twelve from memory.&#10;&#10;Players multiply 2 numbers correctly from the cards to get 2 stars. Winner is the player with the most stars at the end of game. End of game comes when the teacher calls time.&#10;&#10;Components:&#10;&#10;     deck of cards&#10;     100 yellow stars for scoring&#10;&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Card Game","Educational","Math","Set Collection"],"rating":0,"complexity":0},{"bggId":"65714","name":"Patterns","description":"Patterns is played on an empty 5x5 square board.&#10;On the first move the first player drops one of his stones on an empty cell.After that,each player may make one of the following:&#10;1.Drop two stones making no captures.&#10;2.Drop one stone to capture enemy stones.&#10;Wins the player that captures 9 stones or stalemates the opponent.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":15,"maxPlayTime":15,"minAge":0,"categoriesAndMechanics":["Abstract Strategy"],"rating":3.5,"complexity":2},{"bggId":"65715","name":"The Illusionist","description":"The Illusionist is a card game for 2&ndash;4 players who play rival Victorian-era magicians/illusionists. The goal of the game is to become the City's most prominent performer by having the highest number of Prestige Points at the end of the game. Prestige Points are earned by creating/assembling astounding illusions and &ldquo;performing&rdquo; them at various types of theatres in the city. Strategy, timing and elements of luck all play a role in your rise to prominence, as do the political machinations and jealousy of your peers.&quot;&#10;&#10;It's basically a set-collection card game that plays in 30-45 minutes. The suits are four different types of illusions commonly performed by late-Victorian era stage magicians and you'll need an &quot;aha!&quot; idea card of a suit and a card of values 1,2 and 3 of the same suit to perform (put into play) an illusion to earn Prestige Points points. There are 16 different magicians to play, each with their own strengths and weaknesses, optional trait cards, and the all important Events (fate) deck that you both need and dread.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":45,"minAge":10,"categoriesAndMechanics":["Card Game","Open Drafting","Set Collection","Storytelling","Variable Player Powers"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/B60MNuJ6loZ9aHSD7Sw-sw__thumb/img/vFWHCVj2W59cyynXwLruOxCtbVo=/fit-in/200x150/filters:strip_icc()/pic2243571.jpg","urlImage":"https://cf.geekdo-images.com/B60MNuJ6loZ9aHSD7Sw-sw__original/img/scAz0TJQwUpsgRNZwsRw2R8dOZs=/0x0/filters:format(jpeg)/pic2243571.jpg"},{"bggId":"65716","name":"Flocks (rebaños)","description":"It is a game for two players.&#10;&#10;The dog is faster than the sheep.&#10;The sheep are always still, grazing.&#10;When the dog gets near the sheep they start running along with him. As soon as the dog moves away they stop and start to graze again.&#10;&#10;-Each player has one sheep dog and sixteen sheep, white or black.&#10;&#10;-The dog is placed on the cross next to the player, the cross is also next to the sheepfold in which he has to introduce his sheep.&#10;&#10;The youngest player begins.&#10;Taking turns each player places the other player&rsquo;s sheep on the board, one by one. They can&rsquo;t touch sheep of the same colour nor the wire fence that surrounds the field. You can put sheep next to sheep from the other flock.&#10; -The sheep, the bigger the flock gets, are more difficult to be moved by the dog in the way that:&#10;The dog moves up to 5 squares in any direction.&#10;Sheep can only be moved by the dog horizontally or vertically, never diagonally, in the following way:&#10;    Dog (alone)        up to 5 squares&#10;    Dog + 1 sheep        up to 4 squares&#10;    Dog + 2 sheep        up to 3 squares&#10;    Dog + 3 sheep        up to 2 squares&#10;    Dog + 4 sheep or more    up to 1 square&#10;&#10;The dog can join and leave the sheep as many times as he likes as long as he does not move more than the total number of 5 squares.&#10;&#10;&quot;up to&quot; means that there is no need to move the total number of allowed movements if one does not want to.&#10;&#10;A dog can only move sheep of his own sheepfold. The other sheep ignore him and will not move no matter how loud it may bark! They will just stay still, grazing.&#10;&#10;The player that first gets all his sheep in his sheepfold is the winner.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":15,"maxPlayTime":15,"minAge":7,"categoriesAndMechanics":["Racing","Point to Point Movement","Simulation"],"rating":4.25,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/CltqnTollnn9RUtDAHN7bA__thumb/img/63HAIt3cAdfA6ivJqyaMWvhjge4=/fit-in/200x150/filters:strip_icc()/pic654218.jpg","urlImage":"https://cf.geekdo-images.com/CltqnTollnn9RUtDAHN7bA__original/img/ulGMhulNRUyqHF0SOlQ3Z_LqQv8=/0x0/filters:format(jpeg)/pic654218.jpg"},{"bggId":"65717","name":"Sacramento","description":"Players have four &quot;cowboys&quot; which they move across the board, according to dice rolls. Under one of them they have hidden gold which they want to get to the bank (at the other end of the board) safely. Other players try to steal the gold by getting on the same field on the board.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":15,"minAge":8,"categoriesAndMechanics":["Dice","Pick-up and Deliver"],"rating":2.13889,"complexity":1.5,"urlThumb":"https://cf.geekdo-images.com/dq6v1Z57EMd_JiLVPD4dUA__thumb/img/6W8fo53vtObKwJjbtie_pS31sa8=/fit-in/200x150/filters:strip_icc()/pic2069175.jpg","urlImage":"https://cf.geekdo-images.com/dq6v1Z57EMd_JiLVPD4dUA__original/img/uNrffff_VKW6Zd6ooxgd36tGTNc=/0x0/filters:format(jpeg)/pic2069175.jpg"},{"bggId":"65718","name":"Temple","description":"In Temple you control one of the four ancient elements: Earth, Fire, Wind, and Water.  Locked in conflict with the other powers, you vie for supremacy by moving your elemental pawns into different formations, scoring points.&#10;&#10;Temple is played on a square board of variable size - the more players you have, the larger the board.  Each player has six pawns, which they move in an attempt to match cards drawn from a deck.  These cards are placed face up in view of all players, so you must work to match your own cards while preventing the other players from doing the same.  You not only have the ability to control your own pieces, but you can even summon the primordial powers to move the pieces of your opponents!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":45,"minAge":12,"categoriesAndMechanics":["Abstract Strategy","Real-time","Dice Rolling","Pattern Building","Roll / Spin and Move","Tile Placement"],"rating":4.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/csVw1tgii2DE_X2giSbkTQ__thumb/img/7d5c92xZrFJDLkUJY0URU8lbs-w=/fit-in/200x150/filters:strip_icc()/pic654198.jpg","urlImage":"https://cf.geekdo-images.com/csVw1tgii2DE_X2giSbkTQ__original/img/z0eTUEUreoKx4JR-QHrBc-akFoQ=/0x0/filters:format(jpeg)/pic654198.jpg"},{"bggId":"65722","name":"Viva San Martin!","description":"&quot;Jose de San Martin led the battle for independence against the Spanish in the southern part of South America. His efforts were instrumental in the liberation of Argentina and Chile. His greatest victory came in 1818 at the the Battle of Maipo in Chile. In this decisive battle he defeated the final Spanish offensive and secured the freedom of Chile.&quot;&#10;&#10;This miniatures wargame is intended for classroom use with two teams of students (grades 6-8). The game is designed to be played on a 7.5x5 foot table using 1/72 scale plastic miniatures mounted two per base, except for commanders which are mounted singly. Free print-and-play paper miniatures are also provided for use with the rules. Each side has one overall commander and assorted infantry, cavalry, and cannon units.&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Educational","Miniatures","Wargame","Dice Rolling"],"rating":2.75,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/MOMAyEI9iNmlHHWZFRGvmQ__thumb/img/VJWtxnfvAXAgi3ImLfDnCPqgZ5A=/fit-in/200x150/filters:strip_icc()/pic653464.jpg","urlImage":"https://cf.geekdo-images.com/MOMAyEI9iNmlHHWZFRGvmQ__original/img/YS6ZkTQ7nIzIuFkUvokmi3Hn5QI=/0x0/filters:format(jpeg)/pic653464.jpg"},{"bggId":"65730","name":"Across the Andes","description":"&quot;In 1819 Simon Bolivar led his army across the Andes and began the campaign to liberate Colombia (New Granada) from Spanish rule.&quot;&#10;&#10;&quot;He achieved his goal with the decisive battle of Boyaca. Simon Bolivar's rebel army launched a surprise attack which cut the royalist army in half as they crossed a bridge. The Spanish were routed, opening the road to Bogota. Battle of Boyaca Day is celebrated in Colombia every August 7.&quot;&#10;&#10;This miniatures wargame is intended for classroom use with two teams of students (grades 6-8). The game is designed to be played on a 7.5x5 foot table using 1/72 scale plastic miniatures mounted two per base, except for commanders which are mounted singly. Free print-and-play paper miniatures are also provided for use with the rules. Units portrayed in the game include infantry, cavalry, militia, rifles, and cannon.&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Educational","Miniatures","Wargame"],"rating":2.75,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/XS8aIjT5ehvwHT1w11Ho5g__thumb/img/_OX3ronDa40vFnIKHDcSN5OHMIk=/fit-in/200x150/filters:strip_icc()/pic653458.jpg","urlImage":"https://cf.geekdo-images.com/XS8aIjT5ehvwHT1w11Ho5g__original/img/Dc1uraFL8nQcAgS-W2wXLErC6Bw=/0x0/filters:format(jpeg)/pic653458.jpg"},{"bggId":"65740","name":"The Racket, A game about Respect","description":"The Racket&copy; is a game about respect. More specifically it&rsquo;s about the Mafia interpretation of respect. You will take on the role of a mafia style gang, and establish a protection racket. Each building you extort builds your respect.&#10;&#10;Includes:&#10;&#10;* main Board&#10;    * Prison Progress Chart Board&#10;    * Action Cards Deck (40 cards)&#10;    * Game Manual Document&#10;    * 4 Avatar Pawn - Blue&#10;    * 4 Avatar Pawn - Green&#10;    * 4 Avatar Pawn - Red&#10;    * 4 Avatar Pawn - Yellow&#10;    * 2 D6 (16mm) - White&#10;    * 4 Plastic Bags - 3&quot;x4&quot;&#10;    * 2 Rings - Blue&#10;    * 2 Rings - Green&#10;    * 2 Rings - Red&#10;    * 2 Rings - Yellow&#10;    * 50 Wink (7/8&quot; | 22mm) - Blue&#10;    * 50 Wink (7/8&quot; | 22mm) - Green&#10;    * 50 Wink (7/8&quot; | 22mm) - Red&#10;    * 50 Wink (7/8&quot; | 22mm) - Yellow&#10;&#10;Victory Condition:&#10;The game is won by the first player to reach 100 respect, or the last surviving player.&#10;&#10;Awards:&#10;Summer 2007&#10;Future Game Developer Award&#10;Verba Volent, Scripta Manet&#10;for &quot;Best Game Rules/ Documentation&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":45,"minAge":0,"categoriesAndMechanics":["Mafia","Area Majority / Influence","Dice Rolling","Hand Management"],"rating":0,"complexity":0},{"bggId":"65741","name":"Kurz","description":"In this game, two players talk on a &quot;phone&quot; (or any device held to the active player's ear). Before they start, a spinner determines a subject for the call and a matching taboo word. The caller also decides whether he/she wants to talk for 20-40, 40 to 60 or 60 to 90 seconds. A third player controls the time.&#10;&#10;When the caller picks up the phone piece, the person who is called has to involve the caller in a conversation, trying to force him/her to use the taboo word or the words yes or no, which are also taboo. Whenever the caller uses one of these words, he/she gets a headache pill (but the conversation continues). &#10;During the conversation, the caller has to try and estimate how much time has passed. When he/she thinks the time is within the chosen limits, he or says goodbye and puts down the &quot;phone&quot;. If he/she was within the chosen limits, he/she gets one, two or three points, depending on the length of the call. Then the next player makes a call.&#10;&#10;Two headache pills count minus one point. The player with most points (or, frequently, with least negative points) after an agreed number of calls is the winner.&#10;&#10;","minPlayers":3,"maxPlayers":7,"minPlayTime":0,"maxPlayTime":0,"minAge":10,"categoriesAndMechanics":["Party Game","Real-time","Word Game","Storytelling"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/18N2j_4UgtZzEafQLu9OnQ__thumb/img/cMSPS2JSJglEfTktYQZ2HCg3b0M=/fit-in/200x150/filters:strip_icc()/pic767799.jpg","urlImage":"https://cf.geekdo-images.com/18N2j_4UgtZzEafQLu9OnQ__original/img/qtFClbnROAGf-YmsGZiyEbsdG9I=/0x0/filters:format(jpeg)/pic767799.jpg"},{"bggId":"65742","name":"Trivoli","description":"Trivoli is a compelling and simple game in which the whole family will enjoy! The game offers two magnificent structure excellent game, only to turn around the carousel and you can play another game on a another board. Rotate the carousel turn one level and try to make our own secret character or picture. Beware, however, from establishing a false picture, which you may help another player win! The game teaches 3D and logical thinking in a way that makes the child want to play the game again and again! Winner is the one who get the picture together first or the the other side of the carousel!&#10;The game is played like this: you have a six sided classical dice with three circles on each side. One of those is painted black: the one in the middle, second or the most outside one. And each painted circle is twice on hat dice.&#10;Rolling that dice decides which part of the carousel you can turn.&#10;Then you watch the picture you got at the beginning, and see, if you can create that by turning the rolled circle around the center. If you succeed creating that picture, you get one chip from the center bowl. Get the most of these to win!&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":15,"maxPlayTime":15,"minAge":5,"categoriesAndMechanics":["Children's Game","Educational","Dice Rolling"],"rating":1.625,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/X8zNQrX7aoXGjCY2C4EwZg__thumb/img/xAZbZsqUMM1xFTn-E8hwOfK0X6E=/fit-in/200x150/filters:strip_icc()/pic656859.jpg","urlImage":"https://cf.geekdo-images.com/X8zNQrX7aoXGjCY2C4EwZg__original/img/WYgui-I_fuy5Ip2ny5Nrn2IvxkU=/0x0/filters:format(jpeg)/pic656859.jpg"},{"bggId":"65743","name":"Lexico Suomi-Englanti","description":"Unique dictionary game is now completely renovated! Lexico contains a total of 9000 commonly used words, divided into five thematic areas: Human, Environment, Nature and Hobby, Science and Technology as well as the general words. Three different levels of difficulty thanks to the game is suitable for all ages and levels of language minds can play together - each of the chosen level of difficulty. Lexicon company you enjoy and learn a foreign language!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":9,"categoriesAndMechanics":["Educational","Trivia","Word Game"],"rating":2.386955,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/Mek6M7D2wIZ_eQH6jv7qVw__thumb/img/dXUYc-LkbjvwN7pZL5d1Wez3wjA=/fit-in/200x150/filters:strip_icc()/pic656860.jpg","urlImage":"https://cf.geekdo-images.com/Mek6M7D2wIZ_eQH6jv7qVw__original/img/Y6WJVGjKFXYE-uldM401isYC2xU=/0x0/filters:format(jpeg)/pic656860.jpg"},{"bggId":"65744","name":"Lexico Suomi-Ranska","description":"Unique dictionary game is now completely renovated! Lexico contains a total of 9000 commonly used words, divided into five thematic areas: Human, Environment, Nature and Hobby, Science and Technology as well as the general words. Three different levels of difficulty thanks to the game is suitable for all ages and levels of language minds can play together - each of the chosen level of difficulty. Lexicon company you enjoy and learn a foreign language! Win by getting rid of all your cards first!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":9,"categoriesAndMechanics":["Educational","Word Game"],"rating":2,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/wj-ka9Hnm8sUgdKp2SbyLQ__thumb/img/kRfju1kJY41XEZrXGm_b4JyoHbk=/fit-in/200x150/filters:strip_icc()/pic656864.jpg","urlImage":"https://cf.geekdo-images.com/wj-ka9Hnm8sUgdKp2SbyLQ__original/img/PtiZNH3qWXVp6P66aV_CeCAsBgM=/0x0/filters:format(jpeg)/pic656864.jpg"},{"bggId":"65745","name":"Die Himmelsziege und die schwarzen Löcher","description":"The space ship Himmelsziege travels through space, trying to evade the dangerous black holes. &#10;One player is the route planner, another is the captain. The planner reveals three route cards, and secretly blocks one of them with a magnet on the underside of the board. The captain then chooses one of the route, and the planner tells the captain about one other route that is not blocked. The captain then has the option to change the route. &#10;Afterwards, a small metal ball is rolled from a ramp at the starting point toward the destination. If it passes the magnet, it is stopped and caught by the black hole.&#10;&#10;Depending on the outcome and on whether the route had been changed, chips in different colors are awarded to the players. The goal of the game is to collect chips, but mainly to demonstrate the Monty Hall problem.&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Educational","Science Fiction","Space Exploration","Point to Point Movement"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/KjXggmTT_2R4vqZ-VFENJw__thumb/img/OBW1RLTSlIzveBXp7gdalpCSsVE=/fit-in/200x150/filters:strip_icc()/pic767800.jpg","urlImage":"https://cf.geekdo-images.com/KjXggmTT_2R4vqZ-VFENJw__original/img/Z94-lVSS6P1sL64vxg70YR-S6jc=/0x0/filters:format(jpeg)/pic767800.jpg"},{"bggId":"65746","name":"Lexico Suomi-Ruotsi","description":"Unique dictionary game is now completely renovated! Lexico contains a total of 9000 commonly used words, divided into five thematic areas: Human, Environment, Nature and Hobby, Science and Technology as well as the general words. Three different levels of difficulty thanks to the game is suitable for all ages and levels of language minds can play together - each of the chosen level of difficulty. Lexicon company you enjoy and learn a foreign language! You win by getting rid of all your cards!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":9,"categoriesAndMechanics":["Educational","Word Game"],"rating":2.4,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/tKmOffU1UrQ9GgGBCM8q_g__thumb/img/4oaGpE_QAyAA-HtpZsATbN32nf8=/fit-in/200x150/filters:strip_icc()/pic656865.jpg","urlImage":"https://cf.geekdo-images.com/tKmOffU1UrQ9GgGBCM8q_g__original/img/ZTvCsAx__-RMcB2Gq4Q0Qd12NyQ=/0x0/filters:format(jpeg)/pic656865.jpg"},{"bggId":"65747","name":"House Hunt","description":"Object of the Game&#10;&#10;The overall object of the game is to be the player with the best deal on a home. The best deal is determined by the total cost of purchasing the home less the total value of the home.&#10;&#10;Each mini-game contributes to the total cost and/or total value of the home which is recorded on the home buyer's contract. At the conclusion of the games, the cost and value of each home is calculated, producing a winner(s).&#10;&#10;Each mini-game has a contributory goal to the overall goal.&#10;&#10;In Mortgage Mambo, the mini-game goal is to get as many loan offers as possible and then to select from those offers.&#10;&#10;In Realtor Roundup, the mini-game goal is to get to the best realtor and therefore get the largest number of buyer incentives.&#10;&#10;In Inspection Perfection, the mini-game goal is to increase the cost or decrease the value of your opponents Home Buyer's Contract.&#10;&#10;The Rules&#10;&#10;House Hunt General Rules&#10;&#10;For both single player games and games of two or more.&#10;&#10;1. Each player should take a blank Home Buyer's contract. Each player will need a pen or pencil to record results on their home buyer's contract.&#10;   2. Select one Home Profile from the set of Home Profile cards. Each player will use the same home profile as a starting part for their home contract.&#10;   3. Each player then uses a pencil to fill out their home-buyer's contract with the information from the home profile card.&#10;   4. For a complete game, play in the following order:&#10;          * Mortgage Mambo&#10;          * Realtor Roundup&#10;          * Inspection Perfection&#10;   5. You may also play each game by itself or skip one or two of the games. If Inspection Perfection is played, it should always be played last.&#10;&#10;Realtor Roundup and Mortgage Mambo Rules&#10;&#10;For two or more players:&#10;&#10;1. Select one side of the draw box for the game you are playing to pull cards from.&#10;   2. Place the END GAME marker in the middle of the draw box For a longer game, place it closer to the side opposite where you will draw from.&#10;   3. All player tokens begin at START.&#10;   4. Select one player to be first. This is the current player.&#10;   5. The player on the right of the current player draws a task card from the draw box and asks the current player the question on the outside of the card.&#10;   6. If the current player requests a hint, the player on the right opens the card and reads the hint (usually a set of multiple choice answers).&#10;   7. The number of spaces a player may move is stated on each task card and depends on whether the current player got the answer right and whether a hint was used. Follow the directions on the task cards.&#10;   8. When a player lands on a space with directions, the player should follow those directions prior to the next player taking a turn.&#10;   9. When a current player's turn is over, play proceeds clockwise to the next player, who becomes the current player.&#10;&#10;For single players:&#10;&#10;1. Set up play as for two or more players.&#10;   2. Draw task cards and answer the questions.&#10;   3. If you need a hint, open the task card enough to see the hint while still obscuring the answer.&#10;   4. When you've answered the question, open the card completely to confirm if your answer is correct.&#10;   5. Move your token as directed and record any changes to your home buyer's contract.&#10;&#10;Inspection Perfection Rules&#10;&#10;For two or more players only.&#10;&#10;1. Shuffle Inspection Deck. Each player should take four (4) cards from the deck, making certain not to show the cards to other players.&#10;   2. There are two objectives to this game. The first is to discard all of your cards. The second is to ask other players questions that you think they don't know, forcing them to pick up another card from the pile and to receive a penalty which will affect their home buyer's contract.&#10;   3. Play proceeds as follows:&#10;          * A player chooses a card from his/her hand and asks any other player the question on the card.&#10;          * If the questioned player gets the answer correct, s/he receives the reward specified on the card.&#10;          * If the questioned player gets the answer wrong, s/he receives the penalty specified on the card and must draw a card from the inspection pile.&#10;          * In either case, the questioning player discards the card in the common discard pile.&#10;   4. Play then proceeds to the player on the left of the player who just asked the question.&#10;   5. When one player has no more cards, the game is over.&#10;&#10;Ending The Games&#10;&#10;At the end of the games, complete the calculations on your home buyer's contract. The person with the best deal wins.&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":60,"maxPlayTime":60,"minAge":8,"categoriesAndMechanics":["Economic","Educational","Hand Management","Stock Holding"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/AxIelVjJ9qr2j9GZerBOvg__thumb/img/iQ83o8nPfzJwaa2s3o95Lv82qJE=/fit-in/200x150/filters:strip_icc()/pic656877.jpg","urlImage":"https://cf.geekdo-images.com/AxIelVjJ9qr2j9GZerBOvg__original/img/FcicxS4Ol2Z5Gl_YUrpgCN99T9k=/0x0/filters:format(jpeg)/pic656877.jpg"},{"bggId":"65748","name":"What's the Matter?","description":"Object of the Game&#10;&#10;Work as a team to gather and interpret enough clues to correctly identify the mystery element in the envelope. The teams do this by landing on the clues and/or stealing clues from other teams.&#10;&#10;The Rules&#10;&#10;Setup&#10;&#10;1. Put one electron card on each electron space on the board.&#10;   2. Place the mystery element envelope on the mystery element box on the board.&#10;   3. Put the question cards on the question box on the board.&#10;   4. Pick a game piece and place it in the nucleus.&#10;   5. Distribute markers and periodic table folders to each team.&#10;&#10;Playing Game - read all directions before playing&#10;&#10;1. BEGINNING PLAY - Each team rolls a die. The highest number goes first.&#10;   2. One at a time, all teams must answer a question card correctly to cross from the nucleus to the first shell.&#10;   3. If answered incorrectly, wait until your next turn to try again. You must answer the question correctly to leave the nucleus and start playing.&#10;   4. After your team has correctly answered a question card, move your piece from the nucleus along one of the bridges and remain there until your next turn.&#10;   5. CONTINUING PLAY - On your next turn, roll the die and travel in any direction along that shell.&#10;   6. ELECTRON CARDS - When you land on an electron clue card, pick up the card and share it only with your team.  Use your periodic table to mark off elements that the clue eliminates.  Once an electron clue card is picked up, the space becomes null.&#10;   7. QUESTION BRIDGES - Use the question card bridges to travel to available clue cards in different shells. You must answer the question correctly to use the question card bridge.&#10;   8. ELEMENT SYMBOL/DIAGRAM SPACES - If you land on an element symbol, jump to the corresponding element diagram, and vice versa.&#10;   9. WINNING THE GAME - Once your team thinks they have determined the mystery element, travel back to the nucleus, answering question cards correctly to travel across the bridges and rolling the die. It is not necessary to land in the nucleus by an exact roll of the die.  Once in the nucleus, you may announce your guess and check the envelope. If you are right, you win! If you are wrong, place the card back in the envelope, your team is out and the game continues with the other teams.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":45,"maxPlayTime":45,"minAge":12,"categoriesAndMechanics":["Educational","Trivia"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/9t-vqNlIkgu9WApVi7fZTQ__thumb/img/DUv99eNfpja2OAYCjZmt0bUDMIo=/fit-in/200x150/filters:strip_icc()/pic656883.jpg","urlImage":"https://cf.geekdo-images.com/9t-vqNlIkgu9WApVi7fZTQ__original/img/pzVH9mXVdG2EiEelWbjwf9zOeAs=/0x0/filters:format(jpeg)/pic656883.jpg"},{"bggId":"65749","name":"Caloric Consequences","description":"Object of the Game&#10;&#10;The goal of the game is to have the fewest calories after moving around the board one time.  Each player must reach the finish, or &ldquo;Lights Out,&rdquo; and the player with the fewest calories at &ldquo;Lights Out&rdquo; is the winner.&#10;&#10;The Game&#10;&#10;Caloric Consequences&#10;&#10;OBJECT: The object of Caloric Consequences is to get through a day of meals and activities (from Wake Up and Smell the Coffee to Lights Out) with the fewest total calories.&#10;&#10;SETUP: Place the cards in the appropriate places on the board and distribute one notepad, one pencil, and one game-piece to each player. The game is for 2&ndash;4 players, ages 21 and up.&#10;&#10;RULES:&#10;&#10;1.           All players roll the die. The player with the highest roll goes first, then the turn passes to the right.&#10;&#10;2.           All players start on Wake Up &amp; Smell the Coffee.&#10;&#10;3.           The active player rolls the die once during a turn and moves his or her piece according to the number indicated.&#10;&#10;4.           The player to the left of the active player draws a card from the stack that corresponds to the space the active player lands on and reads the scenario and the options, NOT the calories.&#10;&#10;5.           The active player MUST choose one of the options. (It can be assumed that all of the food and drink options on a card are of the same serving size.)&#10;&#10;6.           The inactive player reveals the caloric value of the active player&rsquo;s choice, and the active player records that value on his or her notepad. (Each player should total his or her calories after each turn. Players may use calculators.) The inactive player then reads the remaining caloric values.&#10;&#10;7.           If a player lands on Free Time and chooses an activity to do right now, he or she MUST physically complete that activity.&#10;&#10;8.           Play repeats according to the steps above.&#10;&#10;9.           The first player to reach Lights Out deducts 100 calories.&#10;&#10;10.       The game ends when all players reach Lights Out. An exact roll of the die is NOT necessary to reach Lights Out.&#10;&#10;11.       To Win: The player with the lowest number of calories wins.&#10;&#10;12.       In the case of a tie, the winner can be determined with one of the following methods: flip a coin, roll the die, pushup contest, arm-wrestling, rock-paper-scissors, thumb-war, draw straws, or staring contest.&#10;&#10;OPTIONAL: Players may calculate the excess calories they consumed in a day and estimate how much weight they would gain in a year if they made the same choices in life that they made in the game with the equations below:&#10;&#10;total calories &ndash; 2,000 = excess daily calories&#10;&#10;excess daily calories x 365 &cedil; 3,500 = yearly weight gain&#10;&#10;LONG GAME: Play can be lengthened by circling the board more than once.&#10;&#10;CARD GAME: To play as a card game, players take turns reading cards to each other, reading one card per turn, going in order from Breakfast to Dinner. Players choose options and calculate calories as in regular play.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":21,"categoriesAndMechanics":["Educational","Mature / Adult","Dice Rolling"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/jAIsKKF5WDZUdccqx3hKyA__thumb/img/3x2USJyGbmSeS4tV2yOsvocK-oA=/fit-in/200x150/filters:strip_icc()/pic656896.jpg","urlImage":"https://cf.geekdo-images.com/jAIsKKF5WDZUdccqx3hKyA__original/img/p9EF_QLyaE7nkjihL4Z-eSC-jU0=/0x0/filters:format(jpeg)/pic656896.jpg"},{"bggId":"65750","name":"From Zona to Jerusalem","description":"Object of the Game&#10;The goal of the game is for players to follow the Exodus route (from Zona to Jerusalem) arriving the&#10;destination as soon as possible. The player arrives at Jerusalem first wins. When the player uses up the&#10;lifesaver lines and money, he/she must quit the game.&#10;&#10;Chevron Rules&#10;1. Different chevrons represent different places the player will land on. Each time the players should&#10;follow the words in the chevron to know how many chevrons they will move forward or backward.&#10;2. When the player lands on the question chevron, she/he must read out the question and answer&#10;them. According to the difficultly of the questions, the player can get different value of money.&#10;3. When the player lands on Angel chevron, then he/she can get two lifesaver cards&#10;4. When the player lands on Evil chevron, he/she will lose one lifesaver card&#10;General Rules&#10;1. Each player gets 40$ at the beginning of the game.&#10;2. Each player rolls the dice once; the player who rolls the highest goes first by rolling it again.&#10;3. Each time every player should follow the words in the chevron she/he lands on to know how many&#10;chevrons they will move forward or backward.&#10;4. When the player lands on a question chevron, he/she should answer the question. If the answer is&#10;right within one minute, the player can get cash. If answer is wrong or the player cannot answer it&#10;within one minute, he/she could choose to use his/her lifesaver cards if he/she has one. But&#10;lifesaver cards can only be used up to five times for each player. If the player has used up their&#10;lifesaver cards, he/she should quit the game. However, each time the players can choose not to&#10;answer the question by paying the same amount of dollar as they can get if the answer is right.&#10;5. If the player lands on the Angel chevron, he/she will get two lifesaver cards; if lands on the Evil&#10;chevron, he/she will lose one lifesaver card.&#10;6. If a player is leading by 10 chevrons, then he/she could challenge the opponent with his own&#10;question which is related to Bible. If the opponent wins the challenge, then he/she can move&#10;forward 2 steps. He/she has to back up three steps if he/she loses.&#10;7. The player reaches the destination first wins!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":45,"minAge":18,"categoriesAndMechanics":["Educational","Mature / Adult","Religious","Trivia","Dice Rolling"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/toVKPr-48k51k3JpYLXriw__thumb/img/SttO5mf8aMPk0xID-yCOc5LCtC4=/fit-in/200x150/filters:strip_icc()/pic656911.jpg","urlImage":"https://cf.geekdo-images.com/toVKPr-48k51k3JpYLXriw__original/img/_hGjM5zvL9QfEqfpOX0tZdI1Kzk=/0x0/filters:format(jpeg)/pic656911.jpg"},{"bggId":"65751","name":"Pass the Class","description":"Object of the Game&#10;&#10;The game goal is to pass all four grades and get to college first!&#10;&#10;The Rules&#10;&#10;1/ The object of the game is to get to &quot;college&quot; first with a&#10;report card from each of the four English catagories from each&#10;grade 9-12.&#10;&#10;2/ Players can earn a report card by successfully answering a&#10;question from that catagory after landing on the corresponding space.&#10;&#10;3/ Players can move backwards or forward, but must move the total&#10;amount of spaces rolled on the die.&#10;&#10;4/ If a player gets a question correct, he or she may continue with&#10;another roll or more until he or she gets an answer incorrect or&#10;lands in detention.&#10;&#10;5/ If sent to detention, a player looses a turn.&#10;&#10;6/ After a player rolls out of detention, he or she can reenter anywhere in that grade level.&#10;&#10;7/ A player may, at any time, forfeit a turn to go to summer school&#10;in lieu of trying to pass a English catagory. In summer&#10;school, the player has the freedom to choose the English catagory&#10;that the question comes from.&#10;&#10;8/A player may only go to summer school to make up for one subject for each grade.&#10;&#10;9/In order to pass a grade, the player does not have to &quot;land&quot; on the finals space. Instead, the player can simply turn in 4 earned report cards to pass onto summer vacation and the next grade as he or she passes the finals space. In other words, a player cannot pass a grade level until he or she has earned three report cards.&#10;&#10;10/ If a player lands on an office card, an office card is drawn and&#10;directions are to be followed.&#10;&#10;11/ If a player lands on a library card, a library card is drawn&#10;and directions are to be followed.&#10;&#10;12/ If a player get an answer incorrect, the player to the left may&#10;at anytime &quot;steal&quot; the question and potentially earn that report card.&#10;&#10;13/ A peek pass may turn a question into multiple choice at any time. Each player has two peek passes at the start of the game. After the peek pass is used, the player must hand in that pass.&#10;&#10;14/ When a player answers a question correctly, he or she keeps that card as their report card.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":60,"minAge":14,"categoriesAndMechanics":["Educational","Trivia","Dice Rolling"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/yEzG-cpgRUWstDyzQOuztA__thumb/img/PWKM2nJKyZvJlw6yPT82Y9IEkLs=/fit-in/200x150/filters:strip_icc()/pic656930.jpg","urlImage":"https://cf.geekdo-images.com/yEzG-cpgRUWstDyzQOuztA__original/img/1y-043aqEYchyoebUoQAubsr4-Q=/0x0/filters:format(jpeg)/pic656930.jpg"},{"bggId":"65757","name":"Vorsicht, kleiner Pirat","description":"As the title suggests Vorsicht, kleiner Pirat deals with water, boats and pirates.  The publisher calls the game &quot;A dice-throwing game with a surprise.&quot; The goal of the game is to bring three of your pirates first onto the island. The board is a rondel of sorts, that is moved according to the die throw. The moving rondel can also push the boats into shallow water or even swallow he pirates into the depth of the sea. The players decide whether they stay in their pirate boat or prefer to move into another boat of their own color.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":15,"minAge":4,"categoriesAndMechanics":["Children's Game","Nautical","Pirates","Roll / Spin and Move"],"rating":2.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/j2gvIpH1_qf9tQTv80EaIw__thumb/img/So9TXxois119NRUzjNEiDnkw-ss=/fit-in/200x150/filters:strip_icc()/pic5033188.jpg","urlImage":"https://cf.geekdo-images.com/j2gvIpH1_qf9tQTv80EaIw__original/img/aaD3xH7Hn056AoOnNwhENozJzv4=/0x0/filters:format(jpeg)/pic5033188.jpg"},{"bggId":"65760","name":"Trivia Junior Russia","description":"Russia trivia game now has a junior version. Packed with 1500 fun questions that every child should know about the their country &ndash; music, sport, geography, nature, culture and much more&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Children's Game","Trivia","Dice Rolling","Roll / Spin and Move"],"rating":3.25,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/XFESIoS_bLS6ruI5JV-FpQ__thumb/img/zVdSeGkl3cre5ijZ-2fHAcev3RA=/fit-in/200x150/filters:strip_icc()/pic656935.jpg","urlImage":"https://cf.geekdo-images.com/XFESIoS_bLS6ruI5JV-FpQ__original/img/ppGsjOFYPWXk0oMyhmMrQPj4GZo=/0x0/filters:format(jpeg)/pic656935.jpg"},{"bggId":"65761","name":"Lerne Bayern kennen","description":"This is a trivia game about the German federal state of Bavaria.&#10;&#10;Players roll a die, move around the trails on the board across Bavaria and answer questions about the state. The first one to make it back to the starting space after collecting 8 cards from the different Bavarian regions and answering a final question corretly wins.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":60,"maxPlayTime":60,"minAge":0,"categoriesAndMechanics":["Educational","Political","Trivia","Open Drafting","Roll / Spin and Move"],"rating":2.55,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/16gktu_MrJDNE151HKWl2g__thumb/img/FKau24wlOYzXUjHBZyeWhC9rKNk=/fit-in/200x150/filters:strip_icc()/pic655260.jpg","urlImage":"https://cf.geekdo-images.com/16gktu_MrJDNE151HKWl2g__original/img/CvEiXUKYcYq579YkUXn_NQj6NHQ=/0x0/filters:format(jpeg)/pic655260.jpg"},{"bggId":"65762","name":"Trivia Junior Russia","description":"Lively and exciting game for kids who love quiz - now in pocket size! The game consists of 600 questions in six categories: Music, Sports &amp; Games, Geography, Nature, Culture (TV shows, movies, literature), and Miscellaneous. Answer the questions and cross out 5 circles-categories with one side of the pyramid. If you are the first to correctly answer the last question, you - the are the winner!&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Children's Game","Educational","Travel","Trivia","Dice Rolling","Roll / Spin and Move"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/_YbgE31WqY3mX86i7mOFPg__thumb/img/pQPRnO7v1H4t-kMW06SXVo46mAM=/fit-in/200x150/filters:strip_icc()/pic656936.jpg","urlImage":"https://cf.geekdo-images.com/_YbgE31WqY3mX86i7mOFPg__original/img/bfG1Tnwm6dCB6DjoXqA6rv62xIs=/0x0/filters:format(jpeg)/pic656936.jpg"},{"bggId":"65763","name":"Russia: What Do You Know About It?","description":"Game &quot;Russia: what do you know about it?&quot; Consists of 2400 interesting questions about Russia and Russian people. Issues are distributed in six different disciplines: history, culture, science, geography, sports and general knowledge. During the game you learn more about their country. You also do not interfere with luck, to win this game!&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":45,"maxPlayTime":45,"minAge":12,"categoriesAndMechanics":["Educational","Trivia","Dice Rolling","Roll / Spin and Move"],"rating":2.805555,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/H3aVI6WvnVOL1H93f7NAww__thumb/img/mzS7oDdKfHSezkPMNcWuDvRhW-Q=/fit-in/200x150/filters:strip_icc()/pic656937.jpg","urlImage":"https://cf.geekdo-images.com/H3aVI6WvnVOL1H93f7NAww__original/img/TU-EXABttntx58rHXeGqBYuYcgE=/0x0/filters:format(jpeg)/pic656937.jpg"}]