[{"bggId":"130048","name":"Activity: Gold Edition","description":"Anniversary edition of Activity celebrating the 175 years of Piatnik. &#10;A combination of the best ideas of different editions of Activity with many new terms, new and non-traditional tasks and containing also some rules changes and special gold cards with famous sayings and phrases.&#10;&#10;Teams move on the board, draw cards and using pantomime, drawing etc. according the description of the cards. If teammates guess Your action You collect the card as a point. If team lands same space with opponent&acute;s pawn - they must move one space back unless they have not collected any gold cards.&#10;&#10;","minPlayers":3,"maxPlayers":16,"minPlayTime":90,"maxPlayTime":90,"minAge":12,"categoriesAndMechanics":["Card Game","Party Game","Acting","Dice Rolling","Line Drawing","Team-Based Game"],"rating":3.01515,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/PMgcOyRK6XVYnB1MFuhZEw__thumb/img/4PuGmZpC-8Lzl58glxKZPto7OXc=/fit-in/200x150/filters:strip_icc()/pic2243901.jpg","urlImage":"https://cf.geekdo-images.com/PMgcOyRK6XVYnB1MFuhZEw__original/img/IlUnGRegxx7ubEd-eo9253n6DoE=/0x0/filters:format(jpeg)/pic2243901.jpg"},{"bggId":"277083","name":"Black Stories Junior: Rainbow Stories","description":"The successful mystery series &quot;Black Stories&quot; is also available in the &quot;scary-free&quot; version - for families with children from 8 years old. Instead of dark and scary it gets colorful and funny at the &quot;Black Stories Junior&quot;. The colors represent the locations where the junior mystery stories play.&#10;&#10;Rainbow Stories are riddles for children full of magic. The players try to reconstruct the sparcling secrets by asking, guessing and fiddling about.&#10;&#10;","minPlayers":2,"maxPlayers":99,"minPlayTime":2,"maxPlayTime":222,"minAge":8,"categoriesAndMechanics":["Children's Game","Fantasy","Party Game","Storytelling"],"rating":3.085715,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/garP0lF1cgxpeQA0AyTJkg__thumb/img/arV0oDFRcR3kFS0l2h1ZrHBlXzE=/fit-in/200x150/filters:strip_icc()/pic4677518.jpg","urlImage":"https://cf.geekdo-images.com/garP0lF1cgxpeQA0AyTJkg__original/img/ZUz-l7KZHG4roQTOhhVX1trdPQE=/0x0/filters:format(jpeg)/pic4677518.jpg"},{"bggId":"27857","name":"Blindside","description":"Blindside is a pure strategy game for two players, with each trying to capture the opponent's movement arrows.&#10;&#10;Each player starts the game with seven hexagonal pieces, with 2-5 movement arrows on each piece (23 total movement arrows). On a turn, a player moves one piece in a direction matching one of the movement arrows on that piece, with the maximum distance moved being equal to the number of arrows on that piece.&#10;&#10;The blue pivot spaces on the game board allow for tricky plays. If a player moves a piece onto one of these spaces, he can rotate that piece, allowing it to move in any direction for the remainder of its movement. For example, if you're one space away from a pivot with a piece that has three arrows (and is pointing at the pivot), you can move one space onto the pivot, rotate your piece, then move the remaining one or two spaces in any direction now indicated by the piece's arrows.&#10;&#10;You capture movement arrows two ways:&#10;&#10;&bull; Land on an opponent's piece, and you remove a movement arrow of your choice, then place that piece on an unoccupied blue pivot space in any direction you wish.&#10;&bull; Jump an opponent's piece, then remove the one or two arrows on that piece that are parallel to your direction of movement.&#10;&#10;You win by being the first player to capture 17 of your opponent's movement arrows.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":25,"maxPlayTime":25,"minAge":10,"categoriesAndMechanics":["Abstract Strategy","Modular Board","Tile Placement"],"rating":2.90588,"complexity":2.5,"urlThumb":"https://cf.geekdo-images.com/6OQklNYVZWjjSMztlL3piw__thumb/img/uKsnFvBBUSrGB96s4Z6n2m20Rt4=/fit-in/200x150/filters:strip_icc()/pic1060218.jpg","urlImage":"https://cf.geekdo-images.com/6OQklNYVZWjjSMztlL3piw__original/img/eevU3Y5VJHsI7zru_9tL6ZsqVOg=/0x0/filters:format(jpeg)/pic1060218.jpg"},{"bggId":"2657","name":"Auweier","description":"From the rule book:&#10;&#10;&quot;Egg On - A mating game for screwy birds&#10;&#10;In this game, the players slip on the feathers of a male bird. Through the use of bridal gifts (worms) they try to convince the stunning females (in the middle of the table) that they would be the best fathers for their eggs. During the course of the game, the males try to mate with the females in order to achieve paternity over certain eggs. However, not all the eggs are equally valuable. The first egg in a nest scores fewer points than the third. Also, there are females who are better suited for mating (they have matching color) and their eggs thus earn a bonus.&#10;The King of the Nest will, without a doubt, be the one who manages to mate with all the females, i.e. to collect eggs in all the colors.&quot;&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":12,"categoriesAndMechanics":["Animals","Card Game","Betting and Bluffing"],"rating":2.92552,"complexity":1.8571,"urlThumb":"https://cf.geekdo-images.com/guTa2O_hOBJlBe7D55kVtQ__thumb/img/OL6EmEmxHv3Yqzw1lGZCaSvflZk=/fit-in/200x150/filters:strip_icc()/pic202838.jpg","urlImage":"https://cf.geekdo-images.com/guTa2O_hOBJlBe7D55kVtQ__original/img/ftCnCLYi8JN-D70IvqGte-LqwQs=/0x0/filters:format(jpeg)/pic202838.jpg"},{"bggId":"178229","name":"Adventure Time: Adventures in the Land of Ooo","description":"Are you ready to live exciting adventures in the Land of Ooo?  Do you want to be in Finn&rsquo;s, Jake&rsquo;s, or in any of their good friend&rsquo;s skin? Do you want to discover the mysteries of this magical world? Then Adventures in the Land of Ooo is the game for you!  Have fun with the characters and situations of the Adventure Times show in this fun, family board game.  Explore dangerous dungeons to obtain the Crystal Eye, face powerful wizards, or have a great dance with Death until the Peppermint Butler arrives.&#10;&#10;Play with the characters from the show, like Finn, Jake or Marceline, exploring around the game board. Collect cards and objects to overcome the challenges and enemies they will have to face along the way.  Finally, achieve the objective of the mission before the rest of the players to win the game...&#10;You will have a mathematical time!&#10;&#10;The basic game set comes with two missions, inspired on episodes from the show: &quot;The Dungeon&quot; and &quot;Wizard Battle&quot;, each with their own objectives and special rules.&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":60,"maxPlayTime":90,"minAge":8,"categoriesAndMechanics":["Adventure","Exploration","Fantasy","Movies / TV / Radio theme","Hand Management","Open Drafting","Point to Point Movement","Take That","Variable Player Powers"],"rating":3.0625,"complexity":1.5,"urlThumb":"https://cf.geekdo-images.com/RLs_G0owaifH8k3BUPlobw__thumb/img/DluBgcbTh8uONgUpiHXd3CnPGiQ=/fit-in/200x150/filters:strip_icc()/pic2531653.png","urlImage":"https://cf.geekdo-images.com/RLs_G0owaifH8k3BUPlobw__original/img/qSUqlThuXV2QicHQjUjQmMaM_jQ=/0x0/filters:format(png)/pic2531653.png"},{"bggId":"25988","name":"Asalto","description":"This game evolved from (or alongside) Fox &amp; Geese and seems to have appeared first in Germany at least as early as 1803, where it has been known as Belagerungsspiel (Siege Game) or Festungsspiel (Fortress Game.)  In English speaking countries it was published as Siege, or German Tactics. In France it was published in 1855 as Assault. In Italy it is called Assalto, Assalto al Fortino, Assedio di Sebastopoli, and Citadel. Since it is played on essentially a Fox &amp; Geese board with additional markings and pieces, it was often included in a set with rules for Fox &amp; Geese and Solitaire.  The markings outline one nine-point side of the cross as a distinct fortress or castle, typically in a different color from the rest of the board's points.  Also, the horizontal lines of the board are in a different color than the rest, but for the few closest to the fortress.  This is to indicate where the attacker may not move; in some editions these markings are absent and instead simply described by the player's rules of movement.&#10;&#10;The defending player has two pieces in the fortress, either on specific starting points or anywhere the player chooses, depending on the included rules.  The other player has twenty-four pieces, one on each of the board's remaining points.  The goal for the attacking player is to occupy all nine of the fortress points with one of his pieces.  The goal for the defending player is to reduce the attacker to eight pieces, thereby preventing occupation of the fortress.&#10;&#10;Attackers may move along the vertical or diagonal lines towards the fortress only, except on the few marked horizontal lines near the fortress.  They may not jump or capture any pieces.  The defenders may move in any direction along any line, and may capture (remove from the board) an attacker's piece by jumping over it to a vacant opposite point.&#10;&#10;Siege evolved further into a larger edition with a sixty-seven point board, seventeen points for the fortress (and three defending pieces) and fifty points for the attackers.  Sometimes published in Germany and continental Europe as Neues Belagerungsspiel (New Siege Game) or Grosses Festungs-Spiel (Big Fortress Game,) it was known in English-speaking countries as The Royal Garrison Game and has been published under many other names since then.&#10;&#10;Examples of books or game compilations containing Asalto, &#10;e.g :  &#10;'The Boardgame Book&#10;'The Book of Classic Board Games&#10;or&#10;'Medito&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":20,"minAge":10,"categoriesAndMechanics":["Abstract Strategy","Wargame","Grid Movement","Point to Point Movement"],"rating":2.9147,"complexity":1.6667,"urlThumb":"https://cf.geekdo-images.com/BwPcb23B1jszEtMCtAJtjA__thumb/img/L8sIBg2PWMlwNkHZF2UuzU6lhgc=/fit-in/200x150/filters:strip_icc()/pic1316773.jpg","urlImage":"https://cf.geekdo-images.com/BwPcb23B1jszEtMCtAJtjA__original/img/VneyEmin7PSsr4D9bukmBbaB1bs=/0x0/filters:format(jpeg)/pic1316773.jpg"},{"bggId":"21275","name":"Outburst: Travel Edition","description":"Now experience Outburst! fun anywhere you go!  Outburst Travel Edition offers all the original uproarious game play in a handy take-along design.&#10;&#10;Just as in the original Outburst! games, teams have 60 seconds to yell out answers that fit familiar categories.  Teams may shout out as many answers as possible, but only the 10 answers that appear on the Topic Card will score points.&#10;&#10;This pocket-size versions includes a 60-second Timer, Viewer/Card Holder containing 160 Common-Knowledge Topics, Scoreboard and Market.&#10;&#10;Outburst Travel Edition is as easy as it is fun.  Try it - Can you name &quot;10 Annoying Things That Other Drivers Do?&quot;  You have one minute, go!&#10;&#10;","minPlayers":2,"maxPlayers":99,"minPlayTime":60,"maxPlayTime":60,"minAge":7,"categoriesAndMechanics":["Party Game","Trivia"],"rating":3.01071,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/xyTI_nma9orbHrOaZpoiJg__thumb/img/rE3g4EBz1nPkbADIO2u2PefsrvI=/fit-in/200x150/filters:strip_icc()/pic236620.jpg","urlImage":"https://cf.geekdo-images.com/xyTI_nma9orbHrOaZpoiJg__original/img/v0wMbWndBHXWUHi91efAM4jTeKw=/0x0/filters:format(jpeg)/pic236620.jpg"},{"bggId":"151215","name":"Cat & Chocolate: Business Is Business","description":"Cat &amp; Chocolate: Business Is Business can be played as a standalone game or combined with Cat &amp; Chocolate. Instead of the original game's haunted mansion theme, Business Is Business revolves around wacky situations that arise from a life in the corporate world.&#10;&#10;Each turn, the player draws an event and tells the story of how she would avoid disaster with up to 1-3 item cards in her hand. Whether it's &quot;stomachache in the middle of a presentation&quot; or &quot;your boss's wig is off-center&quot;, what will you do when you have only sushi or a self-enrichment book? It's a test of the player's imagination and life experience!&#10;&#10;Should your story be accepted by at least half of the other players, you get to keep the event card and play continues until a special event card called &quot;End!&quot; is revealed. Whoever has scored the most event cards wins.&#10;&#10;","minPlayers":3,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":20,"minAge":8,"categoriesAndMechanics":["Card Game","Humor","Storytelling","Team-Based Game","Voting"],"rating":2.95196,"complexity":1.25,"urlThumb":"https://cf.geekdo-images.com/Arho77B3baBRW6w1djd34w__thumb/img/Zbp2osxic8X0vkxpaTh8kTb2_sY=/fit-in/200x150/filters:strip_icc()/pic900203.jpg","urlImage":"https://cf.geekdo-images.com/Arho77B3baBRW6w1djd34w__original/img/ovd-r-InEjDXXqaTneK9NGVtfHw=/0x0/filters:format(jpeg)/pic900203.jpg"},{"bggId":"153484","name":"Hedbanz Act Up!","description":"In Hedbanz Act Up, each player wears a head band that holds a card over your forehead.  You must try and guess what's on your card based on the clues given to you by the other players.  The catch is that the other players can only give you clues through pantomime (as in charades).  If you guess correctly, both you and the player acting out the clue score.  Guess as many cards as you can within the time limit.  The first player to get rid of all of his or her scoring chips wins the game.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Deduction","Party Game","Acting"],"rating":2.96078,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/g6b_yr3cqN3e4Q_b6OXh2g__thumb/img/nYj7Y8y63Gf6Poi4OKEei-qKFSs=/fit-in/200x150/filters:strip_icc()/pic2234594.jpg","urlImage":"https://cf.geekdo-images.com/g6b_yr3cqN3e4Q_b6OXh2g__original/img/IoNsrARgUoQ5lASHUcGK1m_UqzU=/0x0/filters:format(jpeg)/pic2234594.jpg"},{"bggId":"4239","name":"Korea: The Mobile War 1950-51","description":"KOREA is a division level game of the police action during 1950 and 51.&#10;&#10;3 scenarios: &#10;1) The 17 turn Invasion Scenario (North Korea invades the South)&#10;2) The 9 turn Intervention Scenario (Chinese forces attack overextended U.N. units occupying North Korea)&#10;3) The 21 turn Stalemate Scenario (U.N. forces gradually grind the Communists back toward the 38th parallel)&#10;&#10;255 Counters&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":120,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Korean War","Modern Warfare","Wargame","Dice Rolling","Hexagon Grid"],"rating":2.902205,"complexity":2.7059,"urlThumb":"https://cf.geekdo-images.com/crx3aQTFjPpa-kIQzB772g__thumb/img/QrYSHiiKQJY0C8EGHYHqmm2sve8=/fit-in/200x150/filters:strip_icc()/pic5440932.jpg","urlImage":"https://cf.geekdo-images.com/crx3aQTFjPpa-kIQzB772g__original/img/coXaR9Iod9vj3sud4sa1Gr_f-cI=/0x0/filters:format(jpeg)/pic5440932.jpg"},{"bggId":"207063","name":"Donkey Derby","description":"In the race game Donkey Derby, each player moves each of the five donkeys. Players bet on the future winner. If you make the right bet early, you'll get many victory points in the end. Bet later, and you can better estimate the finish and get points more safely. But the die plays a role as well: Should I advance my favorite with the &quot;3&quot; I've rolled, or should I try to roll a higher number? If my luck with the die doesn't meet my calculations, the malicious joy of the other players is guaranteed.&#10;&#10;When the first three donkeys have crossed the finish line, the player with the most points wins.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":25,"maxPlayTime":35,"minAge":9,"categoriesAndMechanics":["Racing","Betting and Bluffing","Dice Rolling"],"rating":3.04878,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/P-weSzEdrl5o_vMRm0kvwQ__thumb/img/qdK3FJfokeYjtUhsna4VENeAfhw=/fit-in/200x150/filters:strip_icc()/pic3143361.jpg","urlImage":"https://cf.geekdo-images.com/P-weSzEdrl5o_vMRm0kvwQ__original/img/FmTHC5jdXerI-fTIJ3zZLdWwWRY=/0x0/filters:format(jpeg)/pic3143361.jpg"},{"bggId":"5216","name":"Space Master: Star Strike","description":"From the box:&#10;&#10;Starcraft Combat in the Far Future&#10;&#10;Iron Crown Enterprises presents Space Master: Star Strike, a fast-paced boardgame of starcraft combat in the far future. Simulate deep-space battles involving any number of vessels. Dogfight with small but lethal SMAC fighters or deploy Line Cuisers to slug it out with a death dealing Dreadnought.&#10;&#10;Expanded by:&#10;&#10;    Star Strike Vessel Compendium #1: Adventurer Class&#10;    Star Strike Vessel Compendium #2: Pursuit Class&#10;    Star Strike Vessel Compendium #3: Imperial Ships&#10;&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":120,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Fighting","Science Fiction","Wargame","Hexagon Grid"],"rating":2.99359,"complexity":2.8,"urlThumb":"https://cf.geekdo-images.com/a_VnBCgr0T90Fdfs2N1n_Q__thumb/img/yDMkYKb9rsAsQJNpQ-C6SYosy3Y=/fit-in/200x150/filters:strip_icc()/pic105114.jpg","urlImage":"https://cf.geekdo-images.com/a_VnBCgr0T90Fdfs2N1n_Q__original/img/ajxbNI_PP2xEFTJicZtwczm1kQs=/0x0/filters:format(jpeg)/pic105114.jpg"},{"bggId":"211882","name":"Beyond the Gates of Antares: The Dice Game","description":"The ancient Gates of Antares link or isolate worlds across countless galaxies. The evolved panhuman races wage unending war to control the Gates and the undiscovered systems beyond.&#10;&#10;Take on the battling forces of the Concord IMTel, the symbiotic Isorians, the bio-adapted Boromites, the twisted Ghar Empire or the warlike Algoryn Prosperate to claim control of the Gates that lead to new planetary systems to trade and colonise.&#10;&#10;With each faction bringing a unique twist to the otherwise simple rules, roll the Skirmish dice to score victories on your campaign and claim the Gate. Each player&rsquo;s round represents a military offensive that will give the chance for scoring victories, but be aware of the Fate dice opponents will play against you as they can twist your results and turn a clear victory into a total failure!&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":10,"maxPlayTime":20,"minAge":8,"categoriesAndMechanics":["Dice","Science Fiction","Dice Rolling","Take That"],"rating":2.92976,"complexity":1.4,"urlThumb":"https://cf.geekdo-images.com/QBEtKCjUV_BzjORrEvS9Qg__thumb/img/sYWCEdXulkcGnuH7VcrUjgyRSw4=/fit-in/200x150/filters:strip_icc()/pic3428886.jpg","urlImage":"https://cf.geekdo-images.com/QBEtKCjUV_BzjORrEvS9Qg__original/img/3UgiSeO0GBImQWNGevPSkjk8xNI=/0x0/filters:format(jpeg)/pic3428886.jpg"},{"bggId":"3360","name":"Lexicon","description":"There are several game variations in the rule book, Crossword Lexicon, Lexicon, and Lexicon Solitaire.&#10;&#10;Quoted from the Rules for Crossword Lexicon, Copyright 1937, Parker Brothers, Inc. ... &quot;Each player, by playing his cards to the Crossword layout in the center of the table, tries to play out their whole hand before any other player succeeds in doing so. Cards left in players' hands at the end of play in each deal are counted against them and the low score wins the game. As soon as one player reaches 100 points, the game ends and the player with the lowest score wins.&#10;&#10;The player at the left of the dealer starts by placing any word of not less than two or more than four letters in the center of the table, naming the words as they play it. After the first player, all following must play to the words already formed on the table. If the first player (or any subsequent player) cannot form a complete word, they discard one card from their hand and take in exchange either the exposed card, or the top Blind card, from one of the piles on the table. Before taking from the Blind pile, the player must always discard first.&quot;&#10;&#10;There are several game variations in the rule book, Crossword Lexicon, Lexicon, Lexicon Solitaire and several different options for these card games that can be played with this deck.&#10;&#10;Also, at the bottom of one of the pages is, ...&#10;&#10;&quot;A double set of Crossword LEXICON is made containing two complete packs with Red and Blue backs respectively. Price $1.00&quot;&#10;&#10;(Remember the year, 1937, a buck was a lot of money back then, at least I have been told.)&#10;&#10;The newer deck has 54 cards: Ax4 Bx1 Cx2 Dx1 Ex5 Fx1 Gx2 Hx2 Ix3 Jx1 Kx1 Lx3 Mx2 Nx2 Ox3 Px1 Qx1 Rx3 Sx3 Tx3 Ux2 Vx1 Wx2 Xx1 Yx1 Zx1 Masterx2&#10;&#10;The older deck has 52 cards: Ax4 Bx1 Cx1 Dx1 Ex4 Fx1 Gx1 Hx3 Ix4 Jx1 Kx1 Lx3 Mx1 Nx1 Ox3 Px1 Qx1 Rx3 Sx3 Tx3 Ux3 Vx1 Wx3 Xx1 Yx1 Zx1 Masterx1&#10;&#10;i.e. the deck of 54 has:&#10;C+1, E+1, G+1, M+1, N+1, Master+1, Hx1, Ix1, Ux1, Wx1 &#10;compared to the deck of 52&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Card Game","Game System","Word Game"],"rating":2.84291,"complexity":1.4545,"urlThumb":"https://cf.geekdo-images.com/bM4oLKXoVNWNyiuruzGOSA__thumb/img/JuVeK_X8UY92I6IVdASVWfA42fA=/fit-in/200x150/filters:strip_icc()/pic2002656.jpg","urlImage":"https://cf.geekdo-images.com/bM4oLKXoVNWNyiuruzGOSA__original/img/T7ESjR_TGDfgyTVL9texAKh4Bz4=/0x0/filters:format(jpeg)/pic2002656.jpg"},{"bggId":"213544","name":"Wordoku: Fun Spelled Out","description":"Description from the publisher:&#10;&#10;Wordoku is a combination crossword-sudoku word game for one to six players. In the game, players race to create words and earn points using wooden letter tiles on a 4x4 grid, while skillfully incorporating all the tile symbols to double word values! The game is played over three rounds in which players earn awards for scoring the highest number of points -- and for improving their personal high scores between rounds!  The player with the most award tokens after three rounds wins! Wordoku is easy to learn but challenging to master - it's Fun Spelled Out!&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":30,"minAge":12,"categoriesAndMechanics":["Word Game","Tile Placement"],"rating":2.964585,"complexity":1.5,"urlThumb":"https://cf.geekdo-images.com/01kMLfa-FFAZ7ti2hQ6PIQ__thumb/img/37yobIsU5wSpsW_A_-QcaAe9yq8=/fit-in/200x150/filters:strip_icc()/pic3639115.png","urlImage":"https://cf.geekdo-images.com/01kMLfa-FFAZ7ti2hQ6PIQ__original/img/_kHFO27DHbYZNe7QKtLnufrc9do=/0x0/filters:format(png)/pic3639115.png"},{"bggId":"2558","name":"Comeback","description":"Another in the line of very small card games by Reinhard Staupe. The deck consists of four suits of cards numbered 1 to 7. The 1s have three stars, the 2s have two stars and all other cards have one star. Players start with 150 points (which serves as a starting score and a money pool for bidding). For 2 players, use 16 cards, for 3 players use 21 cards, for 4 players use 24 cards (so that players do not know which cards are in play) and these are auctioned off one at a time. Bid increments must be at least as great as the number of the card being auctioned but can be more - i.e. while bidding on a card with the number 4, a bid of four would require a bid of 8 or more from the next bidder). The first bid can be lower, the same or higher than the number of the card.  Bidding goes clockwise around the table.  First bid also moves clockwise around the table. When all cards have been auctioned, suits are scored separately for each player by adding the card numbers and multiplying that figure by the total number of stars in the suit. Scores for each suit are added to any remaining points from a players' starting pool (points remaining from the original pool of 150) to determine the final score. Comeback was nominated for Spiel des Jahres in Germany in 1997.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":20,"minAge":9,"categoriesAndMechanics":["Card Game","Auction/Bidding"],"rating":2.920455,"complexity":1.6,"urlThumb":"https://cf.geekdo-images.com/xIloQI5j1qDsgzqcdQH_3Q__thumb/img/FlvTHJw7WRqmzcfRyAeHrDgpjNg=/fit-in/200x150/filters:strip_icc()/pic697416.jpg","urlImage":"https://cf.geekdo-images.com/xIloQI5j1qDsgzqcdQH_3Q__original/img/AfPg205huaneP5ShmFSZ4lrsACA=/0x0/filters:format(jpeg)/pic697416.jpg"},{"bggId":"148260","name":"Leonardo","description":"Vinci, late 15th century: Someday Leonardo will become the great inventor and painter that we know so well today, but right now he is a young, exuberant, and inventive boy. He is always inventing the most incredible creations just by observing the world around him.&#10;&#10;In Leonardo, players must collect inventions, gathering the right materials (i.e., cards) for each one. Each invention has a point value based on how complex it is and based on the required materials. Before starting the game, place six collection cards and three invention cards on the matching spaces on the game board. Place the three stand-up character pawns on the correct positions around the invention cards. All players share these characters and can use any of them that they want each turn.&#10;&#10;On a turn, each player simultaneously reveals one of three character cards and one of three movement cards. The first player moves his chosen character clockwise around the circle the number of spaces shown on his movement card, then:&#10;&#10;&#10;    If no cards are on the space, his turn ends;&#10;    If a collection card is on the space, he places it face up in front of him;&#10;    If an invention card is there and he has all of the required materials, he can take that card and the matching invention pawn; or&#10;    If a painting card is there, he plays it immediately, gaining that card's special effect (take an extra turn, steal a player's material card, etc.)&#10;&#10;&#10;The remaining players take their turns in clockwise order in the same manner, then the player to the left of the first player becomes the first player for the next turn.&#10;&#10;If no invention or collection cards are available to fill spaces on the board, the game ends immediately. Players score points equal to the value of their inventions, plus 1 point for each material card they still have. The player with the highest score wins!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Renaissance","Set Collection"],"rating":2.98226,"complexity":1.3333,"urlThumb":"https://cf.geekdo-images.com/MeyBh2xa9FqlBUmPY_yq4Q__thumb/img/t04Arwh_w6wzISBUlwwZdwxMnLs=/fit-in/200x150/filters:strip_icc()/pic1788457.png","urlImage":"https://cf.geekdo-images.com/MeyBh2xa9FqlBUmPY_yq4Q__original/img/Mvqnmbjy1C4rndSGOnr9skg4Vn0=/0x0/filters:format(png)/pic1788457.png"},{"bggId":"4516","name":"Ragnarok: The Twilight of the Gods","description":"Ragnarok: The Twilight of the Gods is a game depicting the struggle of the Aesir race of Norse gods against an invasion of enemies led by the traitorous god, Loki. The map depicts the Plain of Vigrid, lying between the Rainbow Bridge and the city of the gods, Asgard, where the battle takes place, and the playing pieces represent warriors, Valkyries, Frost Giants, Fire Giants, and such celebrated individuals as Odin, Thor, Loki, and the Midgard Serpent. Each player maneuvers his forces across the map in an effort to fulfill his victory conditions. To win, the player commanding the invading Jotun forces must destroy Asgard, thus bringing about Ragnarok, the twilight of the gods. The Aesir player must repel the Jotun invasion to win, thus postponing Asgard's fall.&#10;&#10;Originally published in Ares Magazine #8 May 1981&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":120,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Fantasy","Mythology","Wargame","Hexagon Grid"],"rating":2.876145,"complexity":2.4615,"urlThumb":"https://cf.geekdo-images.com/qmQ8-hiC1LAr0-4fzK8oYA__thumb/img/aqdXa8Xl9GQZQkUhAKl4PRqHH-I=/fit-in/200x150/filters:strip_icc()/pic65298.jpg","urlImage":"https://cf.geekdo-images.com/qmQ8-hiC1LAr0-4fzK8oYA__original/img/FnryQFUuE1uFUYu6SbNtsfj3ll8=/0x0/filters:format(jpeg)/pic65298.jpg"},{"bggId":"73252","name":"Marengo: Morning Defeat, Afternoon Victory","description":"From the Decision Games' website:&#10;&#10;The Napoleon at War classics are being updated to a brigade-level system with artillery largely in separate units.&#10;&#10;After crossing the Alps in 1800 and advancing into northern Italy, Napoleon overextended his army in an attempt to ambush a portion of the Austrian army. Misreading the situation, the hunter became the hunted when the main Austrian army in Italy, over 30,000 soldiers with 100 cannon, advanced against Napoleon's 18,000 troops and dozen cannon on the Marengo plain. Perceiving the danger, Napoleon urgently summoned his reserves and wayward detachments, bringing his strength up to near parity with the Austrians. It was just enough to forge victory from a potential disaster.&#10;&#10;Marengo utilizes the all-new Musket &amp; Saber combat system, which provides a simple yet accurate portrayal of Napoleonic warfare. The combat system is intuitive, including all the details that characterized battle during the Napoleonic era while also simulating the unique aspects of 19th century warfare. Units can become weakened and rout; attackers can pursue, and the fortunes of war can intervene at any time. Cavalry can rip open enemy lines and shred fleeing units, while reserves must be ready to plug holes or secure the line of retreat.&#10;&#10;A new Combat Results Table emphasizes playability while also simulating the lethality of musket and bayonet engagements of that era. Leaders accelerate the action, replicating the importance of their presence during battle. Supply trains and headquarters help armies function smoothly, forcing players to protect their logistical base. Winning a battle will depend on deployment, maneuver and massing firepower, as well as understanding the strengths and weaknesses of each particular army.&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Napoleonic","Wargame","Dice Rolling","Grid Movement","Hexagon Grid","Simulation"],"rating":2.975,"complexity":2.8,"urlThumb":"https://cf.geekdo-images.com/YVZXOawaNM6W1VaxxJcwgA__thumb/img/dzRIwhgfKhs99t4ntPovgHtdwHg=/fit-in/200x150/filters:strip_icc()/pic748978.jpg","urlImage":"https://cf.geekdo-images.com/YVZXOawaNM6W1VaxxJcwgA__original/img/NZSlRy4Dm9FnA3rZwtdsi_vZ7tk=/0x0/filters:format(jpeg)/pic748978.jpg"},{"bggId":"307772","name":"Gelatinous","description":"Be the biggest ooze . . . or lose!&#10;&#10;In Gelatinous, players start out as a wandering slime, using sparkling green dice to grow into a cube. But watch out, the other slimes are growing too! The first to grow into a cube wins &ndash; and the rest are lunch.&#10;&#10;Includes 42 glittery green dice and its own dice bag!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":3,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":20,"minAge":0,"categoriesAndMechanics":["Dice"],"rating":2.938775,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/bvYgNGdpRDX2HuuWuIjZ1Q__thumb/img/ZigCks80CVzP3P3VgX3OQsy1_x8=/fit-in/200x150/filters:strip_icc()/pic5429955.png","urlImage":"https://cf.geekdo-images.com/bvYgNGdpRDX2HuuWuIjZ1Q__original/img/8c4lyYwKCVsy2fyAPl53cq5dQKM=/0x0/filters:format(png)/pic5429955.png"},{"bggId":"324","name":"Ponte Vecchio","description":"The &quot;rich gentleman&quot; has money burning a hole in his purse. He also likes to spend the day ambling back and forth along the Old Bridge (Ponte Vecchio), spending wherever he stops.&#10;&#10;","minPlayers":3,"maxPlayers":5,"minPlayTime":90,"maxPlayTime":90,"minAge":12,"categoriesAndMechanics":["Economic","Auction/Bidding"],"rating":2.9227,"complexity":2.25,"urlThumb":"https://cf.geekdo-images.com/r7IHN9dwpa-mkf4oCrnK7A__thumb/img/_qwfCP-H0CLjfYRX5PhQRIu4V10=/fit-in/200x150/filters:strip_icc()/pic453851.jpg","urlImage":"https://cf.geekdo-images.com/r7IHN9dwpa-mkf4oCrnK7A__original/img/H2N02FiwJ-CGXUY_-olqEa71fy0=/0x0/filters:format(jpeg)/pic453851.jpg"},{"bggId":"286535","name":"#mylife","description":"Live out your life in miniature &mdash; well, a life &mdash; in #MyLife, a card game played over ten rounds that takes you from birth to old age.&#10;&#10;Each player starts with a birth card that puts them at age 0, then players receive a hand of six cards from the &quot;first half of life&quot; deck. Each player chooses a card simultaneously from their hand then put it into play &mdash; but only if the card lies in the proper age range (1-10, 11-20, etc.) or the icons on this card are present on cards that you've played earlier (with those icons representing experience that allow you to play the current card because, hey, you've earned it). You then pass the remaining cards in your hand to the player on your left.&#10;&#10;Once everyone has played five cards, you discard the remaining cards, receive a hand of six cards from the &quot;second half of life&quot; deck, then play another five rounds. If you're the first player to achieve certain combinations of icons, you get to claim a &quot;life goal&quot; card in play, with ties broken by whoever achieves this goal by a younger age.&#10;&#10;Score points based on the goals listed on your personal cards and how well you achieved them through the icons that you played.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Card Game","Open Drafting"],"rating":2.860765,"complexity":1.6667,"urlThumb":"https://cf.geekdo-images.com/EPnRNQChUiAjtzqo9uvXCw__thumb/img/q7o1sGf65oueVajkwTj2bXSq5gE=/fit-in/200x150/filters:strip_icc()/pic4894341.jpg","urlImage":"https://cf.geekdo-images.com/EPnRNQChUiAjtzqo9uvXCw__original/img/Rn3rkdYZXJACnNFAUsVmUVVAeCU=/0x0/filters:format(jpeg)/pic4894341.jpg"},{"bggId":"218460","name":"Giant UNO","description":"The classic card game now in a giant size! Each card measures 7.4 inches x 10.1 inches!&#10;&#10;Race to get rid of all your cards and match colors or numbers.&#10;Use the action cards or house rule cards against your opponents. When you're down to one card, don't forget to yell &quot;UNO&quot;!&#10;Play the 'Swap Hands' card to change hands with any opponent.&#10;3 customizable cards let you write any house rule you want and erase to make new rules!&#10;&#10;","minPlayers":2,"maxPlayers":10,"minPlayTime":0,"maxPlayTime":0,"minAge":7,"categoriesAndMechanics":["Card Game","Hand Management"],"rating":2.858695,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/98eexYFswwsQMKtbKyFBlQ__thumb/img/diVp08rBq--3k36j69QdHAL6rVo=/fit-in/200x150/filters:strip_icc()/pic3537769.jpg","urlImage":"https://cf.geekdo-images.com/98eexYFswwsQMKtbKyFBlQ__original/img/UIqA_6ll2K9ulQs-fzec0rZCaqc=/0x0/filters:format(jpeg)/pic3537769.jpg"},{"bggId":"371436","name":"Cortex: Harry Potter","description":"Enter the wizarding world of Harry Potter with this new edition of Cortex. Players will discover new mini games, and try to be the first players to challenge their memory, logic and observation skills.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":15,"maxPlayTime":15,"minAge":8,"categoriesAndMechanics":["Card Game","Educational","Party Game","Memory","Pattern Recognition"],"rating":3.06125,"complexity":1.5,"urlThumb":"https://cf.geekdo-images.com/YEF-b71jDrAGK7S2LlGh9g__thumb/img/umG6cQ3u_slcWcwxu_M-NPHRl5Y=/fit-in/200x150/filters:strip_icc()/pic7093527.jpg","urlImage":"https://cf.geekdo-images.com/YEF-b71jDrAGK7S2LlGh9g__original/img/y7M60Hza_ClzN5MrD87unO9XI_4=/0x0/filters:format(jpeg)/pic7093527.jpg"},{"bggId":"34009","name":"Loopit","description":"Players place numbered tiles with pipes on a Scrabble like board. The tiles only fit in one direction. On the board are multipliers in some places.&#10;&#10;On their turn, players may play up to 3 tiles from their rack onto the board, scoring for each tile. Played tiles must match up to the tiles next to them, being collected to at least one. The score for a tile is the sum of the tiles it is connected to plus the value of the tile itself, multiplied by the multiplier it is played on (if any).&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":20,"minAge":7,"categoriesAndMechanics":["Abstract Strategy","Square Grid","Tile Placement"],"rating":2.9625,"complexity":1.5714,"urlThumb":"https://cf.geekdo-images.com/ocGJ4m-8GIt9vL4byrRksA__thumb/img/iZglFI6N4kDyYyvaGlLV31wXU5I=/fit-in/200x150/filters:strip_icc()/pic4420963.jpg","urlImage":"https://cf.geekdo-images.com/ocGJ4m-8GIt9vL4byrRksA__original/img/GTdpkHXgqVNzcwdWWNgeg1x58Yc=/0x0/filters:format(jpeg)/pic4420963.jpg"},{"bggId":"20645","name":"Tenakee","description":"Here's a description of the game from Spielbox:&#10;&#10;This new publisher is presenting its first game: Tenakee. Under the title &lsquo;Coco-Nut&rsquo;, Michael Feldkotter had submitted this game as part of the SAZ competition for game authors at last year&rsquo;s Essen fair. Alan R. Moon had run the competition and fronted the prize money; 9 authors with a total of 16 prototypes entered. This game won first prize.&#10;&#10;The great totem pole competition is being held among the Tenakee Indians. Those taking part want to show off the most beautiful and valuable totem poles. But the poles are only scored when it gets a point, so that the Indians like to annoy each other by climbing up and putting points on poles. At the same time, the squaws are using the event to search for a man. Which carver is brave enough to climb the high totem poles?&#10;&#10;","minPlayers":3,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":15,"minAge":9,"categoriesAndMechanics":["Bluffing","Card Game","Hand Management"],"rating":2.817345,"complexity":1.2308,"urlThumb":"https://cf.geekdo-images.com/TDeT8od67KuL9Ar6BghJ7A__thumb/img/2iaxBCpiYlhrg18Y5SFVOs-gS1I=/fit-in/200x150/filters:strip_icc()/pic391106.jpg","urlImage":"https://cf.geekdo-images.com/TDeT8od67KuL9Ar6BghJ7A__original/img/bNPj5DuqIosUyhoaZ9IxSAxEjtQ=/0x0/filters:format(jpeg)/pic391106.jpg"},{"bggId":"266078","name":"Hochspannung","description":"Try to rid yourself of cards quickly in Hochspannung! Distribute the deck evenly among all the players, then lay out one card face up to start the discard pile. Each player takes four cards from the personal deck in hand, and they can draw more cards from it at any time &mdash; which may or may not be helpful.&#10;&#10;Each card shows a multiplication problem in its center, along with two individual digits in each corner. When the game begins, each player races to complete the multiplication problem on the top card in the discard pile, e.g. 6x9, then play a card on it that has in its corner a number that matches either the first or second digit of the product, in this case 5 or 4. This newly played card has a multiplication problem of its own, and someone will play a matching card on it, etc. Whoever plays all the cards in their hand and personal deck first wins.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":20,"minAge":10,"categoriesAndMechanics":["Card Game","Real-time"],"rating":2.92143,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/1a2J7hKt17Qob_UnMwRf9Q__thumb/img/W171YTRlmv8dnnJFjrWdewxgxJ8=/fit-in/200x150/filters:strip_icc()/pic4496650.jpg","urlImage":"https://cf.geekdo-images.com/1a2J7hKt17Qob_UnMwRf9Q__original/img/hvKLhrp4eysa5SlvRhR84j7uvAE=/0x0/filters:format(jpeg)/pic4496650.jpg"},{"bggId":"12788","name":"Treasure Island","description":"A pirate-themed game where players explore treasure islands and try to collect as many treasures as possible. Each turn a player rolls two dice. Then each player chooses one of the numbers and places his or her counter on a square marked with that number. The goal is to &quot;cut off&quot; areas from the rest of the board and thus claim treasures that might be within.&#10;&#10;The game includes two boards. The smaller is suitable for 2-4 players and plays in 45 minutes. The larger is for 2-6 players and takes about 90 minutes to play.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":90,"maxPlayTime":90,"minAge":8,"categoriesAndMechanics":["Adventure","Exploration","Novel-based","Pirates","Enclosure"],"rating":2.992425,"complexity":1.7273,"urlThumb":"https://cf.geekdo-images.com/yH32O-2X7Nhc_WqJPuekpw__thumb/img/42-LRr30dUt5zEYpGPZMY_Ql1UM=/fit-in/200x150/filters:strip_icc()/pic224999.jpg","urlImage":"https://cf.geekdo-images.com/yH32O-2X7Nhc_WqJPuekpw__original/img/L3969YHDV9L05krR5aoZmhLZiDk=/0x0/filters:format(jpeg)/pic224999.jpg"},{"bggId":"234166","name":"Gobblin' Goblins","description":"Description from the deisgner:&#10;&#10;Gobblin' Goblins is a card game where you must defeat your opponents by being the greediest goblin in a sneaky battle for gross gourmet food.&#10;&#10;Using a simple play a card and pick up a card mechanic, players collect sets of coloured food cards in order to gobble them off their plate. Action cards can be used to steal and swap food cards as well as causing rounds of vomiting and even explosive diarrhoea. Distraction cards can be played out of turn to hijack your opponents dining experience.&#10;&#10;Goblins gobble everything from mud pie to flip flops to rusty old pylons. Their stomachs are bottomless, however, each goblin has it's own likes and dislikes as well as allergies. They also have their own special ability depending on their category.&#10;&#10;Gobbled unwanted food results in minus points and favourable food awards extra points. When all the cards are played, the goblin with the most points is the winner.&#10;&#10;","minPlayers":2,"maxPlayers":12,"minPlayTime":20,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Card Game","Fantasy","Humor","Set Collection","Variable Player Powers"],"rating":3.34072,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/shViH_M5DFBU6SDWx4NZ3A__thumb/img/sgyJPQOlD1rMEqPcUM4mnRF21TQ=/fit-in/200x150/filters:strip_icc()/pic3729715.jpg","urlImage":"https://cf.geekdo-images.com/shViH_M5DFBU6SDWx4NZ3A__original/img/F37TDduvMIJzbE4zeucNDT_akDE=/0x0/filters:format(jpeg)/pic3729715.jpg"},{"bggId":"407720","name":"Post Office","description":"Post Office is a game in which you will arrange packages on your Shelves pads in order to complete challenges. By placing your packages of the same type next to each other and taping them up in certain ways, you will create combinations of symbols to score Victory Points.&#10;&#10;The more efficient you are the more Victory Points you get. Earn the most Victory Points to become employee of the month!&#10;&#10;&#10;     Move your assistant along the shelves &mdash; it will point to the column or row where to place a package.&#10;     Place a package onto an empty slot of the shelf.&#10;     Packages make up a shape of the same color? Tape them up! Now they won't get lost.&#10;&#10;&#10;In this game you will also find colorful detailed illustrations by Natalya Kondratyuk, the author behind the comic &ldquo;Post&rdquo; and the winner of &ldquo;Kommissia&rdquo;.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":45,"minAge":8,"categoriesAndMechanics":["Animals","Comic Book / Strip","Bingo","End Game Bonuses","Grid Coverage","Pattern Building","Square Grid","Tile Placement"],"rating":3.294645,"complexity":1.6667,"urlThumb":"https://cf.geekdo-images.com/TtgnpohHHLcmkeIyjkFR4g__thumb/img/vjv6mbPxBCN24zj-jio3tnkhotI=/fit-in/200x150/filters:strip_icc()/pic7887191.jpg","urlImage":"https://cf.geekdo-images.com/TtgnpohHHLcmkeIyjkFR4g__original/img/c9Z7V2LOsHRibzTAXPO3XcdSi0c=/0x0/filters:format(jpeg)/pic7887191.jpg"},{"bggId":"170447","name":"Kard és Korona","description":"Kard &eacute;s Korona (Sword and Crown) - The Hungarian Game of Thrones&#10;&#10;The game begins in 1301 - dark clouds are gathering over the Kingdom of Hungary. The last king of the House of &Aacute;rp&aacute;d, III. Andr&aacute;s is likely to be a victim of poisoning and the real power is in the hands of the most powerful barons, who rule as kings in their own realm. Waging war against each other, the country is essentially torn into several parts. Everyone is preparing for the final showdown... and the war has begun!&#10;&#10;The country is divided into six provinces, each ruled by a different baron and all they want is the crown. But only one of them can succeed! The game is about this decade, until K&aacute;roly R&oacute;bert consolidates his power. Diplomacy has a very important role, from the money you gather you have to bid on the offices of the Palatine, the Judge and the Treasurer. The game is immediately won, if someone manages to acquire all three offices, or the barons of the other players are defeated and killed in battle, or specified castles are occupied or rules 3-4 separate parts of the country. Lots of intrigue and bloody battles are waiting!&#10;&#10;We can call Sword and Crown the Hungarian version of the well-known game Risk, but with completely unique solutions, even greater game experience, with real battles, sieges, where only the size of your army and the dice rolls decide the outcome of a battle.&#10;&#10;Andr&aacute;s has died, with him the House of &Aacute;rp&aacute;d. Now is the time to make your dynasty his successor!&#10;&#10;&#10;A magyar Tr&oacute;nok Harca&#10;&#10;A j&aacute;t&eacute;k 1301-ben veszi kezdet&eacute;t: a Magyar Kir&aacute;lys&aacute;g f&ouml;l&ouml;tt s&ouml;t&eacute;t felh&#197;&#145;k gy&uuml;lekeznek. Az &Aacute;rp&aacute;d-h&aacute;z utols&oacute; kir&aacute;lya, III. Andr&aacute;s val&oacute;sz&iacute;n&#197;&#177;leg m&eacute;rgez&eacute;s &aacute;ldozata lesz, a val&oacute;di er&#197;&#145; a leghatalmasabb b&aacute;r&oacute;k, a tartom&aacute;nyurak kez&eacute;ben &ouml;sszpontosul, akik kiskir&aacute;lyokk&eacute;nt korm&aacute;nyoznak ter&uuml;leteiken. Egym&aacute;s &eacute;s k&uuml;lhoni uralkod&oacute;k ellen hadat viselnek, nem lehet f&eacute;ken tartani &#197;&#145;ket, l&eacute;nyeg&eacute;ben az orsz&aacute;g t&ouml;bb r&eacute;szre szakadt. Mindenki k&eacute;sz&uuml;l a v&eacute;gs&#197;&#145; nagy lesz&aacute;mol&aacute;s idej&eacute;re&hellip; &Eacute;s a h&aacute;bor&uacute; elkezd&#197;&#145;d&ouml;tt!&#10;&#10;Az orsz&aacute;g 6 tartom&aacute;nyra van felosztva, mindegyiket m&aacute;s kiskir&aacute;ly uralja: Aba Am&aacute;d&eacute; a Tiszah&aacute;tr&oacute;l, Borsa Kopasz a D&eacute;lvid&eacute;kr&#197;&#145;l, Cs&aacute;k M&aacute;t&eacute; Felvid&eacute;kr&#197;&#145;l, K&aacute;n L&aacute;szl&oacute; Erd&eacute;lyb&#197;&#145;l, K&#197;&#145;szegi Henrik Pann&oacute;ni&aacute;b&oacute;l, Subics P&aacute;l pedig Szlav&oacute;ni&aacute;b&oacute;l indul el, hogy megh&oacute;d&iacute;tsa a magyar tr&oacute;nt. De csak egyik&uuml;knek siker&uuml;lhet! Err&#197;&#145;l a v&eacute;rzivataros k&eacute;t &eacute;vtizedr&#197;&#145;l sz&oacute;l a j&aacute;t&eacute;k, amelynek a kir&aacute;lyi korona megszerz&eacute;se a c&eacute;lja, am&iacute;g K&aacute;roly R&oacute;bert meg nem szil&aacute;rd&iacute;tja hatalm&aacute;t. Nagyon fontos a diplom&aacute;cia szerepe, a rendelkez&eacute;s&uuml;kre &aacute;ll&oacute; garasokb&oacute;l, d&eacute;n&aacute;rokb&oacute;l &eacute;s forintokb&oacute;l licit&aacute;lni is kell a tiszts&eacute;gekre, mint a n&aacute;dor, orsz&aacute;gb&iacute;r&oacute; &eacute;s t&aacute;rnokmester. A j&aacute;t&eacute;kot azonnal megnyeri, akinek siker&uuml;l v&aacute;laszt&aacute;son megszerzi mindh&aacute;rom tiszts&eacute;get, vagy valamennyi j&aacute;t&eacute;kost&aacute;rs&aacute;nak tartom&aacute;nyur&aacute;t csat&aacute;ban legy&#197;&#145;znie, vagy elfoglal 3-4 &ouml;n&aacute;ll&oacute; orsz&aacute;gr&eacute;szt vagy a j&aacute;t&eacute;kosok sz&aacute;ma szerint meghat&aacute;rozott v&aacute;rat. Rengeteg cselsz&ouml;v&eacute;s &eacute;s v&eacute;res &uuml;tk&ouml;zet v&aacute;r arra, aki a hadak &uacute;tj&aacute;ra l&eacute;p!&#10;&#10;A Kard &eacute;s Koron&aacute;t nevezhetj&uuml;k a k&ouml;zismert Rizik&oacute; ter&uuml;letfoglal&oacute;s j&aacute;t&eacute;k magyar v&aacute;ltozat&aacute;nak, de teljesen egyedi megold&aacute;sokkal, a j&aacute;t&eacute;k&eacute;lm&eacute;ny pedig m&eacute;g nagyobb, val&oacute;di csat&aacute;kkal, v&aacute;rostromokkal bilincsel le, amelyek kimenetel&eacute;t a nagyobb er&#197;&#145; &eacute;s a kockadob&aacute;sok d&ouml;ntik el, a csonkaorsz&aacute;g helyett egy olyan t&eacute;rk&eacute;ppel, ami 1100 &eacute;v Magyarorsz&aacute;g&aacute;t &aacute;br&aacute;zolja.&#10;&#10;Meghalt Andr&aacute;s, let&ouml;rt vele az &Aacute;rp&aacute;d-h&aacute;z utols&oacute; arany&aacute;gacsk&aacute;ja. Itt az id&#197;&#145;, hogy az &eacute;n dinaszti&aacute;m l&eacute;pjen az &ouml;r&ouml;k&eacute;be!&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":120,"maxPlayTime":120,"minAge":10,"categoriesAndMechanics":["Medieval","Political","Wargame","Area Majority / Influence","Area Movement","Dice Rolling","Player Elimination"],"rating":3.38089,"complexity":1.8333,"urlThumb":"https://cf.geekdo-images.com/5uwxlGoVBXbzv8h5M1ivjw__thumb/img/CT3ibppi2_nZxMe-asbssSrk1lU=/fit-in/200x150/filters:strip_icc()/pic2344864.jpg","urlImage":"https://cf.geekdo-images.com/5uwxlGoVBXbzv8h5M1ivjw__original/img/EPtXSEFMciTji8mcgGHlU08SwPI=/0x0/filters:format(jpeg)/pic2344864.jpg"},{"bggId":"244704","name":"Rock the Bock","description":"Today, the horse goes hog wild, and the deer dances with the cow. If you want to get the last tickets for the animal festival, you better rally at the round-up!&#10;&#10;In Rock the Bock, the player who gets the most animals from their hand onto the festival grounds wins. Groups with too many animals have to stay out, though. A good connection to the black market and a cleverly used VIP pass can't hurt.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":15,"minAge":7,"categoriesAndMechanics":["Animals","Card Game","Auction/Bidding","Hand Management"],"rating":2.88611,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/WC4ev-pLGBWPNx3lf0p15Q__thumb/img/HJmtlV26whWiO3wCF1t4RyDRx5I=/fit-in/200x150/filters:strip_icc()/pic3944128.jpg","urlImage":"https://cf.geekdo-images.com/WC4ev-pLGBWPNx3lf0p15Q__original/img/N0DYxJaioL7YeCMA-Gm5GQVEsko=/0x0/filters:format(jpeg)/pic3944128.jpg"},{"bggId":"168457","name":"HexAgony","description":"HexAgony is a 2 - 3 player abstract strategy game that combines strategy, luck and exciting new challenges every time you play!&#10;&#10;The object of the game is for players to make as many hexagons in their chosen colour as possible, while trying to prevent their opponent(s) from making hexagons in their chosen colour.&#10;&#10;At the end of the game the player with the most completed hexagons wins.&#10;&#10;","minPlayers":1,"maxPlayers":3,"minPlayTime":20,"maxPlayTime":20,"minAge":8,"categoriesAndMechanics":["Abstract Strategy","Pattern Building","Tile Placement"],"rating":2.98789,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/swOjU-9ff6gD7U1wyAKlDw__thumb/img/YCV7_Hx0-t4i6dxg8IX94NS7DRQ=/fit-in/200x150/filters:strip_icc()/pic2373150.jpg","urlImage":"https://cf.geekdo-images.com/swOjU-9ff6gD7U1wyAKlDw__original/img/pakY56DR9mfhPT7dqOnQ06e0o4U=/0x0/filters:format(jpeg)/pic2373150.jpg"},{"bggId":"70922","name":"Vicious Fishes","description":"Johnson&rsquo;s pond isn&rsquo;t that big, yet more fish are being born each year. The fish have divided up into schools and are at war.&#10;&#10;Vicious Fishes is a tile-laying game where six different schools of fish are fighting to become the dominating school of the sea. It&rsquo;s better to be a big fish in a small pond, goes the old saying, and this is a small pond. Players are actively supporting a faction of fish hoping that their faction is the winner. At the same time, they are secretly betting that one faction of fish loses. Which player will back the right faction?&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Animals","Tile Placement"],"rating":2.84764,"complexity":1.875,"urlThumb":"https://cf.geekdo-images.com/4vha5M7vgO_t7x0ozshEOw__thumb/img/ZtQrc91YnzWFEU27emeu7iz2TSE=/fit-in/200x150/filters:strip_icc()/pic828851.jpg","urlImage":"https://cf.geekdo-images.com/4vha5M7vgO_t7x0ozshEOw__original/img/5N6clYtpAF5uBxCAbz4TZQYv8QA=/0x0/filters:format(jpeg)/pic828851.jpg"},{"bggId":"69602","name":"Phase 10: Das Brettspiel","description":"As in other Phase 10 versions, the players try to collect sets of cards in ten different phases which have to be collected in order. Only when one phase is completed, the player can start collecting the next one. &#10;In this board game version, players move along a circular track on the board. For this, they roll two dice and choose one of them for their movement. The field they land on contains instructions on how to draw or replace cards or even request them from others. Afterwards, phases can be laid out or added to. At the end of each player's turn, a card has to be discarded. A player who has no cards left after this moves forward two phases, the other players who have completed the current phase move forward to the next phase, all others have to try the current phase again in the next round. The first player to complete phase 10 is the winner.&#10;&#10;(User summary by HilkMAN)&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":60,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Card Game","Set Collection"],"rating":2.818505,"complexity":1.5,"urlThumb":"https://cf.geekdo-images.com/MjUbGbA8kg91QQFV3vES0A__thumb/img/ttaGt89x9L4uD4Gonosme3zVOAE=/fit-in/200x150/filters:strip_icc()/pic868748.jpg","urlImage":"https://cf.geekdo-images.com/MjUbGbA8kg91QQFV3vES0A__original/img/YRUzESdKvuUSU9-Zu1SogNfixTY=/0x0/filters:format(jpeg)/pic868748.jpg"},{"bggId":"13614","name":"Chancellorsville","description":"Chancellorsville was the third &quot;Tournament&quot; wargame from The Avalon Hill Game Co. It marked the introduction of hex based maps to the hobby (contemporaneously with D-Day and Gettysburg) It also marked an unfortunate experiment in early wargame map graphics -- instead of using illustrations to depict terrain features, the hexes were simply filled with a single color. The result was more mosaic than map.&#10;&#10;After a couple of years, Chancellorsville was dropped from the The Avalon Hill Game Co line. In 1974, The Avalon Hill Game Co released Randall Reed's revision of the game. However, by the mid 1980's Chancellorsville had vanished from the The Avalon Hill Game Co catalog.&#10;&#10;Re-implemented by:&#10;&#10;    Chancellorsville (Second Edition)&#10;&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":120,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["American Civil War","Wargame","Dice Rolling","Grid Movement","Hexagon Grid","Paper-and-Pencil","Ratio / Combat Results Table","Simulation"],"rating":2.93106,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/ui0gfC0-4fGLFKTNGu8Blw__thumb/img/h-blVcIMPLzM46_OqHMlB1Wcss8=/fit-in/200x150/filters:strip_icc()/pic3656925.jpg","urlImage":"https://cf.geekdo-images.com/ui0gfC0-4fGLFKTNGu8Blw__original/img/lQdjuH2-w9XG3c4yJZAECm2rpnY=/0x0/filters:format(jpeg)/pic3656925.jpg"},{"bggId":"35371","name":"El Juego de la Liga","description":"&quot;The Game of the League&quot; 2003/2004 based on the Spanish Football League.&#10;&#10;Content:&#10;- 1 board&#10;- 8 colored player's pieces  &#10;- 2 dices&#10;- 8 classification cards&#10;- 67 incidents cards&#10;- 220 football players cards (with all the league star players)&#10;- Bills of money&#10;- Games calendar&#10;- 20 cards of team alignment&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":120,"maxPlayTime":120,"minAge":0,"categoriesAndMechanics":["Sports","Roll / Spin and Move"],"rating":3.007845,"complexity":1.4,"urlThumb":"https://cf.geekdo-images.com/IfQjzHobJj03N7ex9tiZLw__thumb/img/dKEF5xLInf_JAJRNxd959LDsdno=/fit-in/200x150/filters:strip_icc()/pic1192832.jpg","urlImage":"https://cf.geekdo-images.com/IfQjzHobJj03N7ex9tiZLw__original/img/4YMUjuE0KyMt2LzMhW6JZ9AAVaE=/0x0/filters:format(jpeg)/pic1192832.jpg"},{"bggId":"69973","name":"Ticked Off","description":"In each round of Ticked Off, players are shown a category, then take turns making claims of how many items they could list in that category.&#10;&#10;Seems straightforward &ndash; but naturally there's a twist! Once all but one person has passed on increasing the target bid, a second category is revealed and each player then lists as many items as possible &ndash; but from only one of the two categories. Players then compare answers and mark out duplicates, scoring one point for each unique answer; the bidder scores two points for each unique answer, but only if he meets his bid. In addition, each player scores additional points if he listed more answers than the number bid.&#10;&#10;","minPlayers":3,"maxPlayers":10,"minPlayTime":45,"maxPlayTime":45,"minAge":13,"categoriesAndMechanics":["Party Game","Word Game"],"rating":2.867955,"complexity":1.1111,"urlThumb":"https://cf.geekdo-images.com/VMYsLG3h_KkmmJL6DuiJzw__thumb/img/lWudHEiVXOVMeJKdtxMhUmyEV7A=/fit-in/200x150/filters:strip_icc()/pic1093108.jpg","urlImage":"https://cf.geekdo-images.com/VMYsLG3h_KkmmJL6DuiJzw__original/img/yCg8TvJxyLoKTE9Jk0qhb-J1kN8=/0x0/filters:format(jpeg)/pic1093108.jpg"},{"bggId":"6748","name":"Scum: The Food Chain Game","description":"This is a repackaging of the public domain game known variously as: Scum, President, Corporation, Asshole to name a few. It has the same climbing mechanics as The Great Dalmuti, Frank's Zoo, and Tichu. The face cards have been replaced with animals with value from 1 to 13. A board has been added that is simply a big score board.&#10;&#10;From the family of oriental &quot;climbing games&quot;, the public-domain version of Scum is similar to Big Two but has significant differences.&#10;&#10;Due to its popularity amongst students, many house rules have been developed.&#10;&#10;","minPlayers":4,"maxPlayers":10,"minPlayTime":45,"maxPlayTime":45,"minAge":12,"categoriesAndMechanics":["Card Game","Ladder Climbing"],"rating":2.812725,"complexity":1.2941,"urlThumb":"https://cf.geekdo-images.com/NmyTIgtES3Hi0v0IRdv1LA__thumb/img/hZv8DaI2UApO-rr7_ZMn6i9fAo0=/fit-in/200x150/filters:strip_icc()/pic27506.jpg","urlImage":"https://cf.geekdo-images.com/NmyTIgtES3Hi0v0IRdv1LA__original/img/oFYfNnXSAuShZ-w4noB0MQx5iDY=/0x0/filters:format(jpeg)/pic27506.jpg"},{"bggId":"12222","name":"Ancients: Thapsos & Alexandria","description":"These games were originally published in Game Fix magazine #1 and were later reissued by One Small Step.&#10;&#10;The set comprises two complete games using Bill Banks's classic &quot;Ancients&quot; game system of hoplites and charioteers.  The Thapsos scenario is a relatively simple meeting of infantry, one side with archers, the other with elephants.  The Alexandria scenario adds trireme combat in addition to the infantry.  The game includes 100 die-cut counters, two 8.5&quot;&times;11&quot; full-color maps, tables, scenarios, and rules.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":45,"maxPlayTime":45,"minAge":12,"categoriesAndMechanics":["Ancient","Wargame","Hexagon Grid","Simulation"],"rating":2.9275,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/sWWuc5Vdiar4YJpKhyEu2Q__thumb/img/SZr-WcaH4x5uYMfr1-TpZNc5PFs=/fit-in/200x150/filters:strip_icc()/pic6282255.jpg","urlImage":"https://cf.geekdo-images.com/sWWuc5Vdiar4YJpKhyEu2Q__original/img/ofDskKPwEL1ZWIWcib8SRngI5Fs=/0x0/filters:format(jpeg)/pic6282255.jpg"},{"bggId":"294529","name":"Entropia: The Game","description":"Entropia gives you the chance of stepping into the shoes of a young powerful star, fighting to forge your own planetary system out of chaos. In this chaotic universe, each player is a young star trying to control the galaxy where they live, and prevent the other players from seizing power. Why on earth would you dream of controlling the chaos and fighting against other stars? Well, to become the brightest and the most powerful star of the galaxy! Do not miss your chance, show the other stars how badass you are!&#10;&#10;Playing the Game: To start playing Entropia, deal three cards to each player and place the deck on the centre. One of the players goes first and the game starts. During your turn, you can choose and perform only one action, which can consist in drawing a card from the deck or playing one of your cards, then the turn passes to the next player in rotation.&#10;&#10;All cards in the deck stand for a planet and you can use them to perform different actions: for example, you can use your card to attract planets with your gravity by putting the card on the board in front of you (using the keyword Attract), you can convert the mass of a planet into pure energy (using the keyword Fuse) in order to draw new cards from the deck, play an extra card during your turn or scupper the strategies of the other players by destroying their planets. Moreover, you can also discard your cards when your planets have the same mass of your adversary&rsquo;s planets (using the keyword Annihilate) in order to stop other players heading all the way to the winning.&#10;&#10;Since the first person to control four planets wins the game, every player should develop unique strategies to destroy other players&rsquo; cards and conquer the four planets as fast as she/he can. Even though the game looks simple and easy to play at first glance, you will need to devise strategies to control overpowered cards and use them wisely. It&rsquo;s up to you whether you want to greedily take over all the four planets or slowly destroy your enemies&rsquo; resources: there are more methods and strategies you can use to win over the other players, so come and discover them while playing. You need to sharpen your weapons and grit your teeth to be the next champion of Entropia!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Card Game","Science Fiction","Alliances","Kill Steal","Solo / Solitaire Game","Take That","Turn Order: Pass Order"],"rating":3.06979,"complexity":1.6,"urlThumb":"https://cf.geekdo-images.com/aDbeVeOOBAuryTrjjU8PtA__thumb/img/CBcOXSS9TMpN5tyuoGBSU4zYRbc=/fit-in/200x150/filters:strip_icc()/pic5431208.jpg","urlImage":"https://cf.geekdo-images.com/aDbeVeOOBAuryTrjjU8PtA__original/img/ktphlCkUsZDNv1vPEuAgG8BJZRM=/0x0/filters:format(jpeg)/pic5431208.jpg"},{"bggId":"128910","name":"Pyramid Raiders","description":"Pyramid Raiders is a light back-stabbing strategy game for 3-6 players. Players are treasure hunters looking for fame and fortune in a long forgotten pyramid. With the help of their special equipment, they will compete with each other to gather the most treasure from this expedition &ndash; but watch out for The Guardian! He awakes from the darkness of the ruins to fulfill his mission, to chase all intruders and throw them out with a curse!&#10;&#10;In Pyramid Raiders, players lay down action tiles to move and collect treasure tokens on a hexagonal map. Besides providing a number for movement, action tiles will also effect The Guardian in different ways, such as rotate him to face another direction or make him move faster. Used action tiles will stay on board, and will be returned to hand only every five turns when they are all used.&#10;&#10;The Guardian's movement is guided by a set of rules and does not need a player to act as the GM. Each turn after all players have finished their moves, roll a die to move The Guardian, then move it extra spaces depending on the action tiles played this turn.&#10;&#10;At the start of each game, randomly place 49 treasure tokens of seven kinds on the map. Players score by collecting tokens of different colors, or by specializing in only one or two colors. Twelve wooden tokens are placed on the map as obstacles, and can be placed in different layouts to change the difficulty of the game. Ten item tiles are included to provide rule-bending effects for players. And for those who are up for the challenge, two extra Line of Sight tokens will let The Guardian literally grow eyes on his back, making it even harder to escape &ndash; or easier to trap other players depending on your point of view...&#10;&#10;","minPlayers":3,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":20,"minAge":12,"categoriesAndMechanics":["Ancient","Animals","Mythology","Dice Rolling","Grid Movement","Hand Management","Set Collection"],"rating":2.92317,"complexity":1.6667,"urlThumb":"https://cf.geekdo-images.com/QxAbssu_emylH4iuTsaJjQ__thumb/img/csU0ttmtN2pA9_LTJZy0qYv6Tp8=/fit-in/200x150/filters:strip_icc()/pic1420146.jpg","urlImage":"https://cf.geekdo-images.com/QxAbssu_emylH4iuTsaJjQ__original/img/hjabMgPcTPQH7yTNxJ0YLEkTuoA=/0x0/filters:format(jpeg)/pic1420146.jpg"},{"bggId":"312899","name":"Carteros","description":"As a good postman, study the streets well to manage to deliver all your letters first. It doesn't seem difficult, but be careful with the dogs!&#10;&#10;in your turn you have 3 action points, with them you can move arround the neighborhood, deliver mail, draw a card, use a card, or discard / replace an card.&#10;&#10;Whoever achieves the highest number of victory points between the value of the cards delivered and the tips received is the winner.&#10;&#10;&#10;Espa&ntilde;ol&#10;-Como buen cartero, estudia bien las calles para lograr entregar primero todas tus cartas. No parece dificil, pero !ten cuidado con los perros!.&#10;&#10;Utiliza puntos de acci&oacute;n para moverte, entregar correspondencia, Robar una carta, utilizar una carta o descartar/reemplazar una carta.&#10;&#10;Quien logre mayor cantidad de puntos de victoria entre valor de cartas entregadas y propinas recibidas es el ganador.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":60,"minAge":8,"categoriesAndMechanics":["Card Game","Party Game","Action Points","Hand Management","Move Through Deck"],"rating":3.088835,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/csrtATbKG5YVXuJxD4r-Cw__thumb/img/1sEP7-NFffW55V8BkCq9jkPa2wU=/fit-in/200x150/filters:strip_icc()/pic6341264.png","urlImage":"https://cf.geekdo-images.com/csrtATbKG5YVXuJxD4r-Cw__original/img/rGZJ_bEGKhMNxy1XLFZ3DtavN4o=/0x0/filters:format(png)/pic6341264.png"},{"bggId":"112844","name":"Swintus 2.0","description":"From publisher:&#10;&#10;&quot;Svintus 2.0. More animals &ndash; more fun!&quot; is a variation of the best-selling Russian card game Svintus. Now there are more cards, more animals, and even more fun.&#10;&#10;The object of the game is very simple &ndash; you need to get rid of all your cards. However, you can achieve this goal in any number of different ways. Confuse your opponents with Prescriptions, control their every move with Etiquette, break them down with a Challenge to a card duel, or make a fool of them with a Performance card.&#10;&#10;The game is completely compatible with the original version, meaning that you can play a classic game of Svintus by removing certain types of cards. The new version introduces 3 new types of cards:&#10;&#10;- Etiquette Cards (Snake Behavior) allow you to give cards to those opponents who have behaved a certain way during the game.&#10;- Performance Cards (Show Business Parrot) force your opponent to entertain other players with their talents.&#10;- Challenge Cards (Dog-like Aggression) give you an opportunity to intimidate other players.&#10;&#10;The game set concept allows the deck to be tailored using different types of cards to best fit the group of players and their prevailing mood.&#10;&#10;Svintus 2.0 is an easy-to-learn, fun-to-play card game with stylish illustrations and topical humor.&#10;&#10;Svintus 2.0 is the advanced version of the popular card game Crazy Eights for 2-10 players playable in 15 to 20 minutes.&#10;&#10;Re-implements:&#10;&#10;    &#208;&#161;&#208;&#178;&#208;&#184;&#208;&#189;&#209;&#130;&#209;&#131;&#209;&#129;&#10;&#10;&#10;","minPlayers":2,"maxPlayers":10,"minPlayTime":15,"maxPlayTime":15,"minAge":10,"categoriesAndMechanics":["Animals","Card Game","Number","Party Game","Hand Management","Lose a Turn","Matching","Take That"],"rating":2.904455,"complexity":1.2857,"urlThumb":"https://cf.geekdo-images.com/I-hE4uIgKfnGQXHqA4tvog__thumb/img/Yhfqt0Q8ZkYtfrDT9Z-YLd2EWkw=/fit-in/200x150/filters:strip_icc()/pic1418024.jpg","urlImage":"https://cf.geekdo-images.com/I-hE4uIgKfnGQXHqA4tvog__original/img/Z2tWSm_PmltBrpbygKTGb8CRiqQ=/0x0/filters:format(jpeg)/pic1418024.jpg"},{"bggId":"221298","name":"NewSpeak","description":"Newspeak is a tense game of dystopian subversion in which you take the role of either the 'dissidents' or the 'moderators' in a mind-bending battle of wits to determine the reality around you.&#10;&#10;Will you challenge the status quo and shatter your fragile reality or seek to protect the safety of what you know?&#10;&#10;Dissidents utilise matching underground codes to coordinate meetings at one of the disturbingly illustrated locations on your map. They then each secretly use their location dials to declare their intended meeting point.&#10;&#10;The Mods, in a short amount of time, then have to determine where they expect the Dissidents to meet by inferring their intent from a book of every possible code set the subversives could use, and agree upon a location to direct a state raiding party.&#10;&#10;Once they've agreed on a location, the Dissidents each reveal their location dials. Depending on whether the majority of Dissidents have successfully coordinated at a single location, or the Mods have caught them in an attempt at subversion will determine whether that location becomes 'hacked' or 'moderated'.&#10;&#10;As the game progresses, moderated locations produce potential accomplices for the Dissidents to recruit, as undesirables are driven from now sanitized districts. However, as the Dissidents progress their mission to 'hack' as many locations as possible, the Moderators strike back with increasing numbers of surveillance outposts, installed to limit the Dissident's ability to move around the city undetected.&#10;&#10;","minPlayers":3,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":60,"minAge":14,"categoriesAndMechanics":["Bluffing","Deduction","Real-time","Spies/Secret Agents","Word Game","Area Majority / Influence","Modular Board","Network and Route Building","Push Your Luck","Secret Unit Deployment","Simultaneous Action Selection","Team-Based Game"],"rating":2.933825,"complexity":1.6667,"urlThumb":"https://cf.geekdo-images.com/1erLse3FISQa3yyb9ADEBQ__thumb/img/RLSEvDBTfb2cV_Fmu_VDGRT1lf8=/fit-in/200x150/filters:strip_icc()/pic4531133.jpg","urlImage":"https://cf.geekdo-images.com/1erLse3FISQa3yyb9ADEBQ__original/img/wl-G5lmXJnNdhHMLY3gfNR_FgXg=/0x0/filters:format(jpeg)/pic4531133.jpg"},{"bggId":"18590","name":"RPGQuest","description":"A very colorful mixture of RPG and Boardgame, this Brazilian game is designed for children of Ages 8 - 10 as an introduction to Role Playing Games.&#10;&#10;The basic game has 7 races and 8 classes to choose from, over 120 paper fold-out miniatures, 30 rooms and corridors and dozens of props.&#10;&#10;","minPlayers":3,"maxPlayers":7,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Children's Game","Exploration","Fantasy","Cooperative Game","Dice Rolling","Modular Board","Role Playing"],"rating":4.22059,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/mpXUezz6pIv5ONLsdrRhoQ__thumb/img/oH0-cp-_dAYdOv6dRF2e7bxwVAQ=/fit-in/200x150/filters:strip_icc()/pic83125.jpg","urlImage":"https://cf.geekdo-images.com/mpXUezz6pIv5ONLsdrRhoQ__original/img/mNWUeFb3s5S6XKbKXHZ4I-CduCY=/0x0/filters:format(jpeg)/pic83125.jpg"},{"bggId":"254147","name":"Assault on the Castle","description":"In Assault the Castle, players are fierce medieval Lords who want to destroy opponents&rsquo; castles by using fearsome siege machines. At the beginning of the game, players, by using cards, physically build their own castles upon a special basement mat. With regards to the building phase, there actually are no limits, as long as the castles can stand properly. During the game, players turn-by-turn draw siege cards that activate siege machines. In such cases, players will throw cards against their opponents castles, to make them fall.&#10;&#10;The last standing castle wins the game!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":30,"minAge":6,"categoriesAndMechanics":["Action / Dexterity","Card Game","Medieval","Flicking","Player Elimination","Roll / Spin and Move","Stacking and Balancing"],"rating":3.165715,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/NTFAzotSiv7xEZr49EFZfA__thumb/img/uaJKiif1e_opSjiUlwP6nIRTDXE=/fit-in/200x150/filters:strip_icc()/pic4305637.jpg","urlImage":"https://cf.geekdo-images.com/NTFAzotSiv7xEZr49EFZfA__original/img/i8agHqHjd7QXzxPuhsqCFSlGIlo=/0x0/filters:format(jpeg)/pic4305637.jpg"},{"bggId":"3174","name":"Titan Strike! Battle for the Moon of Saturn","description":"The Martian Rebellion of 2093 had frayed the economic fabric of the entire Solar System. As the USA and USSR gambled on the development of interstellar colonization, the European Economic Community and the Hegemony of Eastern Asia surveyed the Outer System. Most important among the new colonies was Titan; the largest moon of Saturn, beneath whose barren surface lay the salvation of civilization - fissionable materials sufficient to feed Earth's hungry reactors. Cooperation marked the early efforts of the two colonizing powers, but by 2117 - twelve years after the first fissionable strike - economic and territorial disputes precipitated war. Titan Strike! Simulates the struggle between the EEC and the HEA in deep space and on Titan itself. Futuristic infantry teams on hover platforms, Titan environmental Combat Vehicles, drone robot tanks, and jet-powered hoppers clash in an all-out effort to secure Titan's ultimate treasure - energy sufficient to sustain Earth's crowded billions for a century&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":90,"maxPlayTime":90,"minAge":10,"categoriesAndMechanics":["Science Fiction","Wargame","Hexagon Grid"],"rating":2.91412,"complexity":2.5,"urlThumb":"https://cf.geekdo-images.com/Y7aTYjnG0C1BnPQvzOJRYg__thumb/img/DdpjLArTL-21ezId9RqO94YjXGA=/fit-in/200x150/filters:strip_icc()/pic69065.jpg","urlImage":"https://cf.geekdo-images.com/Y7aTYjnG0C1BnPQvzOJRYg__original/img/oFANmVwUATu7XymbnVLoitHL9ew=/0x0/filters:format(jpeg)/pic69065.jpg"},{"bggId":"91513","name":"Princess Magic Fairy","description":"In Princess Magic Fairy, players use a magic wand to cast spells on one another &ndash; kind of.&#10;&#10;On a turn, a player reveals one of the 32 spell cards in the game. If the card shows the kobold Kinkerlitz, then the kobold automatically claims the card. If the card shows something else, then the active player draws a picture of that item on another player's back. If that player guesses what that object is, the drawer claims the card; if not, then the kobold steals the card as punishment.&#10;&#10;If the players collectively earn eight spell cards before the kobold, then they win the game together.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":10,"maxPlayTime":10,"minAge":4,"categoriesAndMechanics":["Children's Game","Fantasy","Memory","Cooperative Game","Line Drawing"],"rating":2.83469,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/Hs9K6qgvr-MnZ6d2X2qjIQ__thumb/img/5ICGlaMYXpXwKT08Tu9vpNb-9uE=/fit-in/200x150/filters:strip_icc()/pic2527251.jpg","urlImage":"https://cf.geekdo-images.com/Hs9K6qgvr-MnZ6d2X2qjIQ__original/img/EjpeBZxs-47MawCwKJhcwsDEC2M=/0x0/filters:format(jpeg)/pic2527251.jpg"},{"bggId":"8409","name":"Red Baron","description":"Red Baron is a game of air warfare in World War I (1914-1918), based on designer Jim Hind's earlier Aces High game system. The game covers a variety of missions including photo recon, patrol, artillery spotting, balloon busting, trench strafing, bombing, and train busting. Data cards are included for 64 aircraft (some of which feature variant models on the same card). There are 12 scenarios.&#10;&#10;Red Baron represented an odd step in the history of the Aces High game system. Red Baron converts the game system to squares instead of hexes, as used in earlier and later editions of Aces High. In addition, Red Baron uses movement points that reflect 10 mph increments (down from 20) to further differentiate between aircraft.&#10;&#10;Published in The Wargamer Magazine number 48.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":120,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Aviation / Flight","Wargame","World War I","Simultaneous Action Selection"],"rating":3.0067,"complexity":3.2222,"urlThumb":"https://cf.geekdo-images.com/ikzc4XWCVUoOAArp1HQUrQ__thumb/img/tBYlRyOp3mth0Yu2yaHGDFaIR-E=/fit-in/200x150/filters:strip_icc()/pic35130.jpg","urlImage":"https://cf.geekdo-images.com/ikzc4XWCVUoOAArp1HQUrQ__original/img/_5pELLfx_zYP_vf3rTFZ7wMo9WQ=/0x0/filters:format(jpeg)/pic35130.jpg"},{"bggId":"1336","name":"Eden","description":"'Eden is the dream of making arid land fertile. At the outset, the board is a desert. Players play irrigation cards that allow them to place plant tiles in the desert, thus bringing life and fertility to it. As the desert grows, cultivation cards may develop the plant tiles further, making them more valuable and bringing players much manna. The player who first gets tiles valued at 20 &quot;fertility points&quot; on the board wins. But watch out! As the desert blooms competition for the land increases, and other players will try to take your most fertile land away.&#10;&#10;The game play in Eden is simple. Either play one or two irrigation cards to develop areas of desert (i.e. place tiles on the board), or play a cultivation card to increase the value of areas already on the board (i.e. replace existing tiles with more valuable ones, at a cost), or pass. Conflict enters the game when a player places a new tile on the board next to an opponent's existing tile. Then a challenge may be made by the player placing the tile. Manna, the currency in the game, is used in the challenge, which takes the form of a bidding war. Bids, which must be divisible by 5, are always increased. But what the winning bidder actually must pay is the bid MULTIPLIED by the value of the tiles that would be gained. In the case of the challenger, the winning bid would be the bid itself times the value of the tiles sought. In the case of the defender, the winning bid would be the bid itself times the value of the tiles the defender is using in what in effect is an attack. Bids keep rising until one player is unwilling, or unable, to meet the final cost of a bid. The loser forfeits all the tiles involved in the conflict, but gains the value of that land (according to the bid) in manna from the other player.&#10;&#10;","minPlayers":3,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Farming","Prehistoric","Auction/Bidding","Tile Placement"],"rating":2.80868,"complexity":2.2105,"urlThumb":"https://cf.geekdo-images.com/7qs1eKl3-cOcKq4YBY_40w__thumb/img/jnlpHpRVtleQuT6mKP6C5k47EQE=/fit-in/200x150/filters:strip_icc()/pic293846.jpg","urlImage":"https://cf.geekdo-images.com/7qs1eKl3-cOcKq4YBY_40w__original/img/jLSzUzseWKD0bdF5XUgVrd-q-PY=/0x0/filters:format(jpeg)/pic293846.jpg"},{"bggId":"8476","name":"Le Saghe di Conquest","description":"The game is very similar to Talisman, but characters move freely on a hex-board.&#10;&#10;Goal of the game is complete the personal Mission (that isn't a secret for all other players).&#10;&#10;Players can cooperate or fight each others to obstruct other players.&#10;&#10;","minPlayers":3,"maxPlayers":10,"minPlayTime":120,"maxPlayTime":120,"minAge":0,"categoriesAndMechanics":["Adventure","Dice","Exploration","Fantasy","Humor","Cooperative Game","Dice Rolling","Hexagon Grid","Roll / Spin and Move","Variable Player Powers"],"rating":3.116665,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/eXoGLuuz_9sF64RqdVf4qg__thumb/img/j9MwQcnCEcN5B7V8VE6LLEfbiWI=/fit-in/200x150/filters:strip_icc()/pic87760.jpg","urlImage":"https://cf.geekdo-images.com/eXoGLuuz_9sF64RqdVf4qg__original/img/Sho_C2eWIywUpQ6ApMdWdu5mKRM=/0x0/filters:format(jpeg)/pic87760.jpg"},{"bggId":"21717","name":"Tempête sur l'Europe 1939-1945","description":"Temp&ecirc;te sur l'Europe: la guerre en Europe, 1939-1945 (Tempest On Europe: the war in Europe) simulates the totality of the conflict which opposed the Western Allies and the Soviets to the Axis forces between September 1939 and May 1945.  This is primarily a solitaire game where the player will in turn be the offensive player for the Axis (early on) then take the offensive for the Allies after Stalingrad and El Alamein.  The rules take care of the passive player in each phase of the war.&#10;&#10;This game is based on Typhon sur le Pacifique rules (Vae Victis 40), which covered the war in the Pacific.&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":180,"maxPlayTime":180,"minAge":12,"categoriesAndMechanics":["Wargame","World War II","Area Movement","Dice Rolling","Solo / Solitaire Game"],"rating":3.033335,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/BIc3GPRODlnCD5d7C4K2GQ__thumb/img/AGoef8f53Ae2oBVWl2q-BSxdtnQ=/fit-in/200x150/filters:strip_icc()/pic110105.jpg","urlImage":"https://cf.geekdo-images.com/BIc3GPRODlnCD5d7C4K2GQ__original/img/mwUYLGmjv-4CQnumHKwgJZpFeU0=/0x0/filters:format(jpeg)/pic110105.jpg"},{"bggId":"319307","name":"Truth or Drink: The Card Game","description":"A simple modular drinking card game by Cut.com, spun-off from their web-series Truth or Drink. Every turn, a judge draws a question card and selects two people to either answer or drink.&#10;&#10;The game comes with four decks of progressively raunchier cards and a 'twist' deck, which can be mixed and matched to adjust the tone and interactivity of the game.&#10;&#10;These decks are: &#10;On The Rocks: Chill questions for mixed company&mdash;with just enough bite. &#10;Extra Dirty: Adult-themed questions&mdash;not safe for work!&#10;Happy Hour: For when you need help being nice.&#10;Last Call: Put your relationship to the ultimate test.&#10;With a Twist: Add a strategic gameplay element: redirect, rephrase, or throw a wrench into any question.&#10;&#10;The game is played to a determined number of points.&#10;&#10;Players win the round by giving a satisfying answer and being awarded the question card.&#10;&#10;","minPlayers":3,"maxPlayers":8,"minPlayTime":30,"maxPlayTime":60,"minAge":21,"categoriesAndMechanics":["Humor","Mature / Adult","Party Game","Player Judge"],"rating":3.07031,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/7Y1T0Iyj5BnS8D1rHlUCSQ__thumb/img/9TnNQpDzWlyJBrjl6wtWMV3Jpoo=/fit-in/200x150/filters:strip_icc()/pic5847608.jpg","urlImage":"https://cf.geekdo-images.com/7Y1T0Iyj5BnS8D1rHlUCSQ__original/img/X5j6BwQSjZwWsLGoBbd7NP1vocY=/0x0/filters:format(jpeg)/pic5847608.jpg"},{"bggId":"255341","name":"Hawaii, 1795: Kamehameha's War of Unification","description":"Skirmishes, raids, and abortive diplomacy had divided the Hawaiian Islands from one another. In 1795, Kamehameha unified the big island of Hawaii and set out to bring the other islands under one high king.&#10;&#10;This is a two-player game of Kamehameha&rsquo;s campaign of unification. One player controls the forces of Kamehameha, the other commands the allied chiefs of Oahu and Maui. Movement carries armies along the Hawaiian chain, followed by tactical combat for control of each island. Counters represent warriors, musketeers, pikemen, elite guards, cannons, and canoes.&#10;&#10;The game mechanics are based on the Ancient Wars system. Cards generate special events, such as intervention by the forces of Kauai, the acquisition of cannons from European powers, or granting one player tactical advantages or additional forces.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":90,"minAge":0,"categoriesAndMechanics":["Age of Reason","Wargame","Campaign / Battle Card Driven","Dice Rolling","Movement Points","Point to Point Movement","Simulation"],"rating":3.083335,"complexity":2.5,"urlThumb":"https://cf.geekdo-images.com/ANCpxP7X2iLVFegJxK40Rg__thumb/img/vlq8Jupxm2lRXFHkVpaLILXNb0Q=/fit-in/200x150/filters:strip_icc()/pic4541552.jpg","urlImage":"https://cf.geekdo-images.com/ANCpxP7X2iLVFegJxK40Rg__original/img/jzvNYEZfb6CDjPtqgGJhdrJxM_Y=/0x0/filters:format(jpeg)/pic4541552.jpg"},{"bggId":"223734","name":"Crazy Corral","description":"Nighttime is quickly approaching, and it's time to get the animals tucked into the barn. But what's going on? The animals keep running away. Are the other players causing this? A good memory and some luck with the die will help you in this crazy corralling game. The player who manages to corral all five of their animals into the barn first wins the game.&#10;&#10;Crazy Corral requires a good memory. While playing the game, players should try to remember where the other players' animals are as this becomes important during the game!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":10,"maxPlayTime":10,"minAge":4,"categoriesAndMechanics":["Animals","Children's Game","Dice","Memory","Dice Rolling","Memory","Set Collection"],"rating":2.991665,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/0dUCajSL-wILHq4jVti4sQ__thumb/img/n0DjNb3sDazfOSxXbi4Q6C6RObc=/fit-in/200x150/filters:strip_icc()/pic5381206.jpg","urlImage":"https://cf.geekdo-images.com/0dUCajSL-wILHq4jVti4sQ__original/img/LPfWqPfTtgIxwmq5h84VtnATcAI=/0x0/filters:format(jpeg)/pic5381206.jpg"},{"bggId":"369563","name":"Four Corners","description":"Four Corners is a living puzzle!  In this quick, fun, and captivating game, everyone has a different solution, but only the player who best manipulates the board and completes their puzzle will win! Four Corners comes in 2 themed editions:  Kaleidoscope and Galaxy.&#10;&#10;Players each start a game of Four Corners game with secret goals.  Every turn, you&rsquo;ll add, twist, rotate, and flip tiles to reach your goal.  This is achieved on the unique, patented Four Corners game board, which allows tiles to rotate and move without affecting neighboring tiles.  You score a goal either by creating sequences of four identical images, or by completing a full image from the corners of four tiles.  Watch out, because other players will also be shifting and changing the board to shape it the way they need.  The first player to achieve three of their secret goals wins!&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":40,"minAge":8,"categoriesAndMechanics":["Abstract Strategy","Children's Game","Puzzle","Hand Management","Modular Board","Solo / Solitaire Game","Tile Placement"],"rating":3.07576,"complexity":1.5,"urlThumb":"https://cf.geekdo-images.com/U1-xM-Ig--k-3Wd8STHFnw__thumb/img/nB54nBmPoeM85M-lHMbaWEdfDu4=/fit-in/200x150/filters:strip_icc()/pic7065709.jpg","urlImage":"https://cf.geekdo-images.com/U1-xM-Ig--k-3Wd8STHFnw__original/img/5MICAAT5nwHh3b0HTvtd67MPCbs=/0x0/filters:format(jpeg)/pic7065709.jpg"},{"bggId":"13295","name":"Sorry! Card Revenge","description":"Sorry! Card Revenge is sweet revenge taken to the next level! It's like the classic family favorite board game, in a easy-to-learn, fast talking card edition. Be the first to get rid of all of your cards, and win. But watch out for the sassy talking pawn. It dishes out extra cards, and attitude, too.&#10;&#10;Each player starts with seven cards and follows play directed by the talking pawn as, one by one, they try to play cards from their hand onto the discard pile by matching either the color (and playing one card) or by playing a sequence of cards in numerical orders. Sorry! cards can be played on opponents who then have to face the direction of the talking pawn after tapping the unit on the head. The pawn takes sweet revenge on players by doling out additional cards and attitude.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":15,"minAge":6,"categoriesAndMechanics":["Card Game","Electronic"],"rating":2.883185,"complexity":1.1667,"urlThumb":"https://cf.geekdo-images.com/vLkyc4pbq5bBe_qX2rxBWg__thumb/img/APan6lnfTPKKhzabcye7nYUEXUo=/fit-in/200x150/filters:strip_icc()/pic901608.jpg","urlImage":"https://cf.geekdo-images.com/vLkyc4pbq5bBe_qX2rxBWg__original/img/Ho1CyZB9cBfAJNAPyMwgRpLhFOc=/0x0/filters:format(jpeg)/pic901608.jpg"},{"bggId":"297555","name":"翡翠の商人 (Jade Merchant)","description":"In &#231;&#191;&#161;&#231;&#191;&#160;&#227;&#129;&#174;&#229;&#149;&#134;&#228;&#186;&#186; (Jade Merchant), players are the heads of trader caravans who try to accumulate the most valuable goods like gold, spices, and jade. Each round, they have to outbid each other backwards so that the least greedy one may choose the first cards of the current pool; more specifically, each player in turn declares how many cards they want to take, and whoever declares the smallest number takes that many cards. (A player can declare 0.5 less than the number they want to take, and if they do so, they return one card from their hand to the center.) The remaining players then bid for the rest of the cards, with this process repeating until each player takes cards.&#10;&#10;Each treasure has its own scoring rules depending on how many you have or how they combine with other cards in your collection. After resolving all cards this way, the player with the highest value of goods wins.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":20,"maxPlayTime":20,"minAge":10,"categoriesAndMechanics":["Auction/Bidding"],"rating":2.975805,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/21-jmo8XHWtPOgtBJYb2kA__thumb/img/5qzyLMRmzRcm36_WTDWoVqAslUk=/fit-in/200x150/filters:strip_icc()/pic5174878.jpg","urlImage":"https://cf.geekdo-images.com/21-jmo8XHWtPOgtBJYb2kA__original/img/Bs_OZ_abQ6_TJ-w5sXzZzwXTlr4=/0x0/filters:format(jpeg)/pic5174878.jpg"},{"bggId":"253683","name":"Doomsday Bots","description":"Doomsday Bots is a 2-4 player competitive board game that brings together elements of card drafting, dungeon running and player-vs-player combat. You and your fellow Mad Geniuses must scrounge for parts and assemble the best Bot you can, then race each other to the top of the Boss&rsquo;s Clock Tower. Work together or go it alone to defeat the Boss, but only one can escape to victory with the highly coveted Boss Loot!&#10;&#10;The game is set in a Steampunk Post-Apocalyptic world where all that has survived are Mad Geniuses and a virtually endless supply of moddable Bots! These Geniuses have got it into their head that they can do the End of the World better than the last guy. But there are less rare components left from the pre-apocalypse than there are inventors competing for them. So you&rsquo;d better strap on your Goggles and enter the fray. If anyone&rsquo;s going to end the world again, it&rsquo;s you!&#10;&#10;Seize the Doomsday!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Action Points","Dice Rolling","Open Drafting"],"rating":3.110295,"complexity":1.5,"urlThumb":"https://cf.geekdo-images.com/KvccMiz35YPZC6zF2yOf-Q__thumb/img/8mdODBVmCgCIxEv97MTK2fKNDOo=/fit-in/200x150/filters:strip_icc()/pic4175520.png","urlImage":"https://cf.geekdo-images.com/KvccMiz35YPZC6zF2yOf-Q__original/img/5LNy3rzm7rB0n0S4ysjLCTAJjXE=/0x0/filters:format(png)/pic4175520.png"},{"bggId":"263992","name":"Dodgy Dogs","description":"Dodgy Dogs is a beautifully designed card game all about badly behaved dogs, illustrated by visual artist Jean Jullien. Use strategy and luck to get rid of all of your Dodgy Dogs as quickly as possible. Because who wants a hand full of Dodgy Dogs, right? It's easy to play and suitable for people of all ages. We&rsquo;d love you to support us in making the game so you can have as much fun playing it as we have!&#10;&#10;At the start of the game, you are dealt a hand of Dodgy Dogs. They'll be one of four different sizes and they'll be performing one of ten different bad behaviours.&#10;&#10;Your aim is to get rid of all your Dodgy Dogs. The first player places one of their dogs down on the table. The player to their left must then match either the size, or the behaviour of that dog, and place theirs on top. If they can&rsquo;t, they have to pick up cards from the stock pile until they can place one down. And so it goes.&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":5,"maxPlayTime":20,"minAge":0,"categoriesAndMechanics":["Animals","Card Game","Hand Management","Lose a Turn","Take That"],"rating":3.036765,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/grc43im45X_SkP73C4Yofg__thumb/img/ib0qc5pLCTB0nbOvPxt8rz1xMiM=/fit-in/200x150/filters:strip_icc()/pic5230672.jpg","urlImage":"https://cf.geekdo-images.com/grc43im45X_SkP73C4Yofg__original/img/KwUic2e4Jc50vHQi6CjOYIolQHg=/0x0/filters:format(jpeg)/pic5230672.jpg"},{"bggId":"168535","name":"Mops Royal","description":"Players are building a 5x5 grid out of their tiles trying to position their tiles next to tiles sharing the colour or the symbol of the newly placed tile in order to create scoring opportunities for themselves. Every time you score you turn over one of the tiles used for scoring and can't use it again.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Animals","Pattern Building","Tile Placement"],"rating":3.058825,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/M_9RW-KKptFYqH2wFgO27Q__thumb/img/9Vv-u-_rzagAtuCT_ry9Hcxbe-k=/fit-in/200x150/filters:strip_icc()/pic2369462.jpg","urlImage":"https://cf.geekdo-images.com/M_9RW-KKptFYqH2wFgO27Q__original/img/XXQpReJiRYuDDVQjj9iFBazsHG4=/0x0/filters:format(jpeg)/pic2369462.jpg"},{"bggId":"113995","name":"Jask","description":"JASK is a dynamic game that can be played individually or in teams. At the start of the game, and each round, a card is selected. Players will have one or more counters positioned on different letters on the board. All players/teams have one minute to think of as many answers for the selected question using a letter on which one of their counters is positioned. The winner is the first person / team to get all 8 counters home.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":8,"categoriesAndMechanics":["Educational","Memory","Party Game","Paper-and-Pencil"],"rating":3.069445,"complexity":1.6667,"urlThumb":"https://cf.geekdo-images.com/q1u8yGg5tmekHUGk8OcyfA__thumb/img/J0khIWIa7jxrDQh4g8FRKKD2oIQ=/fit-in/200x150/filters:strip_icc()/pic2073620.jpg","urlImage":"https://cf.geekdo-images.com/q1u8yGg5tmekHUGk8OcyfA__original/img/uNWiZSgyEwvT1hEg5_kTiCJ4h6U=/0x0/filters:format(jpeg)/pic2073620.jpg"},{"bggId":"265527","name":"Portolano","description":"The 16th century, the age of renaissance. Sailing and maritime trade are flourishing, vast fleets belonging to shipping companies are crossing the seas around the world. There is fierce competition for the available commodities which must be delivered to harbors. The shortest sea route may not be the easiest one. To achieve your goal in becoming the best captain, you need to find the best routes, deliver your goods to the harbor at the right moment and should not think twice to go raiding a little at times. Your portolan chart, a navigation map lies already in front of you, the crew is awaiting your order, and the race is just about to begin.&#10;&#10;In Portolano, each players controls a ship at sea. With each step you move your ship to the next map tile (map consists of tiles randomly drawn at the beginning of the game). If this is a sea tile, the player can pick one resource (3 different goods or cannons) available on the island. Each sea tile allows for one additional special action. The most important one is ship building, letting players upgrade their ships, extend their cargo bay, increase their speed, or attacking power in battle.&#10;&#10;Other possible actions include e.g. trading goods (change them to other goods or rum). Once you move to a harbor, you sell the goods collected on the islands to get coins (each harbor has differing needs for products). The more goods you can sell in one go, the  more coins you will get.&#10;&#10;The players plan their next moves simultaneously, without knowing the plans of others. Therefore it may happen that a player moves to sea tile, where the goods are already taken by other players or to a harbor, where the demands have already been satisfied.&#10;&#10;Once everybody has moved their ships in the round, the wind indicator will be spun, the new wind direction determines the next move of the pirates, who are also on the prowl at sea. After this, the movement phase ends. There is a battle after the movement phase if players and/or the pirate are positioned on the same/adjacent tiles. The fights use dice rolling, the winner steals goods/coins/rum from the loser.&#10;&#10;Rum is considered to be an important commodity as well, it &quot;fuels&rdquo; the crew to sail the ship according to your orders. If any player runs out of rum, the crew rebels and the ship can move only in the direction that the wind takes it until the rum stock is refilled. The costs of moving the ship in terms of rum depends on your movement compared with the wind direction (upwind, tailwind, crosswind).&#10;&#10;The game ends as soon as any of the goods run out. The player who has the most coins wins the game (coins can be collected even at the end of the game by unlocking bonuses).&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":40,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Exploration","Nautical","Renaissance","Travel","Area Movement","Bias","Dice Rolling","Modular Board","Set Collection","Trading"],"rating":3.090835,"complexity":2.25,"urlThumb":"https://cf.geekdo-images.com/gmVLCWbfb3rhuwd05twBAw__thumb/img/9hSc-iPCIOJzG_A2Z3sNX_vVcb8=/fit-in/200x150/filters:strip_icc()/pic4506917.jpg","urlImage":"https://cf.geekdo-images.com/gmVLCWbfb3rhuwd05twBAw__original/img/YRpaYqNb6BcyaighSVT0i56H83s=/0x0/filters:format(jpeg)/pic4506917.jpg"},{"bggId":"113780","name":"Titty Grab","description":"Titty Grab is a game of quick reflexes. Game comes with a deck of sexy illustrated cards and a large life-like breast.&#10;&#10;The cards are dealt out equally to each player. Players take turns flipping cards face-up in front of them. When two identical cards are seen, a Titty Grab occurs. First person to grab the Titty wins  the match and the losing player must add the face up cards back to their hand. The first player to get rid of all of their cards wins the game. Someone grabbing the Titty without a match present has to take everyone's face up cards into his hand.&#10;&#10;Card illustrations include pictures of breasts, panties, and silhouettes. Some of the illustrations are very similar, adding to the difficulty of the game. Additional special rule cards further add complexity to the game.&#10;&#10;Titty Grab is similar in concept to Jungle Speed/Arriba!.&#10;&#10;","minPlayers":3,"maxPlayers":8,"minPlayTime":10,"maxPlayTime":10,"minAge":18,"categoriesAndMechanics":["Action / Dexterity","Card Game","Humor","Mature / Adult","Party Game","Pattern Recognition"],"rating":2.85091,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/Ny0py7JYZ709zinrEfd_ag__thumb/img/yA1ktKt9NfL6YbdP8rBJGKgzLGc=/fit-in/200x150/filters:strip_icc()/pic1172714.jpg","urlImage":"https://cf.geekdo-images.com/Ny0py7JYZ709zinrEfd_ag__original/img/KYvFtl67pdEckhd6C-M4z_x-j_g=/0x0/filters:format(jpeg)/pic1172714.jpg"},{"bggId":"30000","name":"Stratego: Transformers","description":"Which army will prevail in this battle of galactic proportions as Decepticons and Autobots battle head to head in this classic game of Battlefield strategy? Choose which side you&rsquo;ll align with &ndash; the red Autobot army or the gray Decepticon army. Carefully place your army pieces strategically throughout your side of the battlefield and let the face off begin. Recreate the classic conflict between Megatron and Optimus Prime or build your own battle scenario. But beware &ndash; some robots have the ability to gain special powers during their turn, and will switch from vehicle mode to giant robot mode in an instant!&#10;&#10;Gameboard comes with 30 gray army pieces, 30 red army pieces, display tray, label sheet, instructions and special powers and reference sheet.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":8,"categoriesAndMechanics":["Abstract Strategy","Movies / TV / Radio theme","Science Fiction","Memory","Secret Unit Deployment","Variable Player Powers"],"rating":2.91279,"complexity":1.5714,"urlThumb":"https://cf.geekdo-images.com/n6o3mDz9HSi6UsMDvmD_vw__thumb/img/kGV7c7jvUc4PWMFnz-2SUvZVWUw=/fit-in/200x150/filters:strip_icc()/pic474563.jpg","urlImage":"https://cf.geekdo-images.com/n6o3mDz9HSi6UsMDvmD_vw__original/img/qHLFELp4u0qdfdPSm89NmIBbt-Y=/0x0/filters:format(jpeg)/pic474563.jpg"},{"bggId":"370963","name":"Living Well Is the Best Revenge","description":"Living well is the best revenge, and the best way to live well is by unlocking your inner power! In this dice game of strategy and chance inspired by the art of Steven Rhodes, will you aim to unleash your point-gaining abilities, or plan ahead with powerful dice manipulation? Gain points during an opponent's turn and watch their good fortune become another path to your success. Be the first to reach your full potential and transform from zero to hero!&#10;&#10;The game is played over 3 rounds. The player with the most points at the end of the 3rd round wins.&#10;&#10;PLAYING A ROUND&#10;Players take turns rolling and resolving their dice individually. This continues until a player has unlocked all 10 of their ability cards, or only one player is left in the round.&#10;&#10;ON YOUR TURN&#10;When it is your turn to roll, follows these steps in order:&#10;1. Roll Dice&#10;Begin your turn by rolling your player dice and Power dice together.&#10;Each of your opponents rolls their Power dice only.&#10;2. Opponents Score&#10;Each of your opponents gains 1 point for each of their Power dice that matches BOTH 1 of their unlocked (faceup) ability cards AND at least 1 of your dice (either your player dice or Power dice).&#10;3. Use Unlocked Abilities&#10;Next, you (and only you) may use any number of your unlocked (faceup)ability cards, in any order.&#10;4. Unlock New Abilities&#10;After you use your abilities, add up the numbers on only your player dice to determine your player dice total (and apply any modifiers from unlocked ability cards if desired).&#10;Then choose a combination of your locked (facedown) ability cards that add up exactly to your player dice total, and flip each of them faceup to unlock it.&#10;You must choose a combination of cards that are ALL locked. For example, if your #1 card is already unlocked, you may not choose any combination of cards that include a 1 (regardless of what you rolled).&#10;If you have no combination of locked cards that add up to your player dice total, you may not unlock any new cards and are instead out of the round.&#10;After unlocking cards, your turn is over.&#10;&#10;There are 3 types of abilities:&#10;&#226;&#151;&#143; Power Die Ability (#1-6): In order to use a Power die ability, you must roll the matching number on at least 1 of your Power dice.&#10;&#226;&#151;&#143; Modify Player Dice Total (#7-9): Once you have unlocked one of these abilities, you may use it once per turn to modify your player dice total for unlocking new abilities (see Step 4). Do not change the die faces you rolled when modifying your total.&#10;&#226;&#151;&#143; Extra Power Die (#10): Once you unlock your yellow Power die, you may roll it for the rest of the round.&#10;&#10;    1. Power Die: Gain points equal to 1 of your dice.&#10;    2. Power Die: Gain a reroll token.&#10;    3. Power Die: Steal 3 points from another player.&#10;    4. Power Die: Score 1 point for each of your locked cards.&#10;    5. Power Die: Score 1 point for each of your unlocked cards.&#10;    6. Power Die: Choose a player to lose half their points, rounded down.&#10;    7. You may subtract 1 from your roll.&#10;    8. You may add 1 to your roll.&#10;    9. You may remove any 1 die from your roll.&#10;    10. Gain an additional Power die.&#10;&#10;&#10;-description from publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":30,"minAge":14,"categoriesAndMechanics":["Dice","Dice Rolling","Re-rolling and Locking","Take That"],"rating":3.03049,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/OFFSapCB0osuCrG4ZYywKQ__thumb/img/E6F4danU3oR017eNH_L9ukmEzQQ=/fit-in/200x150/filters:strip_icc()/pic7380054.jpg","urlImage":"https://cf.geekdo-images.com/OFFSapCB0osuCrG4ZYywKQ__original/img/g4_9My155WrOG51EQKXpvs8Lf48=/0x0/filters:format(jpeg)/pic7380054.jpg"},{"bggId":"4237","name":"El Alamein: Battles in North Africa, 1942","description":"EL ALAMEIN: Battles in North Africa, 1942, is an operational simulation, based on the KURSK Game System, of the battles between Rommel&rsquo;s Panzer Armee Afrika and Montgomery&rsquo;s Eighth Army near El Alamein from July through October 1942. The outcome of these bitterly-fought clashes finally ended Rommel&rsquo;s eastern drive towards Alexandria and the Suez Canal, and forced a defeated and burned-out Panzer Armee Afrika to begin the long retreat west towards Tunisia&#10;&#10;There are three scenarios; The First Battle of El Alamein (July 1942), Alam Halfa (Sept 1942) and Battle of El Alamein (Oct 1942).&#10;&#10;Time Scale: 1 day (24 hours) per game turn&#10;Map Scale: 5 kilometers per hex&#10;Unit Size: regiment/brigade/division&#10;&#10;Game Components:&#10;One 22&rsquo;&rsquo; x 28&rdquo; hexagonal grid Map Sheet (with Turn Record Track and Scenario OOB Set Up Locations incorporated)&#10;255 &frac12;&rdquo; cardboard Counters&#10;One 9&rdquo; x 11&frac12; &rdquo; map-fold Rules Booklet&#10;One 7&frac14;&rdquo; x 10&rdquo; combined Combat Results Table and Terrain Effects Chart&#10;One 7&frac14;&rdquo; x 12&rdquo; Scenario Variation Chart&#10;Two 8&frac12;&rdquo; x 11&rdquo; Errata Sheets (as 31 July 1973)&#10;One small six-sided Die&#10;One SPI 12&rdquo; x 15&rdquo; x 1&rdquo; flat 24 compartment plastic Game Box (with clear compartment tray covers) and clear plastic game cover with Title Sheet&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":120,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Wargame","World War II","Dice Rolling","Hexagon Grid","Simulation"],"rating":2.98913,"complexity":2.2857,"urlThumb":"https://cf.geekdo-images.com/AQV6yq6k1O6fgqkZQhOiWQ__thumb/img/q_safw2lcEs56leP4jWFxeU4M58=/fit-in/200x150/filters:strip_icc()/pic275005.jpg","urlImage":"https://cf.geekdo-images.com/AQV6yq6k1O6fgqkZQhOiWQ__original/img/VqdVHW7zG5BbbOUBbo_e5xV8HYs=/0x0/filters:format(jpeg)/pic275005.jpg"},{"bggId":"113517","name":"Quadefy","description":"From Publisher Website:&#10;&#10;Quadefy is a fast playing new strategy game played in three dimensions. Easy to learn and quick to play, Quadefy uses visual spatial skills and strategies that will keep you on your toes. When playing Quadefy, you have to think a little bit strategist and a little bit puzzle builder. Players take turns stacking their game pieces on the base, each attempting to keep their entire game piece &quot;in bounds.&quot; &quot;In bounds&quot; means that the piece must be completely over the game base and no more than four &quot;cubes&quot; high. The first player to force their opponent to have to play out of bounds, wins. Every move is both offensive and defensive, making Quadefy very fun to play. The rules have been drafted so that there is always a winner, no ties, stalemates, or cat's games. Hand crafted from high quality hardwoods, Quadefy is pretty enough to be left out on the coffee table or bookshelf to be played again and again.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":3,"maxPlayTime":3,"minAge":4,"categoriesAndMechanics":["Abstract Strategy","Tile Placement"],"rating":2.888835,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/m7NL1DTrk44JciQicl39yQ__thumb/img/1p0h8jlXQRBhXlv9lqSlS1xx050=/fit-in/200x150/filters:strip_icc()/pic1171935.jpg","urlImage":"https://cf.geekdo-images.com/m7NL1DTrk44JciQicl39yQ__original/img/vzaAfVDIBI2GnWEp9TqQQhPJoFs=/0x0/filters:format(jpeg)/pic1171935.jpg"},{"bggId":"131304","name":"Circus Grandioso","description":"Game description from the publisher&#10;&#10;In Circus Grandioso, players combine forces to create an unbelievably &quot;pyramid of acrobatic animals&quot;. Whoever plays the topmost card on the pyramid gets the Show Master token &ndash; but only so long as no other player can play a card higher up the pyramid. Whoever holds the Show Master token at the end of the game wins.&#10;&#10;The cards can also be used to play a solitaire game.&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":15,"minAge":8,"categoriesAndMechanics":["Animals","Bluffing","Card Game","Hand Management"],"rating":2.864375,"complexity":1.25,"urlThumb":"https://cf.geekdo-images.com/MuVoley0pWTi-3N_3ipCdw__thumb/img/qf_2IOjX9i1G5N8oXlRp6GPbfDI=/fit-in/200x150/filters:strip_icc()/pic1431487.jpg","urlImage":"https://cf.geekdo-images.com/MuVoley0pWTi-3N_3ipCdw__original/img/C3yzG3avp1IE31MMKQOnNYi46Zo=/0x0/filters:format(jpeg)/pic1431487.jpg"},{"bggId":"64430","name":"Niche","description":"The game where it pays to be different!&#10;&#10;Niche is a quick, fun and deceptively simple card game. It is a game of bucking the trend, keeping your options open and closing down the opposition. Will you play safe and pick up your points where you can or take a risk and hold out for a better score?&#10;&#10;During Niche you play cards from your hand restricted by the previous card played. Players create an irregular grid pattern that is limited only by the edge of the table and score points depending on the length of the lines they create.&#10;&#10;The rule structure of Niche involves a restriction of choices, each player must select cards from their hand, and it is these choices that give the sense of control. On a reasonably basic level this becomes a gentle balance between puzzle solving and tactics whilst at the same time I hope that players are having so much fun they don&rsquo;t realize quite how much they are using their brain.&#10;&#10;Niche takes between 10 minutes and a whole evening to play.&#10;&#10;The game aims to promote and support The Foundation for Conductive Education. This method works with children and adults who have conditions such as Cerebral Palsy, Stroke, M.S. or Parkinsons, helping them to lead more independent lives.&#10;&#10;","minPlayers":2,"maxPlayers":7,"minPlayTime":10,"maxPlayTime":10,"minAge":6,"categoriesAndMechanics":["Abstract Strategy","Card Game","Educational","Puzzle","Pattern Building","Pattern Recognition","Set Collection","Trick-taking"],"rating":3.255265,"complexity":1.375,"urlThumb":"https://cf.geekdo-images.com/3kS5wO6ZokMHkQ5BMMSy1g__thumb/img/AA-zpeXSQWbYdp045FVoFBrkRL8=/fit-in/200x150/filters:strip_icc()/pic739002.jpg","urlImage":"https://cf.geekdo-images.com/3kS5wO6ZokMHkQ5BMMSy1g__original/img/J-eh4uHx_6mHMbuKBG4xd9t9T5M=/0x0/filters:format(jpeg)/pic739002.jpg"},{"bggId":"38286","name":"The Solomons Campaign (Second Edition)","description":"Game description from the publisher:&#10;&#10;The Solomons Campaign is an extensive redesign of the old-SPI game of the same name originally designed and published by James F. Dunnigan in 1973. It presents a two-player, complex historical simulation of the air, sea and land campaigns waged on and around the island of Guadalcanal in the summer and fall of 1942. The game begins with the American invasion of that island and includes the subsequent Japanese attempts to retake it. The game is intended to be a simulation of combined air-naval-ground operations, or what are today called &quot;joint operations&quot;. Consequently it centers on modeling command and staff systems, focusing on the difficulties and advantages inherent in sequenced interactions between and among air, naval and ground forces.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Nautical","Wargame","World War II","Hexagon Grid"],"rating":3.056665,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/lg3kVNhONsyrbqHL1SjNzA__thumb/img/eLFUN_UjUTbfiyIsUBHerQEqq0g=/fit-in/200x150/filters:strip_icc()/pic376470.jpg","urlImage":"https://cf.geekdo-images.com/lg3kVNhONsyrbqHL1SjNzA__original/img/RBm41hmy2SiKGTKKgY60ssmojWQ=/0x0/filters:format(jpeg)/pic376470.jpg"},{"bggId":"178937","name":"El Capitan","description":"In El Capitan, players have a series of pictures in front of them and are trying to memorize their locations. These pictures are then flipped face down. During each turn, a card is revealed from the draw pile: players have to place their  boats as quickly as possible on the corresponding card in front of them! Be one of the quickest players to make sure you get some gold. But be careful, as the old Captain has a few tricks up his sleeves which will test your reaction time. Only the richest pirate at the end of the game will be worthy of his ship and title!&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":20,"minAge":6,"categoriesAndMechanics":["Action / Dexterity","Children's Game","Memory","Pirates","Memory"],"rating":2.89243,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/06VFwFZb99qkd_2yFy480w__thumb/img/xN-XYFKDwdHSpOXRVcasm7H3iWE=/fit-in/200x150/filters:strip_icc()/pic3488237.jpg","urlImage":"https://cf.geekdo-images.com/06VFwFZb99qkd_2yFy480w__original/img/0VTA_aeRRzUhTGrauxio8Rw_Zzk=/0x0/filters:format(jpeg)/pic3488237.jpg"},{"bggId":"320136","name":"Naruto: Ninja Arena","description":"The Ch&ucirc;nin exams are in full swing ! This is a great opportunity for Naruto, Sasuke, Sakura and Shikamaru to spar in frenzied bouts and practice mastery of their techniques and special powers. The young Ninjas will use their skills to the best of their ability and try to bring down their rivals by inflicting damage that will add up to wounds, knock outs, or even worse, final elimination. The last Ninja standing wins!&#10;&#10;Naruto: Ninja Arena is the first game using the Roll &amp; Clash system. During the game, you throw your dice as quickly as you can and use the results to activate Techniques without stopping the game. Everyone plays at the same time in a frantic battle to be the last Ninja Standing! The game ends when all players are K.O. or eliminated except one.&#10;&#10;&mdash;description from publisher&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Comic Book / Strip","Dice","Real-time","Chaining","Dice Rolling","Player Elimination","Real-Time","Simultaneous Action Selection","Take That","Variable Player Powers"],"rating":2.97924,"complexity":1.3333,"urlThumb":"https://cf.geekdo-images.com/1Vf2wwNbZZL9Xpz00n8sog__thumb/img/IAlyJOZsoDXdmxHZBKBy36YQeYo=/fit-in/200x150/filters:strip_icc()/pic5714545.jpg","urlImage":"https://cf.geekdo-images.com/1Vf2wwNbZZL9Xpz00n8sog__original/img/vdJhJstmt6y1NbTlg0C4CT_apOY=/0x0/filters:format(jpeg)/pic5714545.jpg"},{"bggId":"137331","name":"Terzetto","description":"Game description from the publisher:&#10;&#10;Outwit and outplace your opponent in Terzetto, a clever game of marble maneuvers. Take turns placing sets of three marbles onto your board according to the pattern in the shaker. The game starts off easy, but you'll need a keen eye and a bit of luck to make everything fit. Fill your board before your opponent, and you clearly know how to mind your marbles!&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":15,"maxPlayTime":15,"minAge":8,"categoriesAndMechanics":["Abstract Strategy"],"rating":2.88214,"complexity":1.2,"urlThumb":"https://cf.geekdo-images.com/ziF77O-q4Ndrf38s2M2MBA__thumb/img/uhlSfezPSqasgbB4re8Iaf7M9ts=/fit-in/200x150/filters:strip_icc()/pic1548862.jpg","urlImage":"https://cf.geekdo-images.com/ziF77O-q4Ndrf38s2M2MBA__original/img/JEaT0-GGdEcBvLCWDua-zoWzHOU=/0x0/filters:format(jpeg)/pic1548862.jpg"},{"bggId":"351067","name":"Polar Smash","description":"Polar Smash, which debuted as Igloo Mania, is a game that requires a steady hand! Keep your cool! Don't let the pressure and tension get to you or Parka Pete could fall to his feet - straight through the igloo! Parka Pete has finally placed his last block of ice to complete his igloo. But those pesky penguins have to ruin everything! They're playing a game with their ice picks and pulling out the ice blocks, unbeknownst to Parka Pete. Don't be the penguin who lets him fall into his igloo - or you'll be the losing penguin and Parka Pete will have to start his igloo all over again. A game easy enough for the kids to set up and play on their own, but a fun enough game that even the adults will want to play!&#10;&#10;The player who collapses the igloo loses, then the player who has collected the fewest ice blocks wins.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":15,"minAge":5,"categoriesAndMechanics":["Action / Dexterity","Animals","Children's Game","Tile Placement"],"rating":2.928205,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/k69iOjkHz6wyNP6ZvdyCRg__thumb/img/mX51fs3raqX0FopN2mSm4u4hHjU=/fit-in/200x150/filters:strip_icc()/pic4305667.jpg","urlImage":"https://cf.geekdo-images.com/k69iOjkHz6wyNP6ZvdyCRg__original/img/eQ-kz2ZxSYeer8If8Sp-CtfgVL0=/0x0/filters:format(jpeg)/pic4305667.jpg"},{"bggId":"216330","name":"Irány a Kincses Sziget!","description":"Description from the publisher (translated):&#10;&#10;Ir&aacute;ny a Kincses Sziget! (Destination: Treasure Island) is formally a race game, but in fact you need to employ tactics to meet challenges, complete missions and earn victory points. Your decisions will largely influence your score, although elements of luck are also present in the game.&#10;&#10;2-4 pirate ships set to sea to reach Treasure Island ahead of the others. But being the first is not enough: the real winner will be the one who scores best in the various challenges on the way. &#10;The pirates (48 character cards) have certain skills of different strength which can be boosted by using the appropriate weapons and tools (24 weapon cards). The set of cards held by players in hand continuously changes as cards are played and replaced during actions. This determines the actual power of a player&rsquo;s crew when facing a particular challenge.  Playing the cards tactfully can earn considerable advantage and valuable treasures for players, which will improve their final score.&#10;&#10;The game starts with an empty board and a series of blank fields on the sea, leading to Treasure Island. As the ships move ahead, the board is gradually filled with event cards randomly drawn, all indicating an action. Players will gather and sell pearls, trade with weapons, spy out and occupy islands, collect treasures, complete various missions or even kidnap other&rsquo;s sailors.  Often they master their skills to compete against each other or fight the forces of nature.&#10;&#10;The winner will be the player who achieves the most victory points by sailing fast, completing missions and having a valuable collection of treasures.&#10;&#10;Description from the publisher:&#10;Ir&aacute;ny a Kincses Sziget!&#10;Verseng&eacute;s &eacute;s k&uuml;zdelem a tengeren&#10;&#10;Az Ir&aacute;ny a Kincses sziget! formailag egy versenyj&aacute;t&eacute;k, de a gy&#197;&#145;zelemhez j&oacute; taktik&aacute;ra &eacute;s n&eacute;mi szerencs&eacute;re is sz&uuml;ks&eacute;g van. &#10;N&eacute;h&aacute;ny kal&oacute;zhaj&oacute; nagy zs&aacute;km&aacute;ny rem&eacute;ny&eacute;ben nekiv&aacute;g a tengernek, hogy a t&ouml;bbiek el&#197;&#145;tt &eacute;rjen el a Kincses szigetre. Azonban ha ez valamelyik&uuml;knek siker&uuml;l, m&eacute;g nem jelenti azt, hogy megnyerte a partit, csup&aacute;n azt, hogy a j&aacute;t&eacute;k a v&eacute;g&eacute;hez &eacute;rt. A gy&#197;&#145;zelem ugyanis a legt&ouml;bb pontot &ouml;sszegy&#197;&#177;jt&#197;&#145; j&aacute;t&eacute;kos&eacute; lesz, a pontszerz&eacute;s pedig els&#197;&#145;sorban a hossz&uacute; tengeri &uacute;t esem&eacute;nyei r&eacute;v&eacute;n t&ouml;rt&eacute;nik. A sz&aacute;mtalan v&aacute;ratlan fordulat (&ouml;sszesen 64 k&uuml;l&ouml;nb&ouml;z&#197;&#145; esem&eacute;nyk&aacute;rty&aacute;n) n&eacute;ha csup&aacute;n a soron l&eacute;v&#197;&#145; j&aacute;t&eacute;kost &eacute;rinti, de gyakran fordul el&#197;&#145;, hogy a j&aacute;t&eacute;kosok egym&aacute;ssal k&uuml;zdenek meg &ndash; p&eacute;ld&aacute;ul egy p&aacute;rbajban vagy &uuml;zk&ouml;zetben.&#10;&#10;A kal&oacute;zhaj&oacute;k leg&eacute;nys&eacute;g&eacute;t (48 k&uuml;l&ouml;nb&ouml;z&#197;&#145; karakter) &eacute;s azok fegyvereit, eszk&ouml;zeit k&aacute;rty&aacute;k k&eacute;pviselik. Ezek folyamatosan cser&eacute;l&#197;&#145;dnek a j&aacute;t&eacute;kosok kez&eacute;ben, ahogy kij&aacute;tssz&aacute;k &#197;&#145;ket az egyes akci&oacute;k sor&aacute;n. A matr&oacute;zok m&aacute;s-m&aacute;s m&eacute;rt&eacute;kben rendelkeznek bizonyos k&eacute;pess&eacute;gekkel: haj&oacute;z&aacute;si ismeretek, fizikai er&#197;&#145;, furfang &eacute;s befoly&aacute;s, karizma. E k&eacute;pess&eacute;geiket a megfelel&#197;&#145; fegyverekkel jav&iacute;thatj&aacute;k, &iacute;gy a j&aacute;t&eacute;kosok k&eacute;zben tartott lapjainak mindenkori &ouml;sszet&eacute;tele hat&aacute;rozza  meg, milyen er&#197;&#145;t k&eacute;pviselnek egy-egy akci&oacute;ban, avagy le tudj&aacute;k-e gy&#197;&#145;zni az akad&aacute;lyokat. Aki okosan j&aacute;tssza ki a lapjait, nagy el&#197;&#145;nyre tehet szert &eacute;s mes&eacute;s kincseket zs&aacute;km&aacute;nyolhat, ami sz&aacute;m&iacute;t a v&eacute;gs&#197;&#145; &eacute;rt&eacute;kel&eacute;sn&eacute;l.&#10;&#10;Az &uuml;resen indul&oacute; j&aacute;t&eacute;kt&aacute;bla minden alkalommal m&aacute;s &eacute;s m&aacute;s lesz, mivel az esem&eacute;nyek sorozata &ndash; esem&eacute;nyk&aacute;rty&aacute;k h&uacute;z&aacute;sa &eacute;s elhelyez&eacute;se r&eacute;v&eacute;n &ndash; v&eacute;letlenszer&#197;&#177;en alakul. A j&aacute;t&eacute;kosoknak lehet&#197;&#145;s&eacute;ge van gy&ouml;ngykagyl&oacute;kat felsz&iacute;nre hozni, majd az igazgy&ouml;ngy&ouml;ket eladni, kif&uuml;rk&eacute;szni egyes ismeretlen szigetek v&eacute;delmi erej&eacute;t, majd megt&aacute;madni, elfoglalni &eacute;s kirabolni azokat, kincseket gy&#197;&#177;jteni, k&uuml;ldet&eacute;seket teljes&iacute;teni, elcs&aacute;b&iacute;tani egym&aacute;s matr&oacute;zait, &ouml;sszem&eacute;rni erej&uuml;ket haj&oacute;z&aacute;si ismeretekben &eacute;s &uuml;gyess&eacute;gben, mik&ouml;zben meg kell k&uuml;zdeni&uuml;k a term&eacute;szet erej&eacute;vel is.&#10;&#10;Az gy&#197;&#145;z, aki a legmagasabb pontsz&aacute;mot &eacute;ri el a gyorsas&aacute;g, a teljes&iacute;tett k&uuml;ldet&eacute;sek &eacute;s az &ouml;sszegy&#197;&#177;jt&ouml;tt kincsek besz&aacute;m&iacute;t&aacute;s&aacute;val.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":75,"minAge":8,"categoriesAndMechanics":["Action / Dexterity","Collectible Components","Exploration","Fighting","Nautical","Pirates","Racing","Hand Management","Open Drafting","Set Collection","Variable Player Powers"],"rating":3.27576,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/ifprjaqcjDqOpZW4uD5Pcw__thumb/img/AXFcJW0tpsyjvZSxcat6mVGQOmE=/fit-in/200x150/filters:strip_icc()/pic3415163.jpg","urlImage":"https://cf.geekdo-images.com/ifprjaqcjDqOpZW4uD5Pcw__original/img/CGfhBku8tB68izE4laTPp_mbADw=/0x0/filters:format(jpeg)/pic3415163.jpg"},{"bggId":"32409","name":"Wiochmen 2","description":"A sequel to Wiochmen Rejser. The countryfellows want another race! This time the cards are more colorful (and there are more of them), the rules are more complicated, and the characteristic countryside-related humor is as good as it was before... The game is also more interactive.&#10;&#10;Now up to six peasants may race in their carts using... cards. Some cards represent parts of a narrow country road (with many holes and other traps), the others are played to speed up a player's cart or slow down the opponents.&#10;&#10;Cart Race! Dynamic play! Unforgettable fun!&#10;&#10;Do you want to be the first one to get to the local barn for the show with the greatest band in the neighborhood? Do you want to be the best in the whole district? Show how fast your cart is. Get your whip, call the kids for the ballast and hop on the buck - the race is about to start! In &quot;Wiochmen 2&quot; only the toughest men win. Be the best driver! Become The HyperCartMan.&#10;&#10;The game includes:&#10;&#10;- 88 cards&#10;- 20 markers&#10;- 8 pawns&#10;- the rulebook&#10;- a funny beret&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":30,"minAge":0,"categoriesAndMechanics":["Card Game","Humor","Racing","Hand Management","Modular Board","Variable Player Powers"],"rating":2.84283,"complexity":1.48,"urlThumb":"https://cf.geekdo-images.com/eosZZafFVbOte4Tlg0IzqQ__thumb/img/MaarRaxB4swclU-LvHjKKBu1ceQ=/fit-in/200x150/filters:strip_icc()/pic344448.jpg","urlImage":"https://cf.geekdo-images.com/eosZZafFVbOte4Tlg0IzqQ__original/img/q-7C4GftZoIQSE3IYR8i7XFLXYg=/0x0/filters:format(jpeg)/pic344448.jpg"},{"bggId":"6954","name":"InterUrban","description":"As America expanded in the 1920s and 1930s, suburbs grew rapidly around the densely populated urban areas. High-speed InterUrban trains like the &quot;Comet&quot; served these suburbs, carrying all manner of people to work and then home.&#10;&#10;Different InterUrban lines competed to reap the most revenue from the surrounding suburbs. Track was laid, trackage rights negotiated, and suburban stations built.&#10;&#10;This game has been redone as Gondoliere, which is very similar.&#10;&#10;","minPlayers":3,"maxPlayers":5,"minPlayTime":60,"maxPlayTime":60,"minAge":12,"categoriesAndMechanics":["Print & Play","Trains","Tile Placement"],"rating":2.916665,"complexity":1.6667,"urlThumb":"https://cf.geekdo-images.com/T6rAb8KBbwbGDmZ-7G7o1A__thumb/img/QxUfpItigP9uiSq5uEUXDIMYPe0=/fit-in/200x150/filters:strip_icc()/pic1249861.jpg","urlImage":"https://cf.geekdo-images.com/T6rAb8KBbwbGDmZ-7G7o1A__original/img/acIeLLIV4IMuvpPu1dh0G0igfXA=/0x0/filters:format(jpeg)/pic1249861.jpg"},{"bggId":"146204","name":"Ruckus: The Goblin Army Game","description":"Ruckus: The Goblin Army Game is a tactical war game that introduces an innovative army formation mechanic to create fast, intense combat for 2-4 players. Players choose from one of four unique Goblin Guilds, each with a special set of skills and tactical advantages, and build their army to destroy anyone that stands in their way. As battles are won and lost, players gain Victory cards, Victory Points, or the ability to upgrade their army. Who will be victorious, the mighty Fighters, the cunning Thieves, the powerful Clerics, or the magical Necromancers?&#10;&#10;To begin the game, players set up the Camp, the area of the game board housing Victory Point Tokens, action markers, the Kicker card deck, the Victory card deck, and the Upgrade deck. Next, players choose a Goblin Guild consisting of 25 units. In addition to the starting units of each Guild, players have 12 draft points to use in order to draft additional units to create their own unique army. All remaining units that are not drafted are combined to create the Upgrade deck.&#10;&#10;Players will compete in battle to gain 5 valuable Victory cards. Players will secretly set up their army's battle formation behind a Battle Screen. After shuffling their unit cards,  players will draw 5 cards into their hand. These 5 cards are then set up into a battle formation consisting of 1-3 units in the first row, 1-2 units in the second, and an optional 1 unit in the third combat row. Once all players' formations are complete, players remove their Battle Screens and combat begins. Players may first recruit any available units to their army, and may then choose to activate 1 combat skill per round. Next, damage between opposing Guilds is declared and resolved. As units take damage and are defeated, they are removed from combat and are placed in a player&rsquo;s discard pile. Combat continues until one Guild is left standing, with the winner gaining the first Victory card and its benefits. Players who lose the combat round may chose to upgrade a unit in their army. Once the 5th Victory card has been won, the player with the most Victory Points is declared the winner.&#10;&#10;Who will be victorious? Will it be the Mighty Fighters, the Cunning Thieves, the Powerful Clerics, or the Magical Necromancers? Choose your guild! Draft your army! Destroy your enemies!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":20,"minAge":8,"categoriesAndMechanics":["Card Game","Comic Book / Strip","Fantasy","Fighting","Humor","Deck, Bag, and Pool Building","Hand Management","Open Drafting"],"rating":3.02474,"complexity":2.1111,"urlThumb":"https://cf.geekdo-images.com/Mmrq0KYEWaXBwaMennl_sQ__thumb/img/KdhACnHHnZ5cUspw6hc9DrvbzXc=/fit-in/200x150/filters:strip_icc()/pic1989262.png","urlImage":"https://cf.geekdo-images.com/Mmrq0KYEWaXBwaMennl_sQ__original/img/aFxIq0oQqFQBs7hy74XthyE0QBM=/0x0/filters:format(png)/pic1989262.png"},{"bggId":"8835","name":"Stars and Bars","description":"Stars and Bars is a wargame that recreates on an operational scale this Civil War battle [Oct 8, 1862, the Battle of Perryville, Kentucky.  Union Gen. Buell against the Confederate Army of Mississippi and Gen Bragg].&#10;Historically this was a victory for the South, although at a price of very heavy casualties.&#10;&#10;Published in The Wargamer Magazine # 30 with Lesnaja: 'The Mother of Poltava' September 29, 1708.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":240,"maxPlayTime":240,"minAge":12,"categoriesAndMechanics":["American Civil War","Post-Napoleonic","Wargame","Dice Rolling","Hexagon Grid","Zone of Control"],"rating":3.039585,"complexity":3.1667,"urlThumb":"https://cf.geekdo-images.com/Hy0P1fipP5KHXjq_T2jj9A__thumb/img/rvpQHrwwwO-64aKD6TTrhent5hk=/fit-in/200x150/filters:strip_icc()/pic133902.jpg","urlImage":"https://cf.geekdo-images.com/Hy0P1fipP5KHXjq_T2jj9A__original/img/LBy5gu1adwEqHWyYK7RgvpOxN0Y=/0x0/filters:format(jpeg)/pic133902.jpg"},{"bggId":"1956","name":"Game of Dracula","description":"Ages 7 and up&#10;&#10;&quot;A fiendish game of suspense and fun!  Players plot their escape from Dracula's castle and move stealthily towards the exit.  But beware!  Dracula prowls the castle looking for a victim...&quot;&#10;&#10;The first player to suffer Dracula's bite becomes the &quot;green vampire&quot; and dons the green vampire's face mask.  This vampire then flits from room to room, seeking another victim to take over his role.  Any further victims of Dracula go back to the vault and must attempt their escape from square one again.  The Dracula and Green Vampire pieces actually engulf the players' playing pieces when they're &quot;bitten&quot;.&#10;&#10;A simple, fun chase game.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":60,"minAge":7,"categoriesAndMechanics":["Children's Game","Horror","Novel-based"],"rating":2.8625,"complexity":1.5,"urlThumb":"https://cf.geekdo-images.com/Gfwf_uEMA23138nRmXpLRw__thumb/img/OGKd-aUGUACWe5CrrmlNWbSOBDU=/fit-in/200x150/filters:strip_icc()/pic409091.jpg","urlImage":"https://cf.geekdo-images.com/Gfwf_uEMA23138nRmXpLRw__original/img/b7HR3Gyvm7mH7_JIUO9tHsFWxl8=/0x0/filters:format(jpeg)/pic409091.jpg"},{"bggId":"1274","name":"Cue Me!","description":"This game is played with partners.  One member of the team draws a card, rolls a 6 sided die to know what catagory they will be playing.  There are 4 dice with the letters of the alphabet on them that are rolled.  4 word clues are given to your team mate that start with the letters rolled.  Each time you roll to get new letters, the answer is worth less points.  A board is provided to keep track of the score.&#10;&#10;","minPlayers":3,"maxPlayers":8,"minPlayTime":60,"maxPlayTime":60,"minAge":0,"categoriesAndMechanics":["Party Game","Word Game","Dice Rolling","Team-Based Game"],"rating":2.954165,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/qJdWP5yOG00j2eum5xoQrg__thumb/img/15ymIZCnevpTXUs5IfAu1H_bNBw=/fit-in/200x150/filters:strip_icc()/pic785159.jpg","urlImage":"https://cf.geekdo-images.com/qJdWP5yOG00j2eum5xoQrg__original/img/SexSVs39v1EXbccllOpzmPehlQk=/0x0/filters:format(jpeg)/pic785159.jpg"},{"bggId":"286661","name":"Chope!","description":"Singaporeans love to eat. But where there is love, there is war.&#10;&#10;Seize your food and capture your table! Even if you can carry one more plate, will you be able to chope (reserve) enough tables to eat in peace? Or siam (evade) the dreaded mynahs when they come for your food? Grab your friends and family to play this fast-paced hawker-approved game!&#10;&#10;Chope is a captivating blend of dexterity and push your luck, in a small box that packs as much flavour as your laksa or mutton briyani. Come and have a taste!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":3,"maxPlayers":6,"minPlayTime":15,"maxPlayTime":20,"minAge":6,"categoriesAndMechanics":["Action / Dexterity","Push Your Luck","Set Collection"],"rating":2.947715,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/j_Q3g1lyz4UMfkwOcQQqcw__thumb/img/GtGByFCJkIl_UVyt7_NhL0AXQwA=/fit-in/200x150/filters:strip_icc()/pic6388184.png","urlImage":"https://cf.geekdo-images.com/j_Q3g1lyz4UMfkwOcQQqcw__original/img/7kRNA3tZgkHaB3jKI3gBl2jdzLo=/0x0/filters:format(png)/pic6388184.png"},{"bggId":"6526","name":"Dragon Lords","description":"From the back of the box:&#10;&#10;Welcome to Dragon Lords, the game of fantastic battles between fierce dragons.  In Dragon Lords, each player controls a dragon involved in an awesome battle.  Players move their dragons about the maps, jockeying for the best position from which to unleash their breath weapons upon their hapless opponents and hurling themselves headlong into mid-air mortal combat.&#10;&#10;Dragon Lords is a fast-paced game sure to please and lover of fantasy.  The forty page rulebook covers how to fight with dragons of all sorts.  It contains 12 ready-made dragons, plus easy-to-use rules for how to design up to 625 types of dragons, each of which can use any of the five different types of riders.&#10;&#10;The first part of the book features the introductory rules which can be read and learned by the most inexperienced gamer in a single sitting.  But the fun doesn't stop there!  The rulebook also contains a full set of advanced and optional rules that add even more complexity and realism to the game.  Even the most die-hard dragon fans will find what they want in Dragon Lords.&#10;&#10;This game contains a forty page rulebook with 12 &quot;ready made&quot; dragon play sheets, scenarios, game log and blank play sheet.  Two quick reference cards.  A set of 70 altitude and combat counters.  Six metal dragons, riders and plastic mounting stands.  (Models do not come assembled or painted.)  Four dice.  Six full color map sheets overlaid by a hexagonal grid.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":120,"maxPlayTime":120,"minAge":10,"categoriesAndMechanics":["Fantasy","Fighting","Miniatures","Dice Rolling","Grid Movement","Hexagon Grid","Movement Points","Paper-and-Pencil","Player Elimination","Scenario / Mission / Campaign Game","Simulation","Simultaneous Action Selection","Team-Based Game","Three Dimensional Movement","Variable Set-up"],"rating":3.05,"complexity":1.8,"urlThumb":"https://cf.geekdo-images.com/qgZbP2d62SowyYUInvviQA__thumb/img/WjzzKmxvM0Lq_f7LPMUud-MZc6o=/fit-in/200x150/filters:strip_icc()/pic395227.jpg","urlImage":"https://cf.geekdo-images.com/qgZbP2d62SowyYUInvviQA__original/img/pt7ef0Pllw7PqY3e9yewklznh9c=/0x0/filters:format(jpeg)/pic395227.jpg"},{"bggId":"118515","name":"Piranhas","description":"There is always a bigger fish!&#10;&#10;In the card game Piranhas, players play simultaneously and try to play out all of their cards. On each card are three fishes in different colors and sizes. In the beginning, one card lays on the table. Cards can be played on top of this card when they show a bigger fish in the same color as one of the fishes on the card on the table. Then there are piranha cards of different colors. They can be played when no fish of the same color is on the table. The feeding frenzy continues until one player has no more cards and wins!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":20,"minAge":8,"categoriesAndMechanics":["Card Game","Children's Game","Real-time","Pattern Recognition"],"rating":2.947385,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/L4_g_QUYso1IxnGLgw60SQ__thumb/img/rLzQdpK6fIlzsl5F8XWxcZD1eKs=/fit-in/200x150/filters:strip_icc()/pic1210902.jpg","urlImage":"https://cf.geekdo-images.com/L4_g_QUYso1IxnGLgw60SQ__original/img/uVaB45-Xjr5H7LZHLvz_F7gXghw=/0x0/filters:format(jpeg)/pic1210902.jpg"},{"bggId":"342211","name":"Color Code","description":"A color says more than a thousand pictures.&#10;&#10;Everyone has color associations for certain terms. Which colors do YOU associate with Surfing, Music, or Magic?&#10;&#10;As a team you try to match up your inner color associations. Put yourself into the other players' minds and together solve the COLOR CODE!&#10;&#10;The active player gets three topics and must secretly assign one of seven (more as the game progresses) colors to them. The other players then discuss and guess which colors the active player chose for each topic. For every match, they get half a point.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Party Game","Cooperative Game","Matching"],"rating":3.041095,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/O_prtOye1stA_MlD8K6G0Q__thumb/img/e2Y0wl5G82Na3KCdlr_nID8YWQM=/fit-in/200x150/filters:strip_icc()/pic6962034.jpg","urlImage":"https://cf.geekdo-images.com/O_prtOye1stA_MlD8K6G0Q__original/img/SvAMO-cIzYq28I4magqe5TxfV3E=/0x0/filters:format(jpeg)/pic6962034.jpg"},{"bggId":"877","name":"Troia","description":"As archaeologists, the players try to reconstruct the individual layers of Troy by excavating puzzle pieces from the site. By publishing their results, players gain reputation (scientific prestige) and get additional digging permits. Whoever gets the highest reputation wins the game.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":60,"maxPlayTime":60,"minAge":9,"categoriesAndMechanics":["Ancient","Civilization","Puzzle","Tile Placement"],"rating":2.809775,"complexity":1.8667,"urlThumb":"https://cf.geekdo-images.com/enMbj7w9aU-K-pzxLpgXuw__thumb/img/V1xjJc3O9DDwIJIHCXGhof7zQoU=/fit-in/200x150/filters:strip_icc()/pic372401.jpg","urlImage":"https://cf.geekdo-images.com/enMbj7w9aU-K-pzxLpgXuw__original/img/RXxnnnHKRXhORn9c87XVWWdHnyg=/0x0/filters:format(jpeg)/pic372401.jpg"},{"bggId":"125148","name":"Lap Dance","description":"The boss just fired the manager of his most prestigious strip club and is now looking for a new manager.&#10;&#10;In Lap Dance, players take the role of entertainment assistants at that strip club. Their job is to take care of valued customers and see to their needs. Those wealthy customers will be asking for dancers, drinks and luxury services and will be paying good money to the assistant that fulfills their wishes. The player who will generate the most money by satisfying customer demands will become the new manager.&#10;&#10;Sleeve sizes:&#10;Euro Sized 59x91mm&#10;Dixit Sized 80x120mm&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":45,"minAge":18,"categoriesAndMechanics":["Dice","Mature / Adult","Real-time","Acting","Dice Rolling","Hand Management","Set Collection","Simultaneous Action Selection","Singing"],"rating":2.77457,"complexity":1.8846,"urlThumb":"https://cf.geekdo-images.com/UZOEt_DwvimLGX7Qcyxe_w__thumb/img/7tEFWK-KDznqEDVy2__GQJbDvyo=/fit-in/200x150/filters:strip_icc()/pic2333977.jpg","urlImage":"https://cf.geekdo-images.com/UZOEt_DwvimLGX7Qcyxe_w__original/img/03FfWAm6CY3CGZ1EZQnQDrtieMY=/0x0/filters:format(jpeg)/pic2333977.jpg"},{"bggId":"9246","name":"L'Attaque","description":"Early predecessor of Stratego. Designed by Mademoiselle Hermance Edan, who filed a patent for a 'jeu de bataille avec pi&egrave;ces mobiles sur damier' (a battle game with mobile pieces on a gameboard) on 26 Nov 1908. The patent was released by the French Patent Office in 1909 (patent #396.795).&#10;&#10;Hermance Edan has marketed her own invention from 1909 to early 1930. In 1909, she appointed her game &quot;L'Attaque&quot;. Also, H. P. Gibson obtained the rights to broadcast L'Attaque in English-speaking countries from 1920s. French publisher &quot;Au jeu retrouv&eacute;&quot; produced a version of the game in 1975 by modifying the parts illustrations.&#10;&#10;The game is played with 36 pieces each on a 9x10 square board. Each piece has a numeric value, which is hidden from the opponent and only revealed when an attacking piece moves onto a square occupied by an opponent's piece. In most cases, the piece with the highest value wins and the losing piece is removed from the board.&#10;&#10;Play continues until one player finds the opponent's flag piece and takes it.&#10;&#10;Re-implemented by:&#10;&#10;    Stratego&#10;    Sharpe's Attack&#10;&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":20,"minAge":12,"categoriesAndMechanics":["Fighting","Wargame","Rock-Paper-Scissors","Secret Unit Deployment"],"rating":3.015985,"complexity":1.25,"urlThumb":"https://cf.geekdo-images.com/ynKDb6vWPQjX4YfSdCEJig__thumb/img/iK0pGaoFKIS7AQlxl3t4EFjYnjU=/fit-in/200x150/filters:strip_icc()/pic57598.jpg","urlImage":"https://cf.geekdo-images.com/ynKDb6vWPQjX4YfSdCEJig__original/img/WDzr4Qu4BzEb86_wTdmv7Yoofls=/0x0/filters:format(jpeg)/pic57598.jpg"},{"bggId":"148581","name":"District-Z","description":"The city is overrun with undead and you are one of its last survivors. Kill the zombies, stay alive, and escape while you still can! But be careful, zombies await around every corner. They are desperate and eager to sink their teeth into you and make you yet another member of their growing legion.&#10;&#10;DISTRICT-Z is a zombie-killing card game for 1-4 players in which you must survive and make your way to the safety of the City&rsquo;s Edge. Each game takes about 30 minutes or less to play. The game &ldquo;board&rdquo; is always randomly generated and determines the layout of the city at the start of each game. The game is easy to play and easy to learn and allows players to get into the action right away.&#10;&#10;During the game, you play the role of one of the six Survivors. Each one of these Survivors has a special ability that helps you on your way to the City&rsquo;s Edge.&#10;&#10;During your turn, you must visit different Location cards. Each Location card has an Event Table at the top of its text area. This table is used to determine what happens as you make your way to safety. When you find a Location Objective, survive and make your way to the City&rsquo;s Edge. A multi-player game is semi-cooperative, however, you must be the first to escape the city to win.&#10;&#10;","minPlayers":1,"maxPlayers":8,"minPlayTime":30,"maxPlayTime":30,"minAge":12,"categoriesAndMechanics":["Card Game","Dice","Horror","Zombies","Area Movement","Modular Board","Variable Player Powers"],"rating":2.91,"complexity":1.4,"urlThumb":"https://cf.geekdo-images.com/QMRXQ2NRIG7YGah6fQRAbA__thumb/img/hZAUrsPDEqsoO4XOxV3m9MhMvQU=/fit-in/200x150/filters:strip_icc()/pic2534369.jpg","urlImage":"https://cf.geekdo-images.com/QMRXQ2NRIG7YGah6fQRAbA__original/img/ZwMu_1YITyPELDpBTAu1gst2F5c=/0x0/filters:format(jpeg)/pic2534369.jpg"},{"bggId":"78247","name":"Campos","description":"Pietro Vozzolo's Campos may look rather ingenious  on first glance, but the game actually has little in common with that well-known Reiner Knizia design other than brightly-colored hexagons on plastic tiles.&#10;&#10;Each player starts the game with 3-5 hidden scoring cards and two face-up triangular tiles, while one tiles is laid out in the center of the table. On a turn, a player can either add her two tiles to the growing hexagonal mess or add one tile to the central display, then play a scoring card. Each scoring card is read as follows: &quot;If the largest contiguous mass of color A is larger than the largest contiguous mass of color B, then score points equal to the number of hexes in the largest contiguous mass of color C.&quot; Lots of contiguity in there!&#10;&#10;A player draws one or two new tiles at the end of her turn, and the game continues until either someone runs out of scoring cards or a player can't refill her visible display of tiles. In either case, each player again receives 3-5 scoring cards adding those to any remaining in hand then players start taking turns removing one or two tiles each turn, playing a scoring card if the player removes only one tile. The game ends once all the tiles have been removed from play, and the player with the highest score wins the game.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Abstract Strategy","Pattern Building","Tile Placement"],"rating":2.82922,"complexity":1.5556,"urlThumb":"https://cf.geekdo-images.com/9ppsnsCMKbiuxHTD8p6PkQ__thumb/img/4jzHVzPFjXYIr-m1mDYmtFXX_fs=/fit-in/200x150/filters:strip_icc()/pic782790.jpg","urlImage":"https://cf.geekdo-images.com/9ppsnsCMKbiuxHTD8p6PkQ__original/img/ENuiu2WCKo1pv_qIXsJXpVeUpNA=/0x0/filters:format(jpeg)/pic782790.jpg"},{"bggId":"173338","name":"Pollen","description":"In search of pollen and nectar, bees and bumblebees explore the meadow. Lead your pollinator to the flowers that carry the precious booty, giving preference to your favorites. And since the same flower can be favored by both insects, you'll have to be cunning! Tactics and deduction will be part of the game... Let the harvest begin!&#10;&#10;One player will lead the Bumblebees, the other the Mason Bees. our species will have to be in the majority in number on as many flowers as possible among the five present to forage! In addition, you will each have 3 secret flowers that will have the preference of your species to earn you points!&#10;You will therefore have to place your bees wisely, move them and sometimes bluff to deceive the opponent.&#10;&#10;Players lay numbered card under a row of flowers to attempt to control the card and earn points.  The player with the most points, wins.&#10;&#10;The game comes with a booklet full of information about wild bees, their ecology, pollination, flowers and population decline. There are also hints on what individuals can do to improve the situation!&#10;&#10;&mdash;description from the publisher (translated)&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":15,"maxPlayTime":15,"minAge":8,"categoriesAndMechanics":["Animals","Card Game","Area Majority / Influence","Betting and Bluffing","Deduction"],"rating":2.88205,"complexity":1.8,"urlThumb":"https://cf.geekdo-images.com/DjE1cNisDGcv32ksELVNpw__thumb/img/XUHKATvOJ0jzvvSWY4qglxeJkk8=/fit-in/200x150/filters:strip_icc()/pic2411139.jpg","urlImage":"https://cf.geekdo-images.com/DjE1cNisDGcv32ksELVNpw__original/img/wKJjjKeWXzvrwvFtqYOfrTZw1Ls=/0x0/filters:format(jpeg)/pic2411139.jpg"},{"bggId":"3494","name":"Gran Gol","description":"OBJECT OF THE GAME&#10;Grangol is a simulation of a football match between two teams. The ultimate goal here as in any football match is to score more goals than your opponent!&#10;Actions alternate between players.First they attack and then defend using cards.&#10;PLAYING THE GAME&#10;The player draws a card and gets ready to play a card.&#10;In each turn you draw one more card and play one card unless specified otherwise in the text of the card played.&#10;The first player is the attacker.If he loses the ball do to a card played by the defender he is in turn defending.&#10;There are 5 &quot;Field&quot; cards which represent the playing field in sections (2 areas, 2 three-quarter, 1 midfield). When one player makes a successful action (both attack and defense), this section turns the field immediately in front of her with&#10;arrows in his favor, to indicate that this is now in that section of the field.&#10;DURATION OF THE GAME&#10;The game is divided into two parts, each time ends as soon as you turn the  &quot;recovery&quot; card or when a deck is depleted&#10;Between the first and the second Half cautions and dismissals will be reset.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":20,"minAge":8,"categoriesAndMechanics":["Card Game","Sports","Hand Management"],"rating":3.044355,"complexity":1.4,"urlThumb":"https://cf.geekdo-images.com/U8_ST_DFoHs5-pw5JiV5og__thumb/img/FWu2Suy79YkELVBTXvsXZDj2P7I=/fit-in/200x150/filters:strip_icc()/pic178927.jpg","urlImage":"https://cf.geekdo-images.com/U8_ST_DFoHs5-pw5JiV5og__original/img/Z8Wbv0PTOCYNvXegtIDl-0tRBrI=/0x0/filters:format(jpeg)/pic178927.jpg"},{"bggId":"8361","name":"Crimean Shield","description":"Operational treatment of the Crimean and Sevastopol campaigns from 1941 to 1944.  Eight scenarios of various length including the 24-turn campaign game.  Uses a command-and-supply system to track the ability of units to conduct actions.&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":240,"maxPlayTime":240,"minAge":12,"categoriesAndMechanics":["Wargame","World War II","Hexagon Grid"],"rating":3.07422,"complexity":3.2,"urlThumb":"https://cf.geekdo-images.com/0tmsGyvZcjmw3y5QRvvLPQ__thumb/img/579NdCqo2Xv_fMfb_YBp0M5wN9U=/fit-in/200x150/filters:strip_icc()/pic2017234.jpg","urlImage":"https://cf.geekdo-images.com/0tmsGyvZcjmw3y5QRvvLPQ__original/img/2hPitx2iTh-XEsI0hQtLpqW1VuA=/0x0/filters:format(jpeg)/pic2017234.jpg"},{"bggId":"36225","name":"Playbook Football","description":"The closest you can get to football without wearing shoulder pads!&#10;Playbook Football appeals to anyone who enjoys football, from the armchair quarterback to the dedicated season ticket holder. It is easy to learn, fast to play, and has all of the tactical depth of football. Constructed out of high-quality, all-wood components, Playbook Football is a beautiful piece of home d&eacute;cor as well as an engrossing game of strategy and luck.&#10;&#10;With 10 years of football statistics incorporated into the play cards this is the most accurate football board game ever brought to market. Players feel the excitement as the plays they call carry them down the field to victory or deny the opposing team critical yardage. From basic calls to fancy plays like the Blitz and Screen Pass, if you can do it in football, you can do it in Playbook Football!&#10;&#10;Players complete a full game in less than an hour. Every game is different, keeping players going all night long. Expansion packs with custom plays are planned for release in 2009, letting players build their own playbook and team. Want to see how your team stacks up to anyone else in the league? Grab a friend after the game and find out!&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":45,"maxPlayTime":45,"minAge":0,"categoriesAndMechanics":["Dice","Sports","Dice Rolling"],"rating":3.044355,"complexity":1.375,"urlThumb":"https://cf.geekdo-images.com/4Ed1BsG-ELO_nphh4nHnRg__thumb/img/ScxLjLFWiShYN8L2H6p-B69oU6w=/fit-in/200x150/filters:strip_icc()/pic356388.jpg","urlImage":"https://cf.geekdo-images.com/4Ed1BsG-ELO_nphh4nHnRg__original/img/ORNJlkSibxP_yanO2MrOHHQLycE=/0x0/filters:format(jpeg)/pic356388.jpg"},{"bggId":"8406","name":"Operation Solace","description":"&quot;Operation Solace is a 'what-if' game based on the preliminary Pentagon plans drawn up for a large raid (2-3 divisions) into the Hanoi area of North Vietnam in 1971. The objective of the operation was to have been the liberation of all the POWs being held in that area and the capture of as many North Vietnamese government officials as possible. These latter were then to be traded for any POWs still held.&quot;&#10;&#10;Scale: 6 mile hexes, one day turns, units vary from company sized task forces to full divisions.&#10;---&#10;&#10;Published in Command magazine issue 5 with Hamburger Hill.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":120,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Vietnam War","Wargame","Dice Rolling","Events","Grid Movement","Hexagon Grid","Movement Points","Secret Unit Deployment","Simulation","Variable Set-up"],"rating":2.977605,"complexity":3.2,"urlThumb":"https://cf.geekdo-images.com/rxCnjDTN30Ku_N7c-yf4Xw__thumb/img/DpR_eeGX5MzfvyQ5C7g4q6NYIHs=/fit-in/200x150/filters:strip_icc()/pic111319.jpg","urlImage":"https://cf.geekdo-images.com/rxCnjDTN30Ku_N7c-yf4Xw__original/img/9m4o5mNJ6wAC1muc6MujeV_mkcw=/0x0/filters:format(jpeg)/pic111319.jpg"},{"bggId":"5002","name":"Pro Golf","description":"This is a statistical simulation of PGA golf.&#10;&#10;Each player has a &quot;Player Card&quot; that models the performance of a PGA golfer and the table uses a &quot;Course Booklet&quot; which models a famous course--the first two were Augusta National and the Pebble Beach Golf Links.&#10;&#10;Each shot, the player rolls 2 dice and reads them low number/high number and checks his player card to determine the result of the shot  LL=Long Left, SR=Short Right, etc.  This result is checked in the course booklet to determine where the ball landed and the &quot;club&quot;  (i.e. the column on his player card:  FW, LI, MI, SI, CH, PITCH, SD) that will be used for his next shot and any penalty for being in the rough/trees/sand/etc.  Occasionally, an option will be given to the player to layup or &quot;Go for the Green!&quot;  using a longer club.&#10;&#10;If a number comes up, the player is on the green and the number determines the distance left on his putt.  For putting, if the number rolled on the putting column is greater than or equal to the distance left to the pin, the putt is good.  Otherwise, unless the putt is badly missed (which checks another &quot;Second Putt Card&quot; to determine the length of the next putt), the second putt is assumed to always good.&#10;&#10;Record the score for the hole.  Repeat 17 more times for entire round.&#10;&#10;","minPlayers":1,"maxPlayers":36,"minPlayTime":60,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Dice","Sports","Dice Rolling"],"rating":2.852035,"complexity":1.68,"urlThumb":"https://cf.geekdo-images.com/YZwIJMJu8E2sRnVvaUymfQ__thumb/img/UJY1yhRgQKJGZdF_aEnPwUOCPU4=/fit-in/200x150/filters:strip_icc()/pic45784.jpg","urlImage":"https://cf.geekdo-images.com/YZwIJMJu8E2sRnVvaUymfQ__original/img/kEkeEWo4a8tCVuVJaKyvHrwsI-A=/0x0/filters:format(jpeg)/pic45784.jpg"},{"bggId":"313875","name":"Rambo: The Board Game – First Blood","description":"The year is 1981, and you&rsquo;re John Rambo, just returned home from    Vietnam to a country you don&rsquo;t recognize. You have no friends and no place to live. You wander into the wrong town just looking for something to eat... and now you&rsquo;re fighting for your life!&#10;&#10;In Rambo the Board Game: First Blood, you become Rambo and make all the critical choices and alter the outcomes of your favorite 80&rsquo;s action movie, First Blood!&#10;&#10;This isn&rsquo;t a typical board game. It&rsquo;s a solo narrative game experience unlike any you&rsquo;ve ever played before! On your turn you'll choose a stance from your character sheet which gives you your actions, movement, and any other special abilities. You'll also be able to use unique gear and tactics cards to help you on your journey. This game is fully dice-less, so it's all about the narrative story and your tactical choices in this &quot;Choose your own adventure-like game&quot;&#10;&#10;A highly thematic, story-filled, tactical game where the fate of Rambo lies in your hands. Remember, one thing if you play this game... a good supply of body bags! &#10;Nothing is over! Nothing!&#10;&#10;&mdash;description from the publisher&#10;&#10;","minPlayers":1,"maxPlayers":1,"minPlayTime":60,"maxPlayTime":90,"minAge":14,"categoriesAndMechanics":["Adventure","Fighting","Movies / TV / Radio theme","Wargame","Action Points","Hidden Movement","Narrative Choice / Paragraph","Scenario / Mission / Campaign Game","Solo / Solitaire Game"],"rating":2.871795,"complexity":1.5714,"urlThumb":"https://cf.geekdo-images.com/11GQkk0jvCLZaJjPsF14ow__thumb/img/yhuXH5R0N5iJ2xL6fKNMQPZb0Qo=/fit-in/200x150/filters:strip_icc()/pic5592778.png","urlImage":"https://cf.geekdo-images.com/11GQkk0jvCLZaJjPsF14ow__original/img/jRo184LQC0DcJGeqtXgMbOaFsFo=/0x0/filters:format(png)/pic5592778.png"},{"bggId":"1142","name":"Sabotage","description":"&quot;The game where uncertainty reigns&quot;&#10;&#10;To win, you capture the crown located at the center of the board and return it to your base. You may move in any direction in a straight line. However the number of spaces you move is determined by the total number of pieces on the horizontal row where you start your move. You cannot jump pieces, but you may capture by landing on a piece. Land on the crown to capture it. But beware - your move may be sabotaged by your opponent at any moment.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":30,"maxPlayTime":30,"minAge":8,"categoriesAndMechanics":["Abstract Strategy","Grid Movement","Square Grid"],"rating":2.846665,"complexity":1.5,"urlThumb":"https://cf.geekdo-images.com/t0qDsOOT4Yb8XPBLI3c4TA__thumb/img/l-xrZRw-_tORXb9LfkeWLY4a_Z4=/fit-in/200x150/filters:strip_icc()/pic301507.jpg","urlImage":"https://cf.geekdo-images.com/t0qDsOOT4Yb8XPBLI3c4TA__original/img/JYKq0ZelE2cDS_qbp3NL3Pxd6A8=/0x0/filters:format(jpeg)/pic301507.jpg"}]