[{"bggId":"186726","name":"Heisei Hyakunin Issyu","description":"This is educational memory game.&#10;a kind of Ogura Hyakunin Issyu:Japanese ancient card game&#10;&#10;There are 100 pair pictures in the game.&#10;Player can play &quot;Old Maid&quot;,&quot;Concentration&quot; using the cards.&#10;there are hints printed on the cards.&#10;if you know 100 famous ancient Japanese poems , you can win easily.&#10;&#10;and you can play traditional Ogura Hyakunin Issyu too.&#10;&#10;Heisei Hyakuninn Issyu is compatible.&#10;&#10;Ogura is a Japanese place, and Hyakunin mean 100 people. Issyu: one poem. So, the tile means 100 poets who are picked by famous poet Sadaie(Teika) FUJIWARA at Ogura.&#10;&#10;The poem is written in ancient Japanese language. Many Japanese students have to memorise 100 poems even if the poem sounds like Greek.&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":10,"maxPlayTime":30,"minAge":4,"categoriesAndMechanics":["Ancient","Card Game","Educational","Memory","Memory"],"rating":0,"complexity":0},{"bggId":"186733","name":"Naturally Disastrous","description":"Naturally Disastrous is a 1-6 player co-operative dice driven game of peril and adventure.  Your mission is simple enough.  Arrive at your destination, verify the conditions and then set up a long range communication array to deliver your findings back to your superiors.  Easy, right?  Your visit to Earth is supposed to just be a quick investigation into how the planet is doing.&#10;&#10;As you enter the atmosphere massively destructive storms make it hard to navigate.  Giant volcanoes, earthquakes, thermal gas explosions and flooding are rampant and tearing the Earth apart and what happens next? You and your crew are shot at by some natives claiming that you are violating their air space.  As your ship tears itself apart and plummets to the desert floor you know that your only chance of survival will be to pick up the pieces of your communications array that are now conveniently scattered across the driest most self-destructing climate you have ever seen.&#10;&#10;All you have to do is find and set up the four parts of the communications array and signal the mother ship to come heal this planet and get you out of here.  You will have to navigate around the perilous hazards, avoid snipers who want you gone, secret agents who are stealing your technology, crazy mad scientists who want to perform experiments on you, and a completely different alien race who may even abduct you.  Work together efficiently as a team and you will avoid a Naturally Disastrous fate! If you become mutated, you turn against your former allies.&#10;&#10;The game is played on a randomized map, with randomly placed tokens. Each turn, the active player must roll to activate a disaster, and then has 3 actions per turn (move, probe, etc.) Combat is resolved with dice. As each part of the communications array is found, it must be transported to one of the corners of the map.&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":45,"maxPlayTime":60,"minAge":13,"categoriesAndMechanics":["Adventure","Maze","Puzzle","Spies/Secret Agents","Zombies","Action Queue","Cooperative Game","Dice Rolling","Modular Board","Pick-up and Deliver","Push Your Luck","Variable Player Powers"],"rating":3.35909,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/j2FtTIwroh8c5G2So-3tIw__thumb/img/JWlM8oHC22qcmvwE7HQc-lv6gMA=/fit-in/200x150/filters:strip_icc()/pic2726444.jpg","urlImage":"https://cf.geekdo-images.com/j2FtTIwroh8c5G2So-3tIw__original/img/4m1Or5RwvGxR5FV8tFsaNSBFzrw=/0x0/filters:format(jpeg)/pic2726444.jpg"},{"bggId":"186740","name":"Rumemba","description":"A memory game to frazzle the mind, a cross between memory game and rummy. 60 tactile counters, in 4 bright colours, numbered from 1-13, and 8 black counters can be used as anything.&#10;&#10;Turn the counters face down and shuffle them around, arrange in a grid of 6 rows and 10 columns for easier play, leave random for harder play, suitable for 2+ players.&#10;&#10;The active player turns over 3 counters of their choice, and the aim is to make a run of three consecutive numbers in the same colour, or a set of three numbers the same. If the numbers do not make a set or run, the counters are turned back over face down and the next player choices three counters to turn over, to make a set or a run. If a player turns over three counters making a set or a run, they take these from the middle and place them face up by themselves, and this gives them a score. The black counters have no numerical value, but can be used as anything to make up sets and runs with the other counters turned in a go.&#10;&#10;The more counters you can rumemba which have been played, the greater your ability to make runs and sets. The counters all score for face value, and each player adds up the total number of points they have from the sets and runs they have won.&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":15,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Memory","Memory"],"rating":2.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/WzFor7EPhEOcvHX_exhKIw__thumb/img/IrurVPGwpiJPFjVwI5-lWC66YE8=/fit-in/200x150/filters:strip_icc()/pic4153608.jpg","urlImage":"https://cf.geekdo-images.com/WzFor7EPhEOcvHX_exhKIw__original/img/JlHlH_BYMrV4-l5kzP3H00DKbf0=/0x0/filters:format(jpeg)/pic4153608.jpg"},{"bggId":"186742","name":"EtymoLinguo","description":"Do you really know the origins of the French language? Latin and Greek words are everywhere in the French language. With this family game, use Latin and Greek roots to find the corresponding French words. If you have for example MANUS, &quot;hand&quot; in Latin, you can find &quot;manucure&quot;, &quot;manual&quot; or &quot;manufacture&quot;. Depending on the difficulty or frequency derivative you will find, you score more points. No panic, no need to be a distinguished Latin or Greek scholar to participate! You just have to arm themselves with good humor and a competitive spirit! An addictive game for the whole family.&#10;Etymolinguo, the game that revives the ancient languages!&#10;Published in partnership with the site www.arretetonchar.fr&#10;&#10;Material: 70 double-sided Latin/Greek cards, 1 hourglass, 1 pencil, 1 notebook&#10;&#10;Rules of the game: the game master draws a card, reads the word (Latin and Greek) and his team will give as fast as possible French words derived from the Latin or Greek root. The more complicated is the word derivative, the more it gives points to his team.&#10;Thus for GENUS (&quot;species&quot; in Latin), you can give: g&eacute;n&eacute;ral (1 point), gen&egrave;se (2 points), or gentleman (3 points).&#10;The first team that reaches 15 points wins!&#10;&#10;---&#10;&#10;Connaissez-vous vraiment les origines du fran&ccedil;ais ? Les mots latins et grecs sont partout dans la langue fran&ccedil;aise. Avec ce jeu familial, partez des racines latines et grecques et trouvez les mots fran&ccedil;ais correspondants. Si on vous dit par exemple MANUS, &quot;la main&quot; en latin, vous pourrez proposer &laquo; manucure &raquo;, &laquo; manuel &raquo; ou &laquo; manufacture &raquo;. Selon la difficult&eacute; ou la fr&eacute;quence du d&eacute;riv&eacute; que vous trouverez, vous marquerez davantage de points. Pas de panique, pas besoin d&rsquo;&ecirc;tre un latiniste ou un hell&eacute;niste &eacute;m&eacute;rite pour participer ! Il suffit juste de s&rsquo;armer de bonne humeur et d&rsquo;un esprit de comp&eacute;tition ! Un jeu addictif pour toute la famille.&#10;Etymolinguo, le jeu qui ressuscite les langues anciennes !&#10;Edit&eacute; en partenariat avec le site www.arretetonchar.fr&#10;&#10;Ce jeu d&rsquo;&eacute;tymologie est constitu&eacute; d&rsquo;un ensemble de cartes, d&rsquo;un sablier, d&rsquo;un carnet de notes et de son crayon.&#10;R&egrave;gles du jeu par &eacute;quipe : le ma&icirc;tre du jeu pioche une carte, &eacute;nonce le mot (latin ou grec) et son &eacute;quipe devra donner en un minimum de temps des mots fran&ccedil;ais d&eacute;riv&eacute;s de ces racines latines ou grecques. Plus le mot d&eacute;riv&eacute; est compliqu&eacute; et plus il rapporte &agrave; son &eacute;quipe.&#10;Ainsi pour AMO (&quot;aimer&quot; en latin), on peut donner : amour (1 point), amant (2 points), ou amouracher (3 points).&#10;La premi&egrave;re &eacute;quipe qui arrive &agrave; 15 points remporte la partie !&#10;&#10;","minPlayers":2,"maxPlayers":30,"minPlayTime":20,"maxPlayTime":30,"minAge":12,"categoriesAndMechanics":["Card Game","Educational","Party Game","Word Game"],"rating":4,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/DzjV3-SDnMF1K3GaON606g__thumb/img/VPTUDRJNS32l5j_s6MzOu5aKsTc=/fit-in/200x150/filters:strip_icc()/pic2736197.jpg","urlImage":"https://cf.geekdo-images.com/DzjV3-SDnMF1K3GaON606g__original/img/YjhBMNGq_IH7K7Nni4xCH2SX4Xo=/0x0/filters:format(jpeg)/pic2736197.jpg"},{"bggId":"186744","name":"Lalaloopsy: Ups 'n Downs 3D Game","description":"Be the first to reach the finish line and win, but beware the falling stars! 3-D Action adds to the traditional game play of Snakes &amp; Ladders. Contents: 3D plastic playing board with pop-up dice in middle, 2 Detachable ladders &amp; 4 Colored marbles. Fun from top to button. Lalaloopsy - Sew Magical! Sew Cute!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":4,"categoriesAndMechanics":["Action / Dexterity","Roll / Spin and Move"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/eE9OBA-ZefpHcoe7aOYX0A__thumb/img/AVpaRJhKxYcY-lhJhT7TagovAb8=/fit-in/200x150/filters:strip_icc()/pic2723029.jpg","urlImage":"https://cf.geekdo-images.com/eE9OBA-ZefpHcoe7aOYX0A__original/img/ZiKtvhRVVekz-qa5bJgEmBKxAdY=/0x0/filters:format(jpeg)/pic2723029.jpg"},{"bggId":"186748","name":"Card 'N' Go Seek","description":"Find it first, find it fast, find your fun! Card &lsquo;N&rsquo; Go Seek is the game that delivers get-out-of-your-seat scavenger hunt fun for the whole family! At the count of three, everyone dashes off to retrieve an item revealed on one of the cards. The first player to get back with the correct type of item wins the matching card! Players have fun deciding for themselves what the cards mean. For example, finding something SWEET could be a lollipop or a picture of your great aunt Helen! Interpreting the cards really lets your personality shine. The first player to win one card of each color OR three cards of the same color wins the game! Every new environment invites new ways to play &ndash; the world is your game! Includes 150 cards, portable plastic case and instructions. Colors and decorations may vary.&#10;&#10;","minPlayers":2,"maxPlayers":99,"minPlayTime":0,"maxPlayTime":0,"minAge":7,"categoriesAndMechanics":["Action / Dexterity","Action Queue","Pick-up and Deliver","Set Collection"],"rating":2.785715,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/gkjFDe33l773TJb6LnEgog__thumb/img/FQpb0NKpSbV1R2uWVtkg-gA9o3g=/fit-in/200x150/filters:strip_icc()/pic2723022.jpg","urlImage":"https://cf.geekdo-images.com/gkjFDe33l773TJb6LnEgog__original/img/G_a5OH-DAcMfAmeG9nUYRd9FU_w=/0x0/filters:format(jpeg)/pic2723022.jpg"},{"bggId":"186750","name":"Efterklok","description":"In Efterklok, a.k.a. Hinterher ist man immer schlauer, you answer five questions in a row. After you've answered, every player learns how many correct answers you gave, but not which questions were correct. The same five questions are now presented to the player after you, and they can choose to either copy your answers or give their own in the hope of scoring more points. As long as no one has answered all of the questions correctly, this process continues until everyone but the questioner has had a chance to answer the questions. Thus, if you stay alert and can read the other players well, you might be able to win the game even if didn't know many of the answers to begin with!&#10;&#10;Efterklok comes with more than five hundred entertaining, interesting, and educational questions.&#10;&#10;","minPlayers":3,"maxPlayers":99,"minPlayTime":15,"maxPlayTime":45,"minAge":14,"categoriesAndMechanics":["Trivia","Memory"],"rating":2.59119,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/HqtENXY4e-wKVcYh1r5sRA__thumb/img/k8EikkIa9ScRkLSW1XuKDgoHHY4=/fit-in/200x150/filters:strip_icc()/pic3510024.png","urlImage":"https://cf.geekdo-images.com/HqtENXY4e-wKVcYh1r5sRA__original/img/JmUph0Bay0fcButEVbXNpcRjYQ0=/0x0/filters:format(png)/pic3510024.png"},{"bggId":"186752","name":"Brave and Noble Fights Expansion: The Battles of Foochow and Pung-do Island","description":"Brave and Noble Fights Expansion: The Battles of Foochow and Pung-do Island. This expansion game portrays the first battle of the 1894-95 Sino-Japanese War of Pung-do Island, and extends the period covered to the climactic battle of Foochow of the 1884 Sino-French War.&#10;&#10;The historical Battle of Foochow can be played as a stand-alone game. However, to play the mini-game Battle of Pung-do and the many variants of Foochow and other &ldquo;what if&rdquo; battles of the Sino-French War you will need a copy of Brave and Noble Fights: The Battles of the Yalu and Wei-Hai-Wei.&#10;&#10;","minPlayers":1,"maxPlayers":2,"minPlayTime":45,"maxPlayTime":120,"minAge":12,"categoriesAndMechanics":["Nautical","Wargame","Open Drafting","Simulation"],"rating":4.5,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/2Mc-yfyFJ-E1mlDsJKRnVg__thumb/img/BJi6fRVuuWnSAC_8xGv0iJk2eZ4=/fit-in/200x150/filters:strip_icc()/pic2723283.jpg","urlImage":"https://cf.geekdo-images.com/2Mc-yfyFJ-E1mlDsJKRnVg__original/img/4SnkHNiGaUZf8jAxOQuL4oqye3Q=/0x0/filters:format(jpeg)/pic2723283.jpg"},{"bggId":"186753","name":"Four Wizards","description":"Four Wizards is a new version of a classic card-shedding game. Players draw and discard their way to an empty hand, laying down a variety of cards designed around a medieval theme. Each deck comes with 72 cards and supports a game of 2-4 players. Included are 48 Medieval Unit Cards (4 Colored Factions: Blue Cross, Green Star, Red &amp; Gold, and Purple Chevron).&#10;&#10;In addition to the 48 Unit cards, there are 16 Wizards (4 different classes for each colored faction), and 6 Plague Cards. Plague Cards do not belong to any color; therefore, they cannot be discarded, ONLY PURGED. Plague Cards were created to prevent you from getting rid of all your cards. There are several ways to remove these cards from your hand (see Wizard Cards). Part of the fun is discovering these various methods of &quot;purging&quot; the Plague.&#10;&#10;Wizard Cards are played in the same manner as the other Colored Units. For example, a Blue Wizard can be played on top of any Blue Unit or on top of any other Wizard. There are four types of Wizard Cards, each with their own unique action.&#10;&#10;Swap-A-Hand Wizard - When you play this Wizard, swap your hand with the hand of another player. The choice of which player to Swap-A- Hand with is yours. Once the &ldquo;swap&rdquo; has occurred, play continues to the next player in turn.&#10;&#10;Draw Two Wizard - When you play this Wizard, the next player must draw 2 cards. The player who draws the additional cards will still be able to play their turn. If they do not have a playable card after Drawing Two, they must continue to Draw until they draw a card that can be played. A turn is determined complete when a card has been played.&#10;&#10;Purge-A-Card Wizard - When you play this Wizard, you may discard ANY card of your choice from your hand. Place the card of your choice facedown on the tabletop, thus removing it from the game completely. The card has now been PURGED.&#10;&#10;Purge-The-Plague Wizard - When you play this Wizard, you may discard ONLY Plague Cards from your hand. However there is no limit to how many Plague Cards you can discard. Place the Plague Card(s) face up on the tabletop, thus removing it from the game completely. *The two &quot;Purge&quot; Wizard cards are the ONLY cards that can remove Plague Cards from your hand and therefore the game. Also important is the ability of the &quot;Purge-A-Card&quot; Wizard to remove ANY card from the game. The ability to remove Any card allows various opportunities to develop. In fact, sometimes the best play might not be to PURGE a Plague card. The choice is yours...&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":5,"maxPlayTime":15,"minAge":8,"categoriesAndMechanics":["Card Game","Medieval","Hand Management","Take That"],"rating":3.458335,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/PMRV1aXgvWo0AQSL2W9gDA__thumb/img/GLM_Dy_9QzT0jPj5erjRlRIw1AI=/fit-in/200x150/filters:strip_icc()/pic3575754.jpg","urlImage":"https://cf.geekdo-images.com/PMRV1aXgvWo0AQSL2W9gDA__original/img/bmsV4W7duFI5XnJMcsnE73gfCC8=/0x0/filters:format(jpeg)/pic3575754.jpg"},{"bggId":"186756","name":"Yaochu!","description":"User summary:&#10;&#227;&#131;&#164;&#227;&#130;&#170;&#227;&#131;&#129;&#227;&#131;&#165;&#227;&#131;&#188;! (Yaochu!) is a simplified Mahjong card game using only Ones, Nines, and Honour tiles to form an 8-card hand. Each player has 25 points at the start to take from each other. The game ends when all the players have taken turns to be the dealer twice or when a player's score drops to 0 points or below.&#10;&#10;Publisher summary:&#10;&#228;&#184;&#128;&#228;&#185;&#157;&#229;&#173;&#151;&#231;&#137;&#140;&#227;&#129;&#160;&#227;&#129;&#145;&#227;&#129;&#174;&#233;&#186;&#187;&#233;&#155;&#128;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#130;&#178;&#227;&#131;&#188;&#227;&#131;&#160;&#227;&#129;&#167;&#227;&#129;&#153;&#227;&#128;&#130;&#10;8&#230;&#158;&#154;&#227;&#129;&#174;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#130;&#146;&#230;&#143;&#131;&#227;&#129;&#136;&#227;&#130;&#139;&#231;&#176;&#161;&#230;&#152;&#147;&#231;&#137;&#136;&#227;&#129;&#174;&#233;&#186;&#187;&#233;&#155;&#128;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#130;&#178;&#227;&#131;&#188;&#227;&#131;&#160;&#227;&#129;&#167;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#227;&#129;&#157;&#227;&#130;&#140;&#227;&#129;&#158;&#227;&#130;&#140;25&#231;&#130;&#185;&#227;&#129;&#174;&#231;&#130;&#185;&#230;&#149;&#176;&#227;&#130;&#146;&#230;&#140;&#129;&#227;&#129;&#163;&#227;&#129;&#166;&#227;&#128;&#129;&#231;&#130;&#185;&#230;&#149;&#176;&#227;&#130;&#146;&#229;&#143;&#150;&#227;&#130;&#138;&#229;&#144;&#136;&#227;&#129;&#132;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#232;&#166;&#170;&#227;&#129;&#140;2&#229;&#145;&#168;&#227;&#129;&#153;&#227;&#130;&#139;&#227;&#129;&#139;&#227;&#128;&#129;&#232;&#170;&#176;&#227;&#129;&#139;&#227;&#129;&#174;&#231;&#130;&#185;&#230;&#149;&#176;&#227;&#129;&#140;0&#230;&#156;&#170;&#230;&#186;&#128;&#227;&#129;&#171;&#227;&#129;&#170;&#227;&#130;&#139;&#227;&#129;&#168;&#231;&#181;&#130;&#228;&#186;&#134;&#227;&#129;&#167;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":20,"maxPlayTime":0,"minAge":8,"categoriesAndMechanics":["Card Game","Hand Management","Set Collection"],"rating":2.375,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/_XtV4IKgPbBEZi_GKYocmg__thumb/img/7t_bfa5yxAyedoCzX8p2RktVStE=/fit-in/200x150/filters:strip_icc()/pic2735938.jpg","urlImage":"https://cf.geekdo-images.com/_XtV4IKgPbBEZi_GKYocmg__original/img/ZlASlDNaH_4fMhYkNzETN9wgOSA=/0x0/filters:format(jpeg)/pic2735938.jpg"},{"bggId":"186757","name":"Guerra de Letras","description":"Is a game similar to battleship, but you must to discover the oponent words.&#10;You have a card with some words and try to discover the words of your oponent.&#10;&#10;By turns, each player says a letter of the alphabet (asks for only one letter in his turn) and  the oponent, answer with all the locations of the word in his own card (example: player 1 says the letter &quot;J&quot; then, the player 2 answers &quot;A3, B4, D1, etc&quot;).&#10;&#10;Win the player that discover all the oponent words.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Deduction","Secret Unit Deployment"],"rating":3.416665,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/T7l4-rvh3Huu5dZJHe_Rjw__thumb/img/VDPdP5dUpS2nWf_fOw8oKJG-HFk=/fit-in/200x150/filters:strip_icc()/pic2734055.jpg","urlImage":"https://cf.geekdo-images.com/T7l4-rvh3Huu5dZJHe_Rjw__original/img/hSK1LSI5tllt1sfsy4s49rnOo08=/0x0/filters:format(jpeg)/pic2734055.jpg"},{"bggId":"186795","name":"Olympiade Spillet","description":"Olympiade Spillet is a quiz game about the Olympics.&#10;&#10;It contains 1.000 questions about the Summer Olympics from 1896 till 2000 (excluding the unofficial 1906 games). They are divided into 5 categories: Ceremony and ritual (blue), sports (yellow), Danes in the Olympics (red), athletics (green) and legends (orange).&#10;&#10;It can be played by 2 to 5 players or teams.&#10;&#10;Each player/team rolls a die by turn and then has to answer a question in the category rolled. If you answer correctly you will receive a marker in the same color. If your answer is wrong nothing happens and the next player gets his turn. The object of the game is to collect a marker of each color. If you roll a color that you already have you will loose your turn.&#10;&#10;The sixst side of the die is blank. Whenever this is rolled a punishment will be dealt. Who will receive this punishment is decided by spinning an Olympic torch. What the punishment is can be decided from game to game. Usually it is to loose a marker or your turn but for party games it can be getting a round for the table or something similar.&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":12,"categoriesAndMechanics":["Party Game","Trivia","Dice Rolling"],"rating":2,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/eI9j9jimkjtLMoyjqgJsLg__thumb/img/S61tSw8s8Mcc1qFXd4ILHHoRVNw=/fit-in/200x150/filters:strip_icc()/pic2739873.jpg","urlImage":"https://cf.geekdo-images.com/eI9j9jimkjtLMoyjqgJsLg__original/img/fsMH77Edl-TIa2B6iN7XYZ3E724=/0x0/filters:format(jpeg)/pic2739873.jpg"},{"bggId":"186798","name":"New Word Order","description":"To play, you consider several words and phrases, and determine the order in which they entered our language. &#10;Each card has a word on front. Players try to put them in the correct chronological order. When they have finished, they flip the cards over to see how they've done. The year each word entered the language are printed on the back.&#10;The game can also be played competitively, with each player passing a word to a competitor. The competitor must attempt to place it correctly in his personal timelime. If it is incorrect, it is discarded. First player to have 7 cards in their timeline wins.&#10;&#10;","minPlayers":1,"maxPlayers":10,"minPlayTime":10,"maxPlayTime":30,"minAge":6,"categoriesAndMechanics":["Card Game","Educational","Print & Play","Word Game","Cooperative Game"],"rating":3.5,"complexity":0},{"bggId":"186806","name":"DUNNIT: The Card Game","description":"DUNNIT is a party game where you learn all the scandalous secrets you NEVER wanted to know about your friends.&#10;&#10;It contains 150 different fill-in-the-blank cards such as, &quot;I have never ___ in public.&quot; and &quot;I have never felt ___ on my ___.&quot; There are 3 ways to play, and here's the most popular version:&#10;&#10;Players take turns drawing a card and (verbally) filling in the &quot;I have never ___&quot; card with a true statement. All players who have &quot;DUNNIT&quot; get a point. The first player to 20 points wins!&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":20,"maxPlayTime":120,"minAge":18,"categoriesAndMechanics":["Card Game","Party Game"],"rating":0,"complexity":0},{"bggId":"186808","name":"The Island of Doctor Necreaux: Second Edition","description":"Create your agent, infiltrate the island, defeat Necreaux's minions, find the scientists, and escape before time runs out!&#10;&#10;The Island of Doctor Necreaux is a cooperative adventure game for 1 to 4 exceptionally talented secret agents set in a 50s-era pulp-sci-fi world. The diabolical Doctor Necreaux has captured the world's top scientists and forced them to build a Doomsday Device. Your mission: Explore the Doctor's secret island lair, find the scientists, and escape in your shuttlecraft before the island is blown to Kingdom Come!&#10;&#10;In this simultaneous action game, players take one turn together as a team. At the start of each turn, you decide whether you're exploring or resting. When you explore you declare a speed, which represents how quickly you're exploring the island adventure deck and determines how many encounters your team will attempt to resolve this turn. You want to draw as many cards as you can because the scientists are hidden somewhere in the middle of the adventure deck, the escape shuttle is hidden in the bottom, and you have a limited number of turns before the island blows up. However, you can't be too fast or you'll fall prey to one of the island's many traps. If you choose to rest, your team gets to heal up and recharge.&#10;&#10;The Island of Doctor Necreaux incorporates creative ability manipulation (in assessing how player powers interact and applying them appropriately), press-your-luck (when selecting a speed and during combat), and resource management (deciding when to use charges - a scarce resource that fuels agent powers - and when to use a turn to rest instead of explore). The game comes with quick start rules and multiple variants to increase replayabiliy and adjust thr difficulty to accommodate a wide range of player skill. The island and agent skills are all card-based, making the island and the agents different every time.&#10;&#10;We at Invisible City are excited about the improvements in the second edition:&#10;&#10;&#10;     All-new full-color art.&#10;     Almost all cards have their own unique art.&#10;     Full-color art on card fronts and backs.&#10;     More &amp; better components. Bigger box (with room for expansions), better cards, bigger rules, enough dice for all players to play, etc.&#10;     Quick-start rules to make it easy for first time players to play.&#10;     All-new &quot;secret cache&quot; cards to adjust the game for different skill levels.&#10;     Clearer/better ways to increase the difficulty for experienced players.&#10;     All cards are numbered for easy set-up of pre-generated scenarios.&#10;     By popular BGG demand, the game's been re-tooled to use 2d6 as the primary resolution mechanic (instead of 1d6). The rules and every card have been re-written to accommodate this.&#10;&#10;&#10;","minPlayers":1,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":90,"minAge":14,"categoriesAndMechanics":["Adventure","Exploration","Science Fiction","Spies/Secret Agents","Cooperative Game","Dice Rolling","Push Your Luck","Simultaneous Action Selection","Variable Player Powers"],"rating":3.030345,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/HDe_pySro_NRvXWKZMg3hQ__thumb/img/TKVWL_gN6eVUfJAricT5xlxyk8g=/fit-in/200x150/filters:strip_icc()/pic7302505.jpg","urlImage":"https://cf.geekdo-images.com/HDe_pySro_NRvXWKZMg3hQ__original/img/bnABncMN2ix8z78CrYzFjqOrXMY=/0x0/filters:format(jpeg)/pic7302505.jpg"},{"bggId":"186809","name":"The Flatsy Game","description":"It's a hurry-scurry shopping game. Go with Flatsy to the Supermarket with your shopping list. How fast can you get all the items? Will another player beat you to the Checkout Counter? Hurry! Hurry! First player to checkout wins the game!&#10;&#10;Contains: Supermarket Game Board, 4 Flatsy Playing Pieces, 4 Shopping Lists, 24 Food Cards &amp; Spinner.&#10;&#10;Players spin and move around the supermarket trying to collect the food cards on their shopping list. They must land on the space next to the food item to collect it and place it next to that item on their shopping list. A player may pass her turn if she is close to a food item when her spin will take her past it. If a player lands on a space occupied by another player, she can bump that player, removing one item from the other players shopping list and putting it back on the shelf. A player must collect 5 out of the 6 items on their list in order to go to the Checkout area. The first one to reach the Checkout area (Finish) with 5 items on their list, wins.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":5,"categoriesAndMechanics":["Children's Game","Roll / Spin and Move","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/BBRPLzKdMlY6eltb6hUPUQ__thumb/img/UpACLmOhMGPZzwTf8CCticDq7ok=/fit-in/200x150/filters:strip_icc()/pic2723026.jpg","urlImage":"https://cf.geekdo-images.com/BBRPLzKdMlY6eltb6hUPUQ__original/img/EQmE2FNC3Vb9uMobPzltvpAtXlc=/0x0/filters:format(jpeg)/pic2723026.jpg"},{"bggId":"186815","name":"The Long March 1934-1935","description":"&#233;&#149;&#183;&#229;&#190;&#129; (The Long March 1934-1935)  is a card game based on the historical event of &quot;the Long March&quot; - the 1934 campaign of the Chinese Communist Party Red Army.&#10;&#10;Players play roles of five generals of the Red Army and collect cards which represent political influences upon the party leaders such as Mao Zedong, Zhou Enlai, etc.&#10;&#10;The artwork was drawn by the designer, working from old propaganda photographs of the period.&#10;&#10;","minPlayers":3,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":0,"minAge":8,"categoriesAndMechanics":["Card Game","Civil War","Political","Set Collection"],"rating":3.607145,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/TFOtrHAdrJJNxD9xIzYD4A__thumb/img/s-7SV1FNmdNAtLoOxA2gE6eC230=/fit-in/200x150/filters:strip_icc()/pic2721382.jpg","urlImage":"https://cf.geekdo-images.com/TFOtrHAdrJJNxD9xIzYD4A__original/img/XM1JIRowV5OBbpqQuG5nTqGTkHU=/0x0/filters:format(jpeg)/pic2721382.jpg"},{"bggId":"186821","name":"日本全国特急旅行ゲーム (Japan Railroad Travel Game)","description":"User summary:&#10;&#230;&#151;&#165;&#230;&#156;&#172;&#229;&#133;&#168;&#229;&#155;&#189;&#231;&#137;&#185;&#230;&#128;&#165;&#230;&#151;&#133;&#232;&#161;&#140;&#227;&#130;&#178;&#227;&#131;&#188;&#227;&#131;&#160; (Japan Railroad Travel Game) is a roll and move train game from Japan.&#10;&#10;Collect tickets, take trains, and travel around Japan!&#10;&#10;Your goal is to take as many express or limited express trains as possible.&#10;&#10;During your turn, do the following:&#10;1) Roll dice - Roll a movement die and an event die.&#10;The movement die is six-sided, but printed values are greater than ordinary die. The faces of the event die are either tickets or happenings.&#10;&#10;2) Move your pawn - You may move number of stations indicated by movement die.&#10;If you have express tickets or limited express tickets of the appropriate route, you may move faster along that route. Otherwise you have to use local trains.&#10;&#10;3) Draw ticket or happening card&#10;If the result of event die is a ticket, you draw a ticket card and keep it in your hand.&#10;If the result of event die is a happening, you draw a happening card and follow the instructions in it.&#10;&#10;Publisher's summary:&#10;&#227;&#129;&#141;&#227;&#129;&#163;&#227;&#129;&#183;&#227;&#130;&#146;&#233;&#155;&#134;&#227;&#130;&#129;&#227;&#129;&#166;&#230;&#151;&#165;&#230;&#156;&#172;&#229;&#133;&#168;&#229;&#155;&#189;&#227;&#130;&#146;&#229;&#183;&#161;&#227;&#130;&#138;&#227;&#129;&#170;&#227;&#129;&#140;&#227;&#130;&#137;&#229;&#136;&#151;&#232;&#187;&#138;&#227;&#129;&#171;&#228;&#185;&#151;&#227;&#130;&#141;&#227;&#129;&#134;&#239;&#188;&#129;&#10;&#239;&#188;&#145;&#239;&#189;&#158;&#239;&#188;&#147;&#227;&#129;&#174;&#230;&#137;&#139;&#233;&#160;&#134;&#227;&#130;&#146;&#231;&#185;&#176;&#227;&#130;&#138;&#232;&#191;&#148;&#227;&#129;&#151;&#227;&#128;&#129;&#227;&#129;&#167;&#227;&#129;&#141;&#227;&#130;&#139;&#227;&#129;&#160;&#227;&#129;&#145;&#229;&#164;&#154;&#227;&#129;&#143;&#227;&#129;&#174;&#231;&#137;&#185;&#230;&#128;&#165;&#227;&#131;&#187;&#230;&#128;&#165;&#232;&#161;&#140;&#229;&#136;&#151;&#232;&#187;&#138;&#227;&#129;&#171;&#228;&#185;&#151;&#227;&#130;&#139;&#227;&#129;&#147;&#227;&#129;&#168;&#227;&#129;&#140;&#227;&#130;&#178;&#227;&#131;&#188;&#227;&#131;&#160;&#227;&#129;&#174;&#231;&#155;&#174;&#231;&#154;&#132;&#227;&#129;&#167;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#239;&#188;&#145;&#239;&#188;&#142;&#227;&#130;&#181;&#227;&#130;&#164;&#227;&#130;&#179;&#227;&#131;&#173;&#227;&#130;&#146;&#230;&#140;&#175;&#227;&#130;&#139;&#10;&#227;&#128;&#140;&#230;&#149;&#176;&#229;&#173;&#151;&#227;&#130;&#181;&#227;&#130;&#164;&#227;&#130;&#179;&#227;&#131;&#173;&#227;&#128;&#141;&#227;&#129;&#168;&#227;&#128;&#140;&#227;&#130;&#164;&#227;&#131;&#153;&#227;&#131;&#179;&#227;&#131;&#136;&#227;&#130;&#181;&#227;&#130;&#164;&#227;&#130;&#179;&#227;&#131;&#173;&#227;&#128;&#141;&#227;&#130;&#146;&#230;&#140;&#175;&#227;&#130;&#138;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#239;&#188;&#146;&#239;&#188;&#142;&#231;&#167;&#187;&#229;&#139;&#149;&#227;&#129;&#153;&#227;&#130;&#139;&#10;&#227;&#128;&#140;&#230;&#149;&#176;&#229;&#173;&#151;&#227;&#130;&#181;&#227;&#130;&#164;&#227;&#130;&#179;&#227;&#131;&#173;&#227;&#128;&#141;&#227;&#129;&#174;&#230;&#149;&#176;&#229;&#173;&#151;&#227;&#129;&#171;&#227;&#129;&#151;&#227;&#129;&#159;&#227;&#129;&#140;&#227;&#129;&#163;&#227;&#129;&#166;&#231;&#167;&#187;&#229;&#139;&#149;&#227;&#129;&#151;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#227;&#129;&#147;&#227;&#129;&#174;&#227;&#129;&#168;&#227;&#129;&#141;&#228;&#189;&#191;&#231;&#148;&#168;&#227;&#129;&#167;&#227;&#129;&#141;&#227;&#130;&#139;&#227;&#129;&#141;&#227;&#129;&#163;&#227;&#129;&#183;&#227;&#129;&#140;&#227;&#129;&#130;&#227;&#130;&#140;&#227;&#129;&#176;&#231;&#137;&#185;&#230;&#128;&#165;&#227;&#131;&#187;&#230;&#128;&#165;&#232;&#161;&#140;&#227;&#129;&#171;&#228;&#185;&#151;&#232;&#187;&#138;&#227;&#129;&#167;&#227;&#129;&#141;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#239;&#188;&#147;&#239;&#188;&#142;&#227;&#130;&#164;&#227;&#131;&#153;&#227;&#131;&#179;&#227;&#131;&#136;&#227;&#130;&#181;&#227;&#130;&#164;&#227;&#130;&#179;&#227;&#131;&#173;&#227;&#129;&#174;&#230;&#140;&#135;&#231;&#164;&#186;&#227;&#129;&#171;&#229;&#190;&#147;&#227;&#129;&#134;&#10;&#227;&#128;&#140;&#227;&#129;&#141;&#227;&#129;&#163;&#227;&#129;&#183;&#227;&#128;&#141;&#227;&#129;&#140;&#229;&#135;&#186;&#227;&#130;&#140;&#227;&#129;&#176;&#227;&#129;&#141;&#227;&#129;&#163;&#227;&#129;&#183;&#227;&#130;&#146;&#239;&#188;&#145;&#230;&#158;&#154;&#227;&#130;&#178;&#227;&#131;&#131;&#227;&#131;&#136;&#239;&#188;&#129;&#10;&#227;&#128;&#140;&#227;&#131;&#143;&#227;&#131;&#151;&#227;&#131;&#139;&#227;&#131;&#179;&#227;&#130;&#176;&#227;&#128;&#141;&#227;&#129;&#140;&#229;&#135;&#186;&#227;&#130;&#140;&#227;&#129;&#176;&#227;&#131;&#143;&#227;&#131;&#151;&#227;&#131;&#139;&#227;&#131;&#179;&#227;&#130;&#176;&#227;&#130;&#171;&#227;&#131;&#188;&#227;&#131;&#137;&#227;&#130;&#146;&#229;&#188;&#149;&#227;&#129;&#132;&#227;&#129;&#166;&#230;&#140;&#135;&#231;&#164;&#186;&#227;&#129;&#171;&#229;&#190;&#147;&#227;&#129;&#132;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#128;&#130;&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":120,"maxPlayTime":0,"minAge":10,"categoriesAndMechanics":["Trains","Travel","Dice Rolling","Point to Point Movement","Roll / Spin and Move"],"rating":2.75,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/yjkOhMndAhZnf3xqGHkjmQ__thumb/img/q_Mt-4u8R-p4sdaOcEqml3cjfAg=/fit-in/200x150/filters:strip_icc()/pic2735716.jpg","urlImage":"https://cf.geekdo-images.com/yjkOhMndAhZnf3xqGHkjmQ__original/img/Fwo4WL_5ptiL0wgJRSQf2u2MTJg=/0x0/filters:format(jpeg)/pic2735716.jpg"},{"bggId":"186827","name":"Zombag","description":"Zombag is a competitive zombie apocalypse game utilizing a pool of 6-sided die, a bag, and the tokens that represent survivors, weapons, zombies and more. Each player is vying to score the most points by fighting zombies to make the bag a safer place, scavenging the wilds to gaining much needed supplies, and using your hard earned tokens to complete missions. The player with the most points by the end of the game wins, and is crowned the greatest zombie apocalypse survivor of all time.&#10;&#10;Zombag is the first game to come from the creative minds at Glass Cabinet Hobbies. Ryan Morgan (Owner/Designer), Chris Miranda (Creative Director/Designer), and Grant Giles (Assistant)  bring to you a party game fit for all ages. It can be played anywhere and ranges from 5 minutes-45 minutes thanks to the adaptive end token system.&#10;&#10;Components:&#10;1 Game Box&#10;1 Bag&#10;1 Rule Sheet&#10;40 Missions Cards&#10;150 Tokens&#10;48 Zombies&#10;12 Bullets&#10;10 food and water&#10;6 Conflicts&#10;6 Raids&#10;3 of each Character&#10;3 of each Weapon&#10;3 Infections&#10;1 Cure&#10;2 Dogs (Character/Weapon)&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":60,"minAge":8,"categoriesAndMechanics":["Exploration","Party Game","Zombies","Chit-Pull System","Dice Rolling","Trading"],"rating":3.69158,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/IXHUXVkRBuW793FlpirkpQ__thumb/img/xkJuerLrMOoJFOs0Af9ksy6lE9U=/fit-in/200x150/filters:strip_icc()/pic3011073.png","urlImage":"https://cf.geekdo-images.com/IXHUXVkRBuW793FlpirkpQ__original/img/Au5Dth90B2HBYCSuLMXlj4Q3W4M=/0x0/filters:format(png)/pic3011073.png"},{"bggId":"186833","name":"Peer Review","description":"Peer Review is a science simulation. The active players draw cards with subjects and hold a short lecture on their research of that subject. The other players are the peers and have to criticize the lecture on the grounds of desiderata cards. If a majority of other players rejects the research, it's the next player's turn; if the research is commendable, the lecturer receives new merit and desiderata cards.&#10;&#10;The goal of the game is to hold most merit cards after a predetermined time - prizes, scholarships, tenures, etc.&#10;&#10;The game contains German and English cards, but is aimed at players who master both. Additional use of Greek or at least Latin is recommended.&#10;&#10;","minPlayers":4,"maxPlayers":6,"minPlayTime":60,"maxPlayTime":90,"minAge":0,"categoriesAndMechanics":["Card Game","Educational","Humor","Negotiation","Party Game","Storytelling","Voting"],"rating":2.25,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/IdusRvNkR39tjBDwow2Lyw__thumb/img/h62RKj_dlXsQwJIrozwQwnGWJrQ=/fit-in/200x150/filters:strip_icc()/pic2736108.jpg","urlImage":"https://cf.geekdo-images.com/IdusRvNkR39tjBDwow2Lyw__original/img/1Yr903cVRD6Q-jH0NlLhaUoT3do=/0x0/filters:format(jpeg)/pic2736108.jpg"},{"bggId":"186841","name":"Anarcade Deck Building Game: Vector Blue","description":"Travel back to when the arcade was a dark, smoky den of iniquity.  Fame and respect can be bought for only a quarter if you have the skill.  Once you fill up the high score table on a game then you are the king!  Put a quarter on the glass and challenge the champ if you think you've got what it takes!&#10;&#10;Anarcade is a deck building game of stack control. Players play starter cards to earn Coins and buy better cards from the Game stacks. They can also use Coins to Score on the Games. Each player attempts to fill up a High Score table to take control of that game before an opponent can do the same. Once a player takes control of a stack, other players can't touch it. The winner is the first player to control 3 games.&#10;&#10;The Vector Blue set is tuned for deep strategy and features vector based retro arcade goodness! Combine with any other Anarcade set to expand the game to up to 4 players.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":45,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Humor","Video Game Theme","Deck, Bag, and Pool Building","Simultaneous Action Selection"],"rating":5,"complexity":3,"urlThumb":"https://cf.geekdo-images.com/3uubpIFkW1bSnuyv9HAneQ__thumb/img/M3WPH77PlnxFgIyyukRM1hIFyvk=/fit-in/200x150/filters:strip_icc()/pic4068852.png","urlImage":"https://cf.geekdo-images.com/3uubpIFkW1bSnuyv9HAneQ__original/img/Bc3_T_i21N7U--OZjnam1XW4mCg=/0x0/filters:format(png)/pic4068852.png"},{"bggId":"186843","name":"Chimera Sanctuary","description":"Trick-taking game set in a futuristic zoological park where mythical creatures battle for glory. Each player takes control of a Territory composed of 15 cards and tries win tricks.&#10;&#10;Chimera Sanctuary is a trick-taking game for 2 to 4 players set in a zoological park where mythical creatures fight for glory. Each player controls a Territory made of 15 cards and tries to win points (called Honors), or prevent other players from doing so... The player who starts the trick decides the suit the trick will be played in (among 4). The cards all have different values depending on the suit, and the weakest one of the trick may play a special rule called Virtue which can turn the trick and the game around.&#10;&#10;Players are able to put a card in a safe place, exchange one card with each other, and sucker punch one another.&#10;&#10;At the end of each round, Honors are counted, and players switch Territory.&#10;&#10;The game ends after 3 rounds. Whoever has the most Honors wins.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":45,"maxPlayTime":60,"minAge":10,"categoriesAndMechanics":["Card Game","Fantasy"],"rating":4.154285,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/M_jX9CfjgRESTeNwQjAlVQ__thumb/img/uXbdyDAmRVWsJDbRMrhzbUc9Hpk=/fit-in/200x150/filters:strip_icc()/pic2726720.jpg","urlImage":"https://cf.geekdo-images.com/M_jX9CfjgRESTeNwQjAlVQ__original/img/iN6dEAg49z60W2m5YTue6hV2KUk=/0x0/filters:format(jpeg)/pic2726720.jpg"},{"bggId":"186847","name":"Good and Plenty Game","description":"Late 1960's game based on the popular candy. Each player begins with 2 Good and Plenty Chips, and spin the spinner to determine order of play. Highest number goes first, lowest number goes last, etc.&#10;&#10;To play: Spin arrow and move your token the number of spaces indicated on the spinner. If you land on your own color, take one Good and Plenty chip. If you land on a Good and Plenty's Grabber space, give one Good and Plenty chip back. You may go backwards instead of forwards ONLY if doing so will land you on your color so you can get a Good and Plenty chip. First player to reach the Finish space gets 3 Good and Plenty chips, Second player gets two, Third player gets 1. If there is a fourth player, they get none. Winner is the player who has the most Good and Plenty chips once all players reach the Finish space. If the Good and Plenty chips are depleted before all players reach the Finish space, winner is the player with the most Good and Plenty chips at that time.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":4,"categoriesAndMechanics":["Children's Game","Roll / Spin and Move","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/efMEo8t6vjwhAlgsJ2rA_w__thumb/img/OSykOywp-84aJJb62siw2ESBWD4=/fit-in/200x150/filters:strip_icc()/pic2721109.jpg","urlImage":"https://cf.geekdo-images.com/efMEo8t6vjwhAlgsJ2rA_w__original/img/UMwOiEupjg4XrGV1UTv_LMpJhC0=/0x0/filters:format(jpeg)/pic2721109.jpg"},{"bggId":"186853","name":"Mana War","description":"Mana War is an original card game created with the spirit of simplicity, inclusion, and creativity in mind. There are 50 cards in the game (5 suits: Sun, Water, Fire, Rock, and Leaf; 10 of each). There are no numbers or values to the cards, no text to read or instructions to follow on the cards themselves. In fact, the games are so simple, the rules for the 4 included games each fit on a single card.&#10;&#10;Winning one of the Mana War games ranges from completing a grid of cards with unique rows and columns by yourself to a team effort of wit and luck to bluffing your way to be the sole winner in a cut-throat battle of memory and strategy.&#10;&#10;The main goal of Mana War was to create games which are so simple to learn, a small child or a drunk person could pick it up easily. This was achieved by having incredibly simple game components and designing game rules which challenge players to think logically while only needing to remember basic colors/shapes.&#10;&#10;","minPlayers":1,"maxPlayers":10,"minPlayTime":10,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Card Game","Children's Game","Hand Management","Memory"],"rating":2.25,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/2o6h3vjmesjrYZeBp1CTuw__thumb/img/GsuowJWwgaEQFk7L1QHpzh929_k=/fit-in/200x150/filters:strip_icc()/pic2897145.jpg","urlImage":"https://cf.geekdo-images.com/2o6h3vjmesjrYZeBp1CTuw__original/img/SaieHHWcDLIqwP_FaN0pqSYlPbY=/0x0/filters:format(jpeg)/pic2897145.jpg"},{"bggId":"186854","name":"Fate of the World","description":"Humans are gone and Earth is up for grabs. In Fate of the World you lead an alien army battling for control of the planet. Deploy your minions to build and populate cities as you expand your empire across the globe, or unleash a monster on one of your opponent's cities to stop them creating a sprawling metropolis of their own.&#10;&#10;Each creature card has two colors. Players collect sets of creatures with the same color to populate cities. Cities are constructed by sacrificing creatures and can be further expanded as the population grows. A limited hand size means the player must constantly balance collecting and sacrificing creatures in order to maintain their empire.&#10;&#10;Creatures can be deployed from your cities to attack an opponent's city. If a city's population is reduced to zero it is razed and construction must begin again. Players earn points for building cities, winning battles and expanding their empire. Fate of the World is a game of strategic depth that is fun for the whole family.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":20,"maxPlayTime":20,"minAge":0,"categoriesAndMechanics":["Card Game","City Building","Science Fiction","Hand Management","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/OdXq8pbUYlqwbGwcBGKorA__thumb/img/ii_-4eocLvAaGySGojkvbq9lUgY=/fit-in/200x150/filters:strip_icc()/pic2794082.jpg","urlImage":"https://cf.geekdo-images.com/OdXq8pbUYlqwbGwcBGKorA__original/img/rHww2goRLkfEpPpvLEbxN8nPjZA=/0x0/filters:format(jpeg)/pic2794082.jpg"},{"bggId":"186869","name":"White Elephant Gift Exchange","description":"Elephant Gift Exchange is the most fun you can have playing one of the crappiest games there is. You know those lame Christmas gift exchange games you are always plagued with at Christmas parties. We give you a super charged, fast paced version of that crappy game but in a simple 5-minute game with hilarious present cards. Presents range from unused items from your families closet to gifts you actually never want to receive. You will spend more time laughing about what present you just had then you will playing the actual game. Additionally we include one blank card so you can add your own family members and terrible gifts to your game. Pass the cards, laugh with each other, and whoever has the winner gift &ldquo;wins&rdquo; the game once all the foolish presents are opened.&#10;&#10;One card in the game is labeled as the &quot;Winner&quot; and one as the &quot;Loser&quot;. Roll the die, pass your crap however the die tells you to then, when the last player opens their present by turning it face up (unwrapped) the game is over. Whomever has the &quot;Winner&quot; card is the winner. If no player has the &quot;Winner&quot; card, then the player with the &quot;Loser&quot; card is just the big loser.&#10;&#10;","minPlayers":3,"maxPlayers":8,"minPlayTime":5,"maxPlayTime":15,"minAge":3,"categoriesAndMechanics":["Card Game","Children's Game","Memory","Party Game","Print & Play","Dice Rolling","Memory","Take That"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/VYg9XY8kFaXpJ3l4l_u0ug__thumb/img/jBI0hRJTIVkaUIGLO_G426F92k4=/fit-in/200x150/filters:strip_icc()/pic2729329.png","urlImage":"https://cf.geekdo-images.com/VYg9XY8kFaXpJ3l4l_u0ug__original/img/y-BsIOYVRyyvpjmOFDa24KxpM30=/0x0/filters:format(png)/pic2729329.png"},{"bggId":"186870","name":"Pentoggle","description":"Pentoggle is an abstract tile matching game for 2-6 players ages 7 and up. Players draw tiles from a bag, match them to tiles with the same number/differnt color or same color/different number, and earn points according to the numeric value of the tiles in the series. Tiles are matched not only horizontally but also vertically. The player who earns the most points wins.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":45,"maxPlayTime":60,"minAge":7,"categoriesAndMechanics":["Abstract Strategy","Tile Placement"],"rating":4,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/mMguubZ4oOZDe4y16ePDfA__thumb/img/sl2GMxCZDdnoC6p-URAyqWg8uHE=/fit-in/200x150/filters:strip_icc()/pic2760132.jpg","urlImage":"https://cf.geekdo-images.com/mMguubZ4oOZDe4y16ePDfA__original/img/T0VcvN_9isn3V3d_pjDpukhGNTw=/0x0/filters:format(jpeg)/pic2760132.jpg"},{"bggId":"186872","name":"Black Elephant Gift Exchange","description":"Elephant Gift Exchange is the most fun you can have playing one of the crappiest games there is. You know those lame Christmas gift exchange games you are always plagued with at Christmas parties. We give you a super charged, fast paced version of that crappy game but in a simple 5-minute game with hilarious present cards. Presents range from pop culture taboo items to a multitude of adult humor items. You will spend more time laughing about what present you just had then you will playing the actual game. Additionally we include one blank card so you can add your own family members and terrible gifts to your game. Pass the cards, laugh with each other, and whoever has the winner gift &ldquo;wins&rdquo; the game once all the foolish presents are opened.  Enjoy!&#10;&#10;One card in the game is labeled as the &quot;Winner&quot; and one as the &quot;Loser&quot;. Roll the die, pass your crap however the die tells you to then, when the last player opens their present by turning it face up (unwrapped) the game is over. Whomever has the &quot;Winner&quot; card is the winner of their great, exciting, and fantastically crappy game. If no player has the &quot;Winner&quot; card, then the player with the &quot;Loser&quot; card is just the big loser.&#10;&#10;","minPlayers":3,"maxPlayers":8,"minPlayTime":5,"maxPlayTime":15,"minAge":17,"categoriesAndMechanics":["Card Game","Humor","Mature / Adult","Party Game","Print & Play","Dice Rolling","Memory","Take That"],"rating":0.55,"complexity":0},{"bggId":"186887","name":"Valgkamp: et spil om Mudder, Magt og Mærkesage","description":"Danish description:&#10;Et spil om Mudder, Magt og M&aelig;rkesager&#10;&#10;Valgkamp handler om at v&aelig;re den politiker der bedst leder sit parti gennem valgkampen.&#10;&#10;Du bruger terninger til at erobre m&aelig;rkesager, undg&aring; skandaler og ikke mindst sv&aelig;rte de andre politikere til. Og ja, terninger er tilf&aelig;ldige, men det er politik ogs&aring; - selvom du gerne vil k&oslash;re en velsmurt valgmaskine, kan det sagtens g&aring; galt i sidste ende.&#10;&#10;Dagsordener giver point, skandaler tr&aelig;kker ned, men du kan ogs&aring; f&aring; point hvis du klarer dit partis hemmelige m&aring;l. Den med flest point ender med at vinde og blive statsminister.&#10;&#10;Translates to:&#10;Election&#10;A game about mud, power and agendas&#10;&#10;Election is all about being the politician who can lead the party best through the campaign.&#10;&#10;You use dice to take possession of agendas, avoid scandals, and to smear other politicians. And yes, dice are random, but so is politics - even if everything is running according to schedule, things can go wrong right at the last minute.&#10;&#10;Agendas gives points, scandals deducts points, and you can get bonus points if you acquire your party's secret goal. Whoever gets most points wins the game, and is elected prime minister.&#10;&#10;Gameplay:&#10;&#10;Each turn the player throws the 6 dice. 1's can never be re-thrown, and are always bad, since three of those will give you a scandal. Three 6's can be used to throw mud at an opponent, which will give them a scandal. Everything in between cen be use to take control of agendas. Agendas require som combination of dice, like three 2's, or two 4's and two 5's, or many other Yatzee like combinations. Agendas give points, and some gives you special abilities. Agendas comes in five different themes, and some political goals is to acquire the most of a certain type, or many different types, or the least scandals or...&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":10,"maxPlayTime":30,"minAge":15,"categoriesAndMechanics":["Dice","Humor","Mature / Adult","Party Game","Political","Print & Play","Dice Rolling","Set Collection"],"rating":3,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/dWjwvk5TCQ--0GFDaFe1PA__thumb/img/-Zy1SNyVZ4qmnvcxztYeuzqxMCI=/fit-in/200x150/filters:strip_icc()/pic3884185.png","urlImage":"https://cf.geekdo-images.com/dWjwvk5TCQ--0GFDaFe1PA__original/img/gV4244ysCjfIaF-RbUTEpGibBjo=/0x0/filters:format(png)/pic3884185.png"},{"bggId":"186889","name":"Quaffers","description":"From the box:&#10;It's about having fun whilst learning about wine! The board game is for 4 or more adults and key features include blind tasting and the testing of wine knowledge through answering &quot;Experience&quot; questions of varying levels of difficulty.&#10;&#10;Each player is the owner of an internationally acclaimed vineyard. Each circuit of the board is a year in the life of their business and players must travel around the board to bottle their yield and sell their wine at market.&#10;&#10;Each player will need to bring a bottle of wine, which they have to disguise from other players using one of the special Quaffers drawstring bags provided in the box.&#10;&#10;To win the game, players can eliminate all others (survive without going bankrupt) or take over two other vineyards. Players vineyards are put up for sale when their wine is identified - &quot;Taste or Bid&quot; squares let the player have a go at identifying the masked bottle of wine that one of the players has brought to the party.&#10;&#10;","minPlayers":4,"maxPlayers":6,"minPlayTime":90,"maxPlayTime":180,"minAge":18,"categoriesAndMechanics":["Industry / Manufacturing","Mature / Adult","Trivia","Roll / Spin and Move"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/IW8zktrr-xqQb6L2W_PslA__thumb/img/VZ6C8eq9Acu6txb2LyC1qfnxmsg=/fit-in/200x150/filters:strip_icc()/pic7221150.jpg","urlImage":"https://cf.geekdo-images.com/IW8zktrr-xqQb6L2W_PslA__original/img/l7_fUj-_EGONu6g0ppyblCStiok=/0x0/filters:format(jpeg)/pic7221150.jpg"},{"bggId":"186890","name":"Who's the Princess?","description":"A fantastic educational game from the multi-award winning Chimp and Zee range of games and puzzles. Each child plays the part of a princess, who needs to collect a pair of shoes, a tiara, a ball gown, and an invitation. Once all the items are collected, the player places them in their own coach, in order to be the first to go to the ball but each player needs to watch out for the wicked queen. The first player to collect all 4 cards and get back to their castle space is the real Princess. This game is great fun for children and easy for parents to explain. This game can help children learn through play. Easy to set up you can start playing in just a few minutes and everyone has a chance to win. Only takes ten minutes to play and is even great fun when it's not your turn.&#10;&#10;Who's the Princess was created to help children with colours, shapes, matching, and co-ordination along with developing the ability to play together. The game is presented in a quality cardboard carton complete with carry-handle and glitter printing. This game is for 2 - 4 players and suitable for ages 3 years and over.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":3,"categoriesAndMechanics":["Children's Game"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/07xIfv0KFrhrYUEMoUDvvg__thumb/img/47NJfUJvFCTuSncjjNLiyM0fZdA=/fit-in/200x150/filters:strip_icc()/pic2731990.jpg","urlImage":"https://cf.geekdo-images.com/07xIfv0KFrhrYUEMoUDvvg__original/img/fbWnCcLsNdRVJS_NxbOGVLfUySY=/0x0/filters:format(jpeg)/pic2731990.jpg"},{"bggId":"186895","name":"Planet Zoom","description":"First complete the puzzle about different terrains and vehicles.&#10;Then take turns matching the different modes of transport to the correct categories.&#10;Who has placed the most tiles to the correct categories is the winner.&#10;&#10;","minPlayers":1,"maxPlayers":6,"minPlayTime":10,"maxPlayTime":20,"minAge":3,"categoriesAndMechanics":["Children's Game","Puzzle","Transportation"],"rating":0,"complexity":0},{"bggId":"186903","name":"Hopalong","description":"It&acute;s a Pachisi-Ludo variant where your pawn can land on a another piece and get a free ride if that other piece moves. If the double-stack lands on a piece or another piece moves on the the double-stack, then the lowest piece have to move back to that color's starting-space. A piece also has to move back to the starting-space if it moves along in another color's safety-line in the end of the road. The first player to get all four pawns in the center wins.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":6,"categoriesAndMechanics":["Children's Game","Roll / Spin and Move"],"rating":1.25,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/CiPULqf6M1jm_XD3Brrgww__thumb/img/BnoFE-Qasv-ZD-r8qNVG1pi9hSI=/fit-in/200x150/filters:strip_icc()/pic2737524.jpg","urlImage":"https://cf.geekdo-images.com/CiPULqf6M1jm_XD3Brrgww__original/img/Y6RTb4i0ejyvcGaB5FAO9Z0iTJM=/0x0/filters:format(jpeg)/pic2737524.jpg"},{"bggId":"186906","name":"Funny Bunny Rhyming Game","description":"Find two bunnies with words that rhyme. Remember where they are, it's memory time! 2 levels of play.&#10;&#10;Includes: &#10;4 double-sided game cards&#10;40 bunny cards&#10;Activity guide&#10;&#10;Players put the 40 bunny cards in the middle, face down. Each player takes a game card which has 4 spaces for bunny cards. Players each draw a bunny card and place it on their game card. This is the word they must rhyme. Players take turns turning over a bunny card. It if rhymes with their first word, they add it to their game card. If not, they turn it back over. The other players may turn this same card over if it rhymes with their word, or they may turn another card over. First player to fill their card with 5 words that rhyme, wins.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":5,"categoriesAndMechanics":["Children's Game","Memory"],"rating":2,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/wzG58MetNwekDOZW_q27MQ__thumb/img/ozJPoYQ4ZfbWKLduGos5dav63Ts=/fit-in/200x150/filters:strip_icc()/pic2722041.jpg","urlImage":"https://cf.geekdo-images.com/wzG58MetNwekDOZW_q27MQ__original/img/6HzCk-TR2xupeRY7n7J2cFmPIDg=/0x0/filters:format(jpeg)/pic2722041.jpg"},{"bggId":"186918","name":"Top","description":"Each of the 2-4 players control 3 pins carrying replaceable tokens. There are 12 tokens numbered from 1 to 12. The players move their pins on the board horizontally, vertically or diagonally. When 2 pins from 2 different players are located diagonal next to each other their tokens can be exchanged. The game ends when all pins reached their destination. Each player sums up the values of the tokens his pins are holding. The winner is the player which has achieved the highest sum.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":8,"categoriesAndMechanics":["Abstract Strategy"],"rating":3,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/v6Phfs6g58mWWncG74T11w__thumb/img/3hm_o4EfMeliXpgknAqUfv5R66Q=/fit-in/200x150/filters:strip_icc()/pic5595808.jpg","urlImage":"https://cf.geekdo-images.com/v6Phfs6g58mWWncG74T11w__original/img/-uQxkPScNCvexfESB_ckMzbLiRU=/0x0/filters:format(jpeg)/pic5595808.jpg"},{"bggId":"186925","name":"Flip Flop","description":"Flip Flop is trick taking game in which players must complete objectives to score points. But... beware !&#10;The cards are double-sided with different values on each side, each player sees the reverse of the other players' hands and can have them flip-flop their hand to completely change the course of the game !&#10;&#10;","minPlayers":3,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Card Game","Trick-taking"],"rating":2.7904,"complexity":2.3333,"urlThumb":"https://cf.geekdo-images.com/RUWgMR5CQ25pxKY1E-eKAA__thumb/img/OOWwlLidVCgdJRBQiHLDogzXtL4=/fit-in/200x150/filters:strip_icc()/pic2726908.jpg","urlImage":"https://cf.geekdo-images.com/RUWgMR5CQ25pxKY1E-eKAA__original/img/ouQxFm-4ghFtuC02DHWam30y-4Y=/0x0/filters:format(jpeg)/pic2726908.jpg"},{"bggId":"186926","name":"The Flintstone Kids Game","description":"Yabba Dabba Doo! It's Rock 'n' Rolling Stone Age Fun!&#10;&#10;The Flintstone Kids Go To The Bedrock Concert. Includes Board, 4 Die Cut Figures &amp; Stands, 4 Die Cut Skateboards, 2 Deck of 54 Cards (27 Skateboard On &amp; 27 Skateboard Off)&#10;&#10;Players move on the board by drawing cards and following the instructions. Players begin with the skateboard off. Players draw from the Skateboard Off cards until they are instructed to put on the skateboard. (Slip the skateboard over the head of the figure to put the skateboard on) Once on the skateboard, they draw from the Skateboard On cards. Winner is the first to reach the Bedrock Concert.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":5,"categoriesAndMechanics":["Children's Game","Movies / TV / Radio theme"],"rating":3,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/d7U60xh2owJDUvoEPYfNoA__thumb/img/akqbcXf4RLQiQYvF604rmduLtQQ=/fit-in/200x150/filters:strip_icc()/pic2722530.jpg","urlImage":"https://cf.geekdo-images.com/d7U60xh2owJDUvoEPYfNoA__original/img/0JueTo2EtcMTgMQy5ZkaYZTl11M=/0x0/filters:format(jpeg)/pic2722530.jpg"},{"bggId":"186941","name":"Kama Sutra Memory","description":"Kama Sutra Memory is an adult memory game that teaches you about the Kama Sutra. The game can be played with or without clothes on.&#10;&#10;The game includes 48 cards. It can be played as a conventional memory game, or in three official variants:&#10;&#10;Variant 1 - The Quick One&#10;&#10;For two players. 12 sets - ignore text.&#10;&#10;The cards are placed face down and is turned in pairs, like any other memory game. If the cards are not the same (= two different KS positions), the player have to pick one of them and the players have to try to do this position. If it is a match the cards are removed without any trial. The most collected pairs wins.&#10;&#10;Variant 2 - The Crash Course&#10;&#10;2 players. 12 sets - use text, ignore points.&#10;&#10;This game is played reversed than above; the 24 cards are placed face down, but this time the tasks first come when a match is found; on each card is a text and as a pair they make a task, which have to be tried out. The most collected pairs wins.&#10;&#10;Variant 3 - The Super Orgie&#10;&#10;2 or more players. All cards and texts in use.&#10;&#10;In this variant, the players flip over four of the 48 face down cards; when there is a match, the talks are read and have to be followed. Each set of four cards is worth 50 points and each completed task gives points. The player with the most points wins.&#10;&#10;","minPlayers":2,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":18,"categoriesAndMechanics":["Action / Dexterity","Educational","Mature / Adult","Memory","Acting","Memory","Set Collection","Team-Based Game"],"rating":4,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/fiy-y-lxq7xaZscC-dGbUQ__thumb/img/kMsdie9v90UzkymsdTI-vufn5yE=/fit-in/200x150/filters:strip_icc()/pic7523266.jpg","urlImage":"https://cf.geekdo-images.com/fiy-y-lxq7xaZscC-dGbUQ__original/img/iYZTpohO1pTIJcDEzQu1uCprKcI=/0x0/filters:format(jpeg)/pic7523266.jpg"},{"bggId":"186942","name":"Lock Dice","description":"A dice game that simulates competitive lockpicking.&#10;&#10;Players will contribute dice (&quot;pins&quot;) to a lock in the center of the table, and then will take turns attempting to pick the lock by matching die rolls.  As the game goes on, the player's skill and tools increase, allowing for faster and more efficient picking.&#10;&#10;","minPlayers":2,"maxPlayers":8,"minPlayTime":15,"maxPlayTime":60,"minAge":0,"categoriesAndMechanics":["Dice","Puzzle","Deck, Bag, and Pool Building","Dice Rolling","Pattern Building","Set Collection"],"rating":0,"complexity":0},{"bggId":"186950","name":"Mad Mansion","description":"Mad Mansion is a competitive tile-laying game for two players, ages 10 and up, that plays in around 30 minutes.&#10; In the game, each player represents a team of 8 Workers. During the game, players place between one to three tiles per turn to build Hallways, Rooms, and groups of linked rooms called Suites to create an overhead map of the mansion. The Workers who successfully build and complete the most Rooms in the Mansion will win the game! To score points, players place Workers on the tiles they build to claim Rooms and Suites that are Under Construction. At the end of the game, points are scored for the total number of Rooms claimed by each player... one point each for Rooms that are Under Construction, and two points each for Rooms that have been Completed (meaning that every door in the Room or Suite is connected to a hallway, or all of the rooms are bounded by solid walls.) When all of the available tiles in the game have been placed the game is over and the player with the highest number of points wins. &#10; Every game is a unique experience as no two Mansion layouts are ever the same.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":45,"minAge":10,"categoriesAndMechanics":["Abstract Strategy","Tile Placement"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/Axwt5EVMUiEUVQy5KdduWQ__thumb/img/DefZxQL76xx0PKlQnvafamHkf0g=/fit-in/200x150/filters:strip_icc()/pic2850026.jpg","urlImage":"https://cf.geekdo-images.com/Axwt5EVMUiEUVQy5KdduWQ__original/img/OeRSduTeGVomAehk953hBCe34k4=/0x0/filters:format(jpeg)/pic2850026.jpg"},{"bggId":"186956","name":"Think Big Science","description":"From the publisher:&#10;Climb the tower to conquer the big ideas of science! Unique 3&ndash;D game board combines with important core&ndash;concept questions for a game that's exciting and educational.&#10;&#10;Reinforces key &quot;big idea&quot; science concepts, content vocabulary, data and graph interpretation, and life science topics with engaging game questions&#10;&#10;Offers opportunities to review and integrate concepts as players answer questions to climb the tower until they reach the top&ndash;level core concept question for the win&#10;&#10;Focuses on specific content with color&ndash;coded, standards&ndash;based questions on animals, plants, life cycles, food chains, human body and more&#10;&#10;Engages students with eye&ndash;catching graphics and game cards that feature photos, graphs, charts and diagrams&#10;&#10;Helps students become comfortable with standardized test&ndash;style short answer and multiple choice questions&#10;&#10;Includes 200 double&ndash;sided question cards in a storage box and an easy&ndash;to&ndash;assemble game tower measuring 3.5&quot; in diameter at the bottom x 10.75&quot;H&#10;&#10;Grades 3&ndash;5&#10;&#10;How to Play:&#10;&#10;     Answer questions correctly to race around each level&#10;     Three correct answers move player up a level&#10;     First player to correctly answer the top&ndash;level &quot;big idea question&quot; wins!&#10;&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":45,"minAge":8,"categoriesAndMechanics":["Educational","Trivia","Area Movement"],"rating":2.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/p1sfsnjLajTf6-V3lQ3DAQ__thumb/img/AYdhiQVH84kzj-yY8-aDG97tfRo=/fit-in/200x150/filters:strip_icc()/pic2730951.jpg","urlImage":"https://cf.geekdo-images.com/p1sfsnjLajTf6-V3lQ3DAQ__original/img/TrE56eak2jIF_hE4uS7aSfYK4FQ=/0x0/filters:format(jpeg)/pic2730951.jpg"},{"bggId":"186957","name":"Wild Word Adventure","description":"Product Description:&#10;Motivate beginning readers to build 3, 4 and even 5 letter words! Reinforces letter recognition, beginning and ending consonant sounds, rhyming and spelling. Color coded for 3 levels of play.&#10;&#10;Includes:&#10;&#10;&#10;     80 self-checking question cards&#10;     104 lowercase letter cards&#10;     25 word cards&#10;     Animal pawns&#10;     Game board&#10;&#10;&#10;Grades: Kindergarten +&#10;&#10;How to play:&#10;&#10;     Pick a word card, then roll the die and hop around the board.&#10;     To earn a letter, correctly answer the question that matches the color you land on.&#10;     Be the first to match up all letters to those on your word card to win!&#10;&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":10,"maxPlayTime":15,"minAge":5,"categoriesAndMechanics":["Educational","Area Movement"],"rating":2,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/DEdYI5X-S_f2jhwQy8JzLg__thumb/img/2DHOK2k7lPViMZsWy3WTDEuCzCI=/fit-in/200x150/filters:strip_icc()/pic2739327.png","urlImage":"https://cf.geekdo-images.com/DEdYI5X-S_f2jhwQy8JzLg__original/img/Uqx6Yw9QfDeYAz1M-sd-zV5_BHE=/0x0/filters:format(png)/pic2739327.png"},{"bggId":"186958","name":"Hidden Hints","description":"From the publisher:&#10;&#10;Wrangle your way through word-sleuthing adventures to earn a shot at solving a mystery.&#10;&#10;Challenges kids to figure out what words mean by clues in the text around them&#10;&#10;Broadens vocabulary through engaging, mystery-themed game play&#10;&#10;Includes 43 double-sided, multiple-choice question cards; 7 double-sided game play cards, 40 self-checking hint cards, 16 game pieces, briefcase, and Activity Guide with answer key&#10;&#10;Durable cardboard briefcase measures 5&quot;L x 7&quot;W x 1.5&quot;H&#10;&#10;How to play:&#10;&#10;    Select a hint card and place it in the briefcase&mdash;don&rsquo;t peek!&#10;    Draw a context clue card and answer the question.&#10;    Answer 3 questions correctly to earn a hint about your mystery object.&#10;    Be the first to solve your mystery, and win!&#10;&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":30,"minAge":7,"categoriesAndMechanics":["Educational","Trivia"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/p7fCgVqmxLcVvJaMAmUlwQ__thumb/img/y_Lv7w-Dh-e-3PrEvNuOEJSfDbk=/fit-in/200x150/filters:strip_icc()/pic2730964.jpg","urlImage":"https://cf.geekdo-images.com/p7fCgVqmxLcVvJaMAmUlwQ__original/img/gi5EUMaJCwjnCoB_NR_xWou23Sg=/0x0/filters:format(jpeg)/pic2730964.jpg"},{"bggId":"186959","name":"Healthy Helpings","description":"From the publisher:&#10;Be the first to fill your plate with a balanced meal! Follow the USDA&rsquo;s MyPlate guidelines. Food cards have real-life photos and are self-checking (the back of the photo matches the food group it belongs in)&#10;&#10;Includes: &#10;&#10;     50 food cards&#10;     4 placemats&#10;     1 spinner&#10;     Activity guide&#10;&#10;&#10;Learning Style: Visual&#10;&#10;Skill development: &#10;Self-Help- Provides a visual tool to help students understand portion control according to the five food groups when filling their plate at meal time.&#10;&#10;Social &amp; Behavioral- Real-life photo cards help students learn to make nutritional choices when having a snack or making a meal based on the five food groups.&#10;&#10;Basic Concepts- Promotes identification of the 5 food groups- fruits, vegetables, grains, protein and dairy. By learning the food groups, students are creating building blocks for maintaining a healthy diet.&#10;&#10;How to play:&#10;&#10;     Spin the spinner to select a food group. &#10;     Pick a food card that matches the group.&#10;     The first player with a complete, balanced MyPlate wins!&#10;&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":10,"maxPlayTime":20,"minAge":4,"categoriesAndMechanics":["Educational","Set Collection"],"rating":2.25,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/IYgW_RIOZ_LEPTc5CCp63Q__thumb/img/N9NHshdvN7VwaRvBf0kKFmIMQ_4=/fit-in/200x150/filters:strip_icc()/pic2730956.jpg","urlImage":"https://cf.geekdo-images.com/IYgW_RIOZ_LEPTc5CCp63Q__original/img/mIl8wvKtseTtelHI0cO1Sn7FOjY=/0x0/filters:format(jpeg)/pic2730956.jpg"},{"bggId":"186960","name":"tri-FACTa","description":"From the publisher:&#10;Make addition and subtraction 3 times as fun! Dish out the numbered playing cards, then using the familiar triangle board as a visual cue, fill in the missing spots to complete fact families. Be the first player to play all your cards, and call out &ldquo;tri-FACTa&quot;!&#10;Includes triangle game board, 100 cards (facts up to 20) and 4 trays&#10;&#10;Object of the game:&#10;Be the first player to play all your cards, and call out &quot;tri-FACTa!&quot;&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":30,"minAge":6,"categoriesAndMechanics":["Educational","Math","Hand Management","Tile Placement"],"rating":2.305555,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/F3zhtFzQSdK4qlBOFNwrdw__thumb/img/QbFtPazTq_uQPZNNj0aFcCTBROE=/fit-in/200x150/filters:strip_icc()/pic2730948.jpg","urlImage":"https://cf.geekdo-images.com/F3zhtFzQSdK4qlBOFNwrdw__original/img/npWmSI9m7f4KURA6mJ3veOXDL9I=/0x0/filters:format(jpeg)/pic2730948.jpg"},{"bggId":"186961","name":"Pulp City: Supreme Edition","description":"On the coast of California lies the most exciting city in America. In this place aliens rub shoulders with ancient gods. Robots join forces with those born with strange powers and fantastic abilities. It&rsquo;s a place filled with heroes and villains, where everyday men and women live side by side with Supremes.&#10;&#10;This is Pulp City. Pulp City is playground where all your favorite 80&rsquo;s action movies, comic books, and cartoons collide. It&rsquo;s a setting perfect for crazy battles and thrilling heroics. Dastardly villain and large than life heroes are all part and parcel. So if you love any of the above or all of it together you should be in Pulp City.&#10;&#10;Pulp City is a heroic 32mm skirmish game where you the player take control of a Team of Supremes and lead them into battle against rival Teams. Pulp City allows you to live out your favorite action movie moments, destroying buildings, throwing cars, saving the innocent, or just pummeling others into the ground.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":30,"maxPlayTime":150,"minAge":13,"categoriesAndMechanics":["Miniatures","Action Points","Dice Rolling"],"rating":4.235295,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/AcR0bNfCvdvueRDzOtvnPg__thumb/img/WGMZxFmmNSFWLblfwDXQjEZzLEk=/fit-in/200x150/filters:strip_icc()/pic2730952.jpg","urlImage":"https://cf.geekdo-images.com/AcR0bNfCvdvueRDzOtvnPg__original/img/F5uqFzH280BXMow7w0mTAxeRfN8=/0x0/filters:format(jpeg)/pic2730952.jpg"},{"bggId":"186969","name":"The Star Adventure","description":"Little stars have fallen from the sky, into the players' room. Help them get back to the sky, to their mother!&#10;&#10;A game designed for children as young as 3. Players alternate in throwing the color-coded dice and stepping up the star-ladder.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":10,"maxPlayTime":20,"minAge":3,"categoriesAndMechanics":["Children's Game","Dice Rolling","Roll / Spin and Move"],"rating":2.75,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/ywfIYNNkkwb7e_fp9LPeaQ__thumb/img/c2j_oDgmKXL2_LL3ifhGsBZIBE4=/fit-in/200x150/filters:strip_icc()/pic2729063.jpg","urlImage":"https://cf.geekdo-images.com/ywfIYNNkkwb7e_fp9LPeaQ__original/img/USeBcMjCJbtB8q46SJ6_qV2p-pc=/0x0/filters:format(jpeg)/pic2729063.jpg"},{"bggId":"186972","name":"De Bumbatrein","description":"Before the game starts you can build up the variable game board that consists of different train pieces. Every piece shows 3 objects in a different color. The players start in the beginning of the train and roll the die. They can move their pawn to the next object on the game board that has the same color as the die. As soon as you roll a color that isn't present between your pawn and the locomotive the player can move his pawn to the locomotive and he or she is the winner of the game.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":10,"maxPlayTime":15,"minAge":3,"categoriesAndMechanics":["Children's Game","Racing","Trains","Dice Rolling","Modular Board"],"rating":3.25,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/zcFziee_F1mlugdXDvPzYw__thumb/img/CyMZjlV5rM3jgLDbmzE4dtoxBpA=/fit-in/200x150/filters:strip_icc()/pic2728568.jpg","urlImage":"https://cf.geekdo-images.com/zcFziee_F1mlugdXDvPzYw__original/img/Z5soWUdZknu4_YHrWA9Fstp_qbg=/0x0/filters:format(jpeg)/pic2728568.jpg"},{"bggId":"186977","name":"Precipitate","description":"The Fascinating Game of Chemical Formulas.&#10;&#10;The idea of the game is to arrange cards as to form compounds letting each card represent an atom.  Each player must have the correct number and kinds of cards for the compound being made, i.e. H2O - must have one oxygen card and two hydrogen cards.&#10;&#10;Game is similar to rummy.  Players dealt 9 cards.  One draw pile and one discard pile (starting with one card up.)  Players draw one card (from either pile) and discard one card on turn.  Play continues until one player has all cards in had made into compounds.  Player lays all cards down and calls out &quot;Precipitate.&quot;&#10;&#10;Every player gets score for cards made into compounds, points increasing for number of cards per compound.  Player who called &quot;Precipitate&quot; gets 10 points.  Game played until one player has 100 points.&#10;&#10;Game can be played with any number of players (solitaire directions included) but best with 2-6.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Card Game","Educational","Set Collection"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/2zV0f2EMfcHr1iMdjOFjoQ__thumb/img/PH3eICeJFMSQBg0rB4WjoHeeKss=/fit-in/200x150/filters:strip_icc()/pic3191511.jpg","urlImage":"https://cf.geekdo-images.com/2zV0f2EMfcHr1iMdjOFjoQ__original/img/7AR5tOVwX4sEpuTX_x-kvTa3New=/0x0/filters:format(jpeg)/pic3191511.jpg"},{"bggId":"186979","name":"Ghost Hunter: Witches","description":"This Halloween the land has been blighted by an unnatural curse. Crops have rotted in the fields, feral beasts stalk the villages and children wake with night terrors.The ever vigilant members of the Infernal Club have discovered the source of the corruption. Witches!!!As one of the club&rsquo;s supernatural enforcers it is the players' duty to conduct a witch hunt and capture as many of the coven as they dare.&#10;&#10;Ghost Hunter: Witches  is a card game for 2 or more players (up to 6 with one deck or 12 with two decks). Players must lay down higher and higher Witch cards until one can lay a set of three capturing all the cards on the table at that time. A player who cannot keep up with the witches being laid will be forced to pick up the stack and add it to their hand. Every captured card is worth points at the end of the game. Many cards have special rules that effect the order of play, who may capture or other game dynamics. Some cards are marked as 'innocent' meaning that if they are captured, which is often unavoidable, they are worth minus points at the end of the game. When the first player has gotten rid of all of their cards the game ends, then the player who has the most positive points wins overall with the others being ranked behind them based on their scores.&#10;&#10;The deck can be integrated with all the other Ghost Hunter decks like the blues Spirits deck or the red Vampires deck.&#10;&#10;So assemble your trusted associates, light your torches and prepare for the wickedness of Ghost Hunter: Witches.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":10,"maxPlayTime":20,"minAge":12,"categoriesAndMechanics":["Card Game","Fantasy","Horror","Hand Management","Take That","Trick-taking"],"rating":3.571665,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/aahRTLwV02L7aj9DORjiBw__thumb/img/lKC6F0b7SdCbJAnsmFAFHEIi6qI=/fit-in/200x150/filters:strip_icc()/pic2729044.jpg","urlImage":"https://cf.geekdo-images.com/aahRTLwV02L7aj9DORjiBw__original/img/WnKvE57jBeHMsDzGxdWTDV_iyVA=/0x0/filters:format(jpeg)/pic2729044.jpg"},{"bggId":"186981","name":"Fossil Hunters","description":"Fossil Hunters is a game of area encirclement for 2-5 players. All players have access to the same slab of rock. The goal is to split it apart, divide the spoils, and form complete dinosaur skeletons. Large dinosaurs are much more lucrative, but incomplete skeletons do not score!&#10;&#10;Using wooden sticks to divide the board, players collectively determine which tiles will be claimed and by whom. As the board splits and shrinks, players are pressured to finish what they've started before every fossil is claimed. Timing is everything, so sometimes it is best to take a partial turn and conserve resources for later. Each player also holds a unique single-use tool. This should be employed at the best moment for the greatest reward.&#10;&#10;Fossil Hunters is a short small-box game, taking only 20 minutes to play.&#10;&#10;","minPlayers":2,"maxPlayers":5,"minPlayTime":15,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Prehistoric","Area Majority / Influence"],"rating":2,"complexity":1},{"bggId":"186983","name":"Presto","description":"From the designer:&#10;&#10;&quot;Many musicians, even those of considerable experience, frequently have difficulty in sight reading music and it is often necessary for them to play a selection a number of times before they can be assured of rendering it with accuracy. This is due largely to the fact that many musicians are not sufficiently familiar with the positions of the notes of the musical scale to be able to recognize instantly a given note from its position, which is essential in sight reading. This is especially true of beginners or persons inexperienced in reading music.&quot; This game aims to teach the notes of the scale through game play. Includes board, 48 cards and 16 playing pieces, four of each color.&#10;&#10;The board has the treble staff and the bass staff running continuously around the board with the musical notes of the scale on them, with the name of the note in small letters. Players have four game pieces each. The object is to move through the notes of the scales to get all four game pieces to the W-I-N-S zone. The players turn cards to determine what letter of the scale to move to. At first they may need to refer to the names of the notes, but as the game is played, they will begin to recognize the position of the notes, aiding in their sight reading ability. Players may move any of their pieces, and may have to move backward in order to get to the note indicated. The first player to get all his pieces in the W-I-N-S zone is the winner.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":0,"maxPlayTime":0,"minAge":5,"categoriesAndMechanics":["Music","Open Drafting"],"rating":0,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/PyUzCQsrIPqVtNI1Tapl_w__thumb/img/FNikKQx4a8LeoMLQCT95kP_rkY4=/fit-in/200x150/filters:strip_icc()/pic2728308.jpg","urlImage":"https://cf.geekdo-images.com/PyUzCQsrIPqVtNI1Tapl_w__original/img/HeTIl3ybZu9K69M8wzQ6DISkbI8=/0x0/filters:format(jpeg)/pic2728308.jpg"},{"bggId":"186985","name":"Hipster: The Card Game","description":"The Hippest of the Hip&#10;&#10;Strategy is the name of the game as you compete to be the coolest in town in the game of Hipster. Collect your gear and play against others in your quest to be hipper than everyone else. But watch out, because once things become too cool they&rsquo;re no longer cool.&#10;&#10;In Hipster you want to be cooler than everyone else, and you want to do it first. Each player gets five cards at the start of the game, and they're each trying to match up three cards in front of them with the three cards in the center. Those center cards are &quot;What's Cool Right Now&quot; and the only way to win is to be cool like those cards.&#10;&#10;But watch out: if too many people get into those center cards, those &quot;Cool&quot; cards are no longer cool, and the central cards go away, replaced by the latest, hippest thing in town. What's cool is always changing, ever shifting, so if you want to be hip you gotta live on the edge, adapting quickly to win the game.&#10;&#10;Hipster features are selection of cards, with three different &quot;Cool&quot; card suits -- Culture, Fashion, and Trinkets -- along with instant cards you can play on others, Play When You Want cards, and new rules you can introduce to change the rules of the gam, Damn the Man cards. To win the game, you have to be fast, you have to be quick, and above all, you have to be the coolest, hippest hipster around.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":30,"minAge":0,"categoriesAndMechanics":["Card Game","Set Collection","Take That"],"rating":2.4375,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/39URqyXkhr9-wvN0iKSLbg__thumb/img/-ANzdrnBlvwDpmZGsRdCS8xrz3Q=/fit-in/200x150/filters:strip_icc()/pic2731352.png","urlImage":"https://cf.geekdo-images.com/39URqyXkhr9-wvN0iKSLbg__original/img/JqBqBktLpdoWQO_awv2Bnv5rAdw=/0x0/filters:format(png)/pic2731352.png"},{"bggId":"186991","name":"Apicultura","description":"Apicultura is a card drafting, resource conversion game about breeding bees, harvesting honey and selling it to maximize your profit.&#10;&#10;The player at the end of the game who has collected the most income is the winner.&#10;&#10;In Apicultura, each player has a player board representing their own individual honey farm and a hand of identical action cards.&#10;&#10;At the start of the game the players begin with 2 lowly Level A hives (these can be upgraded later).&#10;&#10;Every turn the Action Cards are drafted which allow players to Breed Bees (add a new hive in a space where there are already 2 hives), Plant Fields (increasing the maximum number of hives permitted), Produce Honey (&quot;spending&quot; hives for the round to generate honey), Upgrade Hives which increases the quality (and value) of the honey produced and as well as Sell Honey (either to exclusive honey boutiques or direct to the public at a reduced rate) depending on the demand for their particular product. The honey can also be marketed or refined which can increases its value, or simply opt to generate a small amount of income.&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":30,"maxPlayTime":45,"minAge":13,"categoriesAndMechanics":["Farming","Print & Play","Open Drafting"],"rating":3.333335,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/HYTpLhwMtuu4QjYXCNKjBA__thumb/img/eqPIfPXJtATnBYDobAK3au1ndqU=/fit-in/200x150/filters:strip_icc()/pic2735569.jpg","urlImage":"https://cf.geekdo-images.com/HYTpLhwMtuu4QjYXCNKjBA__original/img/aCtw1HZekt_-d2HA97ndX-MNT6g=/0x0/filters:format(jpeg)/pic2735569.jpg"},{"bggId":"187002","name":"Storms in the East: Finland-Romania 1944","description":"Storms in the East: Finland-Romania 1944 is two games in one;&#10;&#10;1. June 1944 marked the beginning of one of the greatest battles on Scandinavian soil, Tali-Ihantala. Stalin gave the order to finish up with Finland in order to concentrate on Operation Bagration that had just begun. Subsequently, Soviet forces had to first batter the fortified VKT-line then quickly break through toward the north.&#10;At the beginning, with the help of the 30th Guards army, the Soviet advance was slow but steady until they formed a salient near Ihantala. Attrition was great in both camps, but the arrival of the Finnish armoured division coupled with a particularly effective artillery fire changed the situation and the following counter-attack led to the pushing back of the Soviets.&#10;Finally, the Finnish forces succeeded with their last reserves and the German aviation to stabilize the lines. Stalin canceled the offensive and negotiated with the Finnish authorities to obtain the reversal of this former ally against the Germans. Finland was saved but at what cost!&#10;&#10;2. Continuing their rapid advance across the country of their new ally, Romania, the Soviets were engaged by the Hungarian 2nd army in Transylvania before arriving in the local capital Cluj. Confronted by the enemy avant-guard, the Hungarians went so far as to launch an offensive along the Mure&#197;&#159;. After a brief phase of surprise, the Stavka reacted by ordering the Soviet units present as well as the Romanian 4th army, in the process of reorganizing, to reach Turda and its pass. Attacks in several sectors along the Mure&#197;&#159; ensued that the Hungarian forces as well as the German reinforcements had a difficult time repelling.&#10;Even the 23rd Panzer Division struggled to contain the repeated assaults by the Soviet and Romanian forces. Fortunately for the Axis, the allied losses were such that the Stavka decided mid-October to circumvent Turda by the east.&#10;As the Soviet, will you be able to break through the front in a decisive way and as a member of the Axis, will you succeed in containing the red waves?&#10;&#10;Game components:&#10;&bull; One 59 x 41 cm map (printed front and back)&#10;&bull; 216 die-cut counters and markers&#10;&bull; 1 rule book with 7 scenarios including 2 campaigns&#10;&bull; 1 color player aid&#10;&#10;&mdash;description from the publisher&#10;&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":0,"maxPlayTime":0,"minAge":12,"categoriesAndMechanics":["Wargame","World War II","Dice Rolling","Hexagon Grid"],"rating":3.783335,"complexity":2.5,"urlThumb":"https://cf.geekdo-images.com/iarb_w9x13ekzP4fSEdPSA__thumb/img/X2XtLIV8gANyQwTg3-zjdvBtTyA=/fit-in/200x150/filters:strip_icc()/pic4760646.jpg","urlImage":"https://cf.geekdo-images.com/iarb_w9x13ekzP4fSEdPSA__original/img/6ACUHHXLxBYapuXrNG5Zft895hk=/0x0/filters:format(jpeg)/pic4760646.jpg"},{"bggId":"187004","name":"Hamsterspiel","description":"Simply vintage roll &amp; move board game for children. The first player, who cross the finish line first, wins the game.&#10;&#10;","minPlayers":0,"maxPlayers":0,"minPlayTime":0,"maxPlayTime":0,"minAge":0,"categoriesAndMechanics":["Children's Game","Roll / Spin and Move"],"rating":3.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/t9KQmN753nkKrXR_G0oYag__thumb/img/KXItyB2LLHUdYFgbzN0-dFr-z1s=/fit-in/200x150/filters:strip_icc()/pic2728209.jpg","urlImage":"https://cf.geekdo-images.com/t9KQmN753nkKrXR_G0oYag__original/img/fvtQYHiT8f_GMF6Me57ATsTJTnk=/0x0/filters:format(jpeg)/pic2728209.jpg"},{"bggId":"187009","name":"Shanghai Incident: 28 January – 2 March 1932","description":"A faction of the Japanese military had been looking for an excuse to extend Japanese control deeper into the Chinese mainland. When several Chinese monks were beaten, this faction paid thugs to fan anti-Japanese activities in the Chinese sector of Shanghai. Seizing the &ldquo;opportunity,&rdquo; a small force of naval infantry invaded Chapei, the all-Chinese northern section of the city of Shanghai. But the Japanese had not counted on the quick reaction and effective fighting of the Nationalist Chinese forces from nearby Nanjing. The initial Japanese thrust was thrown back quickly. It took repeated reinforcements over the next five weeks for the Japanese to push the Chinese out of the city and away from the Huangpo and Yangtze Rivers. Shanghai would become a major springboard for further Japanese advances, but the battle had taken its toll. This game covers those five weeks of fighting.&#10;&#10;Shanghai Incident uses the Fire &amp; Movement system designed around the realities of mechanized warfare, giving motorized and/or specially-trained units clear advantages. Players can augment units at the instant of combat with support fire, provided by weapons ranging from mortars through cannon and light ground attack aircraft to heavy bombers. A seemingly predictable assault can be overturned at the last minute by heavy defending fires, while even small units may develop tremendous offensive punch with the assistance of a heavy bombardment. Winning the battle is a matter of maneuver, firepower and asset management.&#10;&#10;The Japanese military has greater overall skill and firepower, although the Chinese have two German-trained divisions. Both players have manpower limitations that are eased only when the Japanese player calls a pause to his offensive. Both sides therefore have to weigh time and space against numbers. The player who strikes the best balance will emerge the victor.&#10;&#10;Skills:&#10;&#10;     Level: Regiment&#10;     Hex: .625 miles (1 km)&#10;&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":120,"minAge":0,"categoriesAndMechanics":["Wargame","Hexagon Grid"],"rating":2.938235,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/fJgz0MteA2bPFxnVzuFjvg__thumb/img/6TDKjazh3Ex4reGhhfRA4Mh4yUI=/fit-in/200x150/filters:strip_icc()/pic2774929.jpg","urlImage":"https://cf.geekdo-images.com/fJgz0MteA2bPFxnVzuFjvg__original/img/EIh7PXdhe7KvFPFsUwxRXhV9ueg=/0x0/filters:format(jpeg)/pic2774929.jpg"},{"bggId":"187012","name":"World Facts","description":"World&ndash;Facts is an entertaining geographical guessing game for 2-6 players aged 12 and up. Does Canada or Australia count more inhabitants? Does Rio de Janeiro or Sydney indicate a higher average temperature? And does London or Rome have more annual rainfall? These are just a few questions, where the players need to find an answer. TIn doing so it is not necessary to know the exact values, but rather to estimate and compare them in between different countries and cities. Through the different categories of questions the game offers a lot of variety and excitement.&#10;&#10;Another special feature of World-Facts is its internationality. Via translations of all categories into 5 languages, global topics and the frequent use of symbols, World-Facts overcomes the usual focus of quiz games on just one language and culture. Thus, World-Facts is very suitable for multicultural groups as well.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":45,"minAge":12,"categoriesAndMechanics":["Card Game","Educational","Trivia","Betting and Bluffing"],"rating":2.996875,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/jSej-ydHGUBrwrjUAQPRLA__thumb/img/N35O-_7S-exiBSKPJTFy5mmjwFQ=/fit-in/200x150/filters:strip_icc()/pic2728694.png","urlImage":"https://cf.geekdo-images.com/jSej-ydHGUBrwrjUAQPRLA__original/img/e9gezd5YjZyQTcpwuIxFikCS08E=/0x0/filters:format(png)/pic2728694.png"},{"bggId":"187016","name":"Nam 65-75","description":"Nam 65-75 is a low-complexity turn-based hex-and counter wargame depicting the entire course of &quot;America's war in Vietnam&quot; (as the box states). The map covers all of South Vietnam.  Cambodia and Laos are not depicted, and the Ho Chi Minh Trail is abstracted.  Turns are one season (three months) and units are brigade/regiment in strength, with assets such air air support represented as separate counters.  Communist units have face-down sides that hide their strength and US/Allied units must first detect them in order to attack.  Combat is odds-based.  The US can have a variable level of commitment, which is both influenced by and influences the US Public Support level.  Soviet/Chinese Commitment is also tracked. Thus, the game tracks outside geopolitical influences on the conflict. Victory is achieved by causing (or avoiding) the collapse of the South Vietnam government, which depends on Communist capture of key towns (which reduces the Stability Level) and presence of NLF Sanctuaries (which is compared to the Stability Level). There are four scenarios: a 44-turn campaign scenario covering the entire war, and an 8-turn scenario covering just the Tet Offensive and its aftermath, a 14-turn scenario covering the Vietnamization period from 1970-72, and a Final Countdown scenario depicting the end of the war from 1973-75, which lasts 12 turns.&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":120,"maxPlayTime":300,"minAge":0,"categoriesAndMechanics":["Vietnam War","Wargame","Dice Rolling","Hexagon Grid"],"rating":4,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/SG_U7WBUSqOQLJjvJMQUdg__thumb/img/0koACKQ_ZXD7gPvn-N9i6P0QmHI=/fit-in/200x150/filters:strip_icc()/pic2735787.jpg","urlImage":"https://cf.geekdo-images.com/SG_U7WBUSqOQLJjvJMQUdg__original/img/5Y9sUQBlC5ZgbTKFeYF-5-tXsoQ=/0x0/filters:format(jpeg)/pic2735787.jpg"},{"bggId":"187018","name":"All About Vineland","description":"Another in the All About Town series. Vineland (New Jersey), 1983. Object is for players, using dice and playing pieces, to acquire 8 Travel Cards by moving about the gameboard. (The length of the game may be varied by changing the number of cards required to win.)&#10;&#10;Game includes $100 in Merchant Coupons, which have long since expired.&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":40,"minAge":8,"categoriesAndMechanics":["Dice","Travel","Roll / Spin and Move"],"rating":2.5,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/yjIZ0bjHplg-XFoLacx3YA__thumb/img/FCh_3-X4K6l_24S_e-Hn4EIRPyY=/fit-in/200x150/filters:strip_icc()/pic4489148.jpg","urlImage":"https://cf.geekdo-images.com/yjIZ0bjHplg-XFoLacx3YA__original/img/x5soWoCaQHNJyda3vXJ7bfU0fmY=/0x0/filters:format(jpeg)/pic4489148.jpg"},{"bggId":"187023","name":"誰も出てこない。 (Everyone Does Not Come Out)","description":"User summary:&#10;&#232;&#170;&#176;&#227;&#130;&#130;&#229;&#135;&#186;&#227;&#129;&#166;&#227;&#129;&#147;&#227;&#129;&#170;&#227;&#129;&#132;&#227;&#128;&#130; (Dare Mo Detekonai) means &quot;Nobody comes out&quot; in English.&#10;&#10;You are an adventurer who is exploring an ancient ruin for treasures. But the ruin is guarded by a dreadful golem. You have to escape from the approaching golem and get out of the ruin alive, while collecting more treasures than everyone else.&#10;&#10;But I bet you won't be able to survive it.&#10;&#10;Enjoy watching how the adventurers lose their lives!&#10;&#10;Publisher's summary:&#10;&#227;&#131;&#151;&#227;&#131;&#172;&#227;&#130;&#164;&#227;&#131;&#164;&#227;&#131;&#188;&#227;&#129;&#175;&#229;&#134;&#146;&#233;&#153;&#186;&#232;&#128;&#133;&#227;&#129;&#168;&#227;&#129;&#170;&#227;&#130;&#138;&#227;&#128;&#129;&#229;&#143;&#164;&#228;&#187;&#163;&#233;&#129;&#186;&#232;&#183;&#161;&#227;&#129;&#171;&#231;&#156;&#160;&#227;&#130;&#139;&#230;&#149;&#176;&#229;&#164;&#154;&#227;&#129;&#174;&#232;&#178;&#161;&#229;&#174;&#157;&#227;&#130;&#146;&#230;&#140;&#129;&#227;&#129;&#161;&#229;&#184;&#176;&#227;&#130;&#139;&#228;&#186;&#139;&#227;&#129;&#140;&#231;&#155;&#174;&#231;&#154;&#132;&#227;&#129;&#167;&#227;&#129;&#153;&#227;&#128;&#130;&#227;&#129;&#151;&#227;&#129;&#139;&#227;&#129;&#151;&#239;&#188;&#129;&#227;&#129;&#157;&#227;&#129;&#174;&#233;&#129;&#186;&#232;&#183;&#161;&#227;&#129;&#171;&#227;&#129;&#175;&#230;&#129;&#144;&#227;&#130;&#141;&#227;&#129;&#151;&#227;&#129;&#132;&#233;&#150;&#128;&#231;&#149;&#170;&#227;&#128;&#140;&#227;&#130;&#180;&#227;&#131;&#188;&#227;&#131;&#172;&#227;&#131;&#160;&#227;&#128;&#141;&#227;&#129;&#140;&#227;&#129;&#132;&#227;&#129;&#190;&#227;&#129;&#153;&#227;&#131;&#187;&#227;&#131;&#187;&#227;&#131;&#187;&#10;&#232;&#191;&#171;&#227;&#130;&#138;&#230;&#157;&#165;&#227;&#130;&#139;&#227;&#130;&#180;&#227;&#131;&#188;&#227;&#131;&#172;&#227;&#131;&#160;&#227;&#129;&#139;&#227;&#130;&#137;&#233;&#128;&#131;&#227;&#129;&#146;&#229;&#187;&#182;&#227;&#129;&#179;&#227;&#128;&#129;&#232;&#170;&#176;&#227;&#130;&#136;&#227;&#130;&#138;&#227;&#130;&#130;&#229;&#164;&#154;&#227;&#129;&#143;&#227;&#129;&#174;&#232;&#178;&#161;&#229;&#174;&#157;&#227;&#130;&#146;&#230;&#140;&#129;&#227;&#129;&#161;&#229;&#184;&#176;&#227;&#130;&#138;&#227;&#129;&#190;&#227;&#129;&#151;&#227;&#130;&#135;&#227;&#129;&#134;&#239;&#188;&#129;&#10;&#227;&#129;&#167;&#227;&#130;&#130;&#227;&#129;&#141;&#227;&#129;&#163;&#227;&#129;&#168;&#227;&#128;&#129;&#232;&#170;&#176;&#227;&#130;&#130;&#230;&#140;&#129;&#227;&#129;&#161;&#229;&#184;&#176;&#227;&#130;&#140;&#227;&#129;&#170;&#227;&#129;&#132;&#227;&#129;&#167;&#227;&#129;&#151;&#227;&#130;&#135;&#227;&#129;&#134;&#227;&#128;&#130;&#10;&#230;&#152;&#175;&#233;&#157;&#158;&#227;&#131;&#151;&#227;&#131;&#172;&#227;&#130;&#164;&#227;&#131;&#164;&#227;&#131;&#188;&#227;&#129;&#140;&#230;&#172;&#161;&#227;&#128;&#133;&#227;&#129;&#168;&#230;&#149;&#163;&#227;&#129;&#163;&#227;&#129;&#166;&#227;&#130;&#134;&#227;&#129;&#143;&#227;&#129;&#149;&#227;&#129;&#190;&#227;&#130;&#146;&#230;&#165;&#189;&#227;&#129;&#151;&#227;&#130;&#147;&#227;&#129;&#167;&#227;&#129;&#143;&#227;&#129;&#160;&#227;&#129;&#149;&#227;&#129;&#132;&#227;&#128;&#130;&#10;&#10;","minPlayers":2,"maxPlayers":6,"minPlayTime":25,"maxPlayTime":0,"minAge":10,"categoriesAndMechanics":["Card Game","Exploration","Horror","Deck, Bag, and Pool Building","Point to Point Movement"],"rating":3.016665,"complexity":2,"urlThumb":"https://cf.geekdo-images.com/p3nx-1zxwDQmH28UijFYVg__thumb/img/QzAWfXe6VsYgiL07UBKtvz0-TXg=/fit-in/200x150/filters:strip_icc()/pic2725925.png","urlImage":"https://cf.geekdo-images.com/p3nx-1zxwDQmH28UijFYVg__original/img/GHuGsNX-1eUVyogdH7NXNGfZ7RA=/0x0/filters:format(png)/pic2725925.png"},{"bggId":"187030","name":"Mansfield Crisis in the Pine Barrens 8 April 1864","description":"In early 1864, Union Gen. Nathaniel Banks led a small army up Louisiana's Red River. His objective, in conjunction with an overland campaign through Arkansas, was the Confederate Trans-Mississippi capital at Shreveport. Poor coordination of the two columns enabled the Confederates to concentrate their slender resources against each in turn. Banks was first, and in early April his spearhead was hit near the crossroads of Mansfield. Historically, the Union forces, strung out on the march, were routed piecemeal, but the battle could have gone the other way.&#10;&#10;Mansfield uses the simplified QuickPlay version of the Musket &amp; Saber system of warfare during the muzzle-loading era. Combat is based on unit quality rather than raw numbers, and rewards use of historical tactics. All units are susceptible to rout when weakened, so players must maintain reserves. Leaders enhance unit capabilities. Winning the battle depends on deployment, thoughtful maneuver to concentrate at the key points, the proper coordination of arms, careful use of leaders and special units, and an understanding of the strengths and weaknesses of each army.&#10;&#10;Scale:&#10;&#10;     Level: Brigade&#10;     Hex: 440 yards&#10;&#10;&#10;","minPlayers":2,"maxPlayers":2,"minPlayTime":60,"maxPlayTime":90,"minAge":0,"categoriesAndMechanics":["American Civil War","Wargame","Hexagon Grid"],"rating":3.01111,"complexity":1,"urlThumb":"https://cf.geekdo-images.com/lGH2u0SaxYBQLqOMbTB_xQ__thumb/img/PoZk9rPgeb-GPPQqUprUw5lIZ7A=/fit-in/200x150/filters:strip_icc()/pic2730278.jpg","urlImage":"https://cf.geekdo-images.com/lGH2u0SaxYBQLqOMbTB_xQ__original/img/B11xed8P2SdYJDW_jWqz0Y90vUw=/0x0/filters:format(jpeg)/pic2730278.jpg"},{"bggId":"187038","name":"Coban Received","description":"A trick-taking card game in which the hand stakes are revealed to only some of the players, and the trump suit is determined as the hand is played out by players bidding to pay out victory points to those who follow suit.&#10;&#10;","minPlayers":4,"maxPlayers":6,"minPlayTime":20,"maxPlayTime":30,"minAge":10,"categoriesAndMechanics":["Card Game","Auction/Bidding","Trick-taking"],"rating":3,"complexity":0},{"bggId":"187044","name":"Disney Frozen: Snow Adventure","description":"In the kingdom Arendelle live two princesses: Elsa and Anna. The older princess Elsa has the power to rule over snow and ice. When people learn about her unusual gift, they consider her a witch. So Elsa decides to run away, causing an eternal winter. Anna embarks on a great search for her sister. She is accompanied by Kristoff, who knows all the secrets of the mountain trails, his loyal reindeer Sven, and the funny snowman Olaf. Will they reach the ice castle of Elsa, or will the harsh winter thwart their plans?&#10;&#10;Each player chooses one of the characters - Anna, Kristoff, Sven or Olaf. They all have various special abilities like doubling the pips on the die or adding an additional pip to the die, or rerolling a die.&#10;There are two parts to this board game. First, you roll a die and climb through the icy mountains to reach the rushing river. On the way, you must deal with the river's strong current, icy gales and an avalanche! Then to cross the river, you and the other players must collect five ice tokens. If you fail to do that, you all loose and the winter wins.&#10;The second part is where you must continue on your own. Tell a short story, sing a song or draw a character to reach the castle and win the game!&#10;&#10;","minPlayers":2,"maxPlayers":4,"minPlayTime":15,"maxPlayTime":25,"minAge":4,"categoriesAndMechanics":["Children's Game","Movies / TV / Radio theme","Acting","Dice Rolling","Roll / Spin and Move","Singing","Variable Player Powers"],"rating":2.16,"complexity":0,"urlThumb":"https://cf.geekdo-images.com/NT0dNxChXaCORFx8e2G-Zg__thumb/img/kXLmt1oZl1QLVyFsYPrT33qB5Yo=/fit-in/200x150/filters:strip_icc()/pic3892042.png","urlImage":"https://cf.geekdo-images.com/NT0dNxChXaCORFx8e2G-Zg__original/img/x265ZOxfpOGg4TIOFmmG50tqem0=/0x0/filters:format(png)/pic3892042.png"}]